<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>ConsentText</key>	<dict>		<key>en</key>		<string>The power management profile provides a means to configure various settings related to device's power management features.            To turn off this profile on your iOS device open Settings, tapping "General," then "Profiles &amp; Device Management," then "Power Management profile," and tap "Delete Profile." This profile is not relevant for OSX devices.        </string>        <key>default</key>        <string>The power management profile provides a means to configure various settings related to device's power management features.            To turn off this profile on your iOS device open Settings, tapping "General," then "Profiles &amp; Device Management," then "Power Management profile," and tap "Delete Profile." This profile is not relevant for OSX devices.        </string>	</dict>	<key>PayloadContent</key>	<array>		<dict>			<key>PayloadIdentifier</key>			<string>com.apple.defaults.1</string>			<key>PayloadType</key>			<string>com.apple.defaults.managed</string>			<key>PayloadUUID</key>			<string>FAC88432-ACBD-4FE5-80F7-8D0AE17A9108</string>			<key>PayloadVersion</key>			<integer>1</integer>            <key>PayloadContent</key>            <array>                <dict>                    <key>DefaultsDomainName</key>                    <string>com.apple.powerd.profile</string>                    <key>DefaultsData</key>                    <dict>                        <key>CriticalAcOverride</key>                        <integer>1</integer>                    </dict>                </dict>            </array>        </dict>	</array>	<key>PayloadDescription</key>	<string>Profile to configure power management settings on iOS device.</string>	<key>PayloadDisplayName</key>	<string>Power Management profile</string>	<key>PayloadIdentifier</key>	<string>com.apple.powerd.profile</string>	<key>PayloadOrganization</key>	<string>Apple, Inc</string>	<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadUUID</key>	<string>EFC4D076-E46C-4226-9313-287873BBF960</string>	<key>PayloadVersion</key>	<integer>1</integer>	<key>TargetDeviceType</key>	<integer>1</integer>	<key>PayloadRebootSuggested</key>	<true/></dict></plist>