# $XFree86: xc/programs/Xserver/hw/xfree86/XF86Setup/texts/ja/help_monitor.tcl,v 1.2 1998/04/05 15:30:32 robin Exp $
#
set message "\n\n\n\
	使用しているディスプレイの水平／垂直周波数を入力\n\
	してください。ディスプレイのマニュアルの「仕様」の\n\
	欄などに記載してあるはずです。\n\n\
	もし、それが見つからなかった場合には一般的なディスプレイの\n\
	仕様の一覧から、自分のディスプレイに合っていると思う\n\
	ものを選んで下さい。\n\n\
	これらの値は、正確でなければなりません。ディスプレイの\n\
	仕様を越えた周波数で画面を表示しようとすると、最悪の\n\
	場合、ディスプレイが煙を吹くかも知れません。そうでなくても\n\
	ディスプレイに悪影響を及ぼすおそれは十分にあります。\n\
	ここに入力する値が正確であれば、サーバーはディスプレイの\n\
	限度を越えた解像度・色数などを自動的に検知し、表示できる\n\
	モードのみを使用します。"
