# $XFree86: xc/programs/Xserver/hw/xfree86/XF86Setup/texts/ja/help_intro.tcl,v 1.2 1998/04/05 15:30:31 robin Exp $
#
 if !$pc98 {
    set message "\n\
	    設定は、６つの部分にわかれています。上にならんでいるボタンを\n\
	    押せば、その項目の設定がはじまります。どんな順番で設定を\n\
	    していっても構わないし、何度設定をやり直しても構いませんが、\n\
	    まずはマウスを動かせるようにしたほうがいいでしょう。キーボード\n\
	    だけで設定をすべて行なうのは、大変です。\n\n\
	    マウスの設定が済むまでの間は、以下のキー入力によって操作してください :\n\n\
	    \tTAB , Ctrl+TAB\t次の項目に移動します\n\
	    \tSHIFT+TAB\t前の項目に移動します\n\
	    \tカーソルキー\t押した方向に移動します\n\
	    \tリターン(ENTER)\t現在、カーソルのある項目を有効にします\n\n\
	    そのほかに、ALT と、項目の中のアンダーラインの引いてある\n\
	    文字を押せば、その項目が有効になります。"
} else {
    set message "\n\
	    設定は、５つの部分にわかれています。上にならんでいるボタンを\n\
	    押せば、その項目の設定がはじまります。どんな順番で設定を\n\
	    していっても構わないし、何度設定をやり直しても構いませんが、\n\
	    まずはマウスを動かせるようにしたほうがいいでしょう。キーボード\n\
	    だけで設定をすべて行なうのは、大変です。\n\n\
	    マウスの設定が済むまでの間は、以下のキー入力によって操作してください :\n\n\
	    \tTAB , Ctrl+TAB\t次の項目に移動します\n\
	    \tSHIFT+TAB\t前の項目に移動します\n\
	    \tカーソルキー\t押した方向に移動します\n\
	    \tリターン\t現在、カーソルのある項目を有効にします\n\n\
	    そのほかに、GRPH と、項目の中のアンダーラインの引いてある\n\
	    文字を押せば、その項目が有効になります。"
}
