# $XFree86: xc/programs/Xserver/hw/xfree86/XF86Setup/texts/ja/help_modeselect.tcl,v 1.2 1998/04/05 15:30:32 robin Exp $
#
set message "\n\n\n\
	使いたい解像度をすべて選択し、通常使用する色数を一つ選択\n\
	してください。ここで選択した色数は、X サーバーを起動する際\n\
	にオプションによって明示的に指定することで変更することも\n\
	できます。また、グラフィックカードと VRAM の量によって解\n\
	像度と色数は制限されます。表示できない組合せを選んだとし\n\
	ても実際に使用することはできないので注意して下さい。\n\n\
	なお、ディスプレイの性能を越えた解像度が選択されて\n\
	いる場合、サーバーはそれを自動的に検知されて設定が\n\
	削除されるのでそのような解像度を選ぶのも意味がありません。\n\n\
	複数の解像度を選択した場合、「その他」のセクションで \n\
	サーバーが立ち上がっている状態での解像度変更を有効にして\n\
	いれば、サーバーを使用中に CTRL+ALT(GRPH)+'+' を押すこと\n\
	で解像度の変更が可能です。もし、実際に起動してみて画面\n\
	がみだれたりした場合もより低い解像度に切替えれば表示で\n\
	きることが多いので、その場合このホットキーを試してみる\n\
	とよいでしょう。\n"
