# $XFree86: xc/programs/Xserver/hw/xfree86/XF86Setup/texts/ja/help_card.tcl,v 1.2 1998/04/05 15:30:31 robin Exp $
#
global cardDetail

if { $cardDetail == "std" } {
    set message "\n\n\
	    リストから使用しているグラフィックカードを選択して下さい。\n\n\
	    もし、そのカード用の README ファイルがあれば <README ファイルを\n\
	    読む> を選択できるようになります。可能な限り、読むように\n\
	    してください。README ファイルがなければこのボタンは\n\
	    灰色になって、選択できなくなっているはずです。\n\n\
	    もし、使っているグラフィックカードがリストにない時、\n\
	    あるいは README ファイルに「このグラフィックカードは\n\
	    特殊な設定が必要だ」と書いてあった場合には <詳細設定> を\n\
	    押して必要な設定を行なって下さい。"
} else {
    global DeviceIDs
    if { [llength $DeviceIDs] > 1 } {
	set message "\n\
		リストから使用しているグラフィックカードを選択すれば、\n\
		ほとんどの設定は済んでいるはずです。\n"
    } else {
	set message "\n\n"
    }
    append message "\
	    まず、グラフィックカードに最適なサーバーを選んで\n\
	    ください。そして<README ファイルを読む> を押して\n\
	    そのサーバーに対応する README を読んで下さい。\n\
	    もし、このボタンが有効になってなければ、その\n\
	    には README ファイルが存在していません。\n\n\
	    次に、グラフィックカードに使われているチップセットと\n\
	    RAMDAC を README に書いてあるように選んで下さい。\n\
	    たいていはサーバーが自動認識(Probe) してくれるので\n\
	    これを設定する必要はありません。\n\n\
	    クロックチップについては、チップセットにクロック\n\
	    チップが組み込まれているなどの特殊な場合でなければ\n\
	    選ぶ必要があります。\n\n\
	    次に、README を読みながら必要なオプションを設定\n\
	    してください。\n\n\
	    いくつかの速度が選べるような種類の RAMDACであれば、\n\
	    RAMDAC の最大速度を設定することもできます。そうしない場合、\n\
	    サーバーは最大速度を自動認識することはできないので、その \n\
	    RAMDAC で使用可能な一番遅い速度が使われることになります。\n\n\
	    その他に、VRAM の量を設定することもできます。ただし、\n\
	    通常はサーバーが自動認識してくれるのでその必要は\n\
	    ありません。"
}
