Repository: apple-open-source/macos
Catalog: ChatServer/libraries/gettext-0.13/gettext-tools/po/*.po
Languages: sl

source: invalid argument `%s' for `%s'
sl: neveljaven argument %s za ,%s`

source: ambiguous argument `%s' for `%s'
sl: dvoumen argument %s za ,%s`

source: Valid arguments are:
sl: Veljavni argumenti so:

source: error while opening "%s" for reading
sl: datoteke "%s" ni moè odpreti za branje

source: cannot open backup file "%s" for writing
sl: varnostnega izvoda "%s" ni mogoèe odpreti za pisanje

source: error reading "%s"
sl: napaka pri branju "%s"

source: error writing "%s"
sl: napaka pri pisanju na "%s"

source: error after reading "%s"
sl: napaka po branju "%s"

source: Unknown system error
sl: Neznana sistemska napaka

source: %s subprocess failed
sl: %s podproces neuspe¹en

source: %s: option `%s' is ambiguous
sl: %s: izbira ,%s` je dvoumna

source: %s: option `--%s' doesn't allow an argument
sl: %s: izbira ,--%s` ne dovoljuje argumenta

source: %s: option `%c%s' doesn't allow an argument
sl: %s: izbira ,%c%s` ne dovoljuje argumenta

source: %s: option `%s' requires an argument
sl: %s: izbira ,%s` zahteva argument

source: %s: unrecognized option `--%s'
sl: %s: neprepoznana izbira ,--%s`

source: %s: unrecognized option `%c%s'
sl: %s: neprepoznana izbira ,%c%s`

source: %s: illegal option -- %c
sl: %s: nedovoljena izbira -- %c

source: %s: invalid option -- %c
sl: %s: neveljavna izbira -- %c

source: %s: option requires an argument -- %c
sl: %s: izbira zahteva argument -- %c

source: %s: option `-W %s' is ambiguous
sl: %s: izbira ,-W %s` je dvoumna

source: %s: option `-W %s' doesn't allow an argument
sl: %s: izbira ,-W %s` ne dovoljuje argumenta

source: Java compiler not found, try installing gcj or set $JAVAC
sl: Prevajalnika za javo ni najti; namestite gcj ali nastavite $JAVAC

source: Java virtual machine not found, try installing gij or set $JAVA
sl: Virtualnega javanskega stroja ni najti; namestite gij ali nastavite $JAVA

source: memory exhausted
sl: zmanjkalo pomnilnika

source: cannot create pipe
sl: cevovoda ni mogoèe ustvariti

source: %s subprocess
sl: %s podprocesov

source: %s subprocess got fatal signal %d
sl: %s podprocesov prejelo kritièni signal %d

source: a format specification for argument %u, as in '%s', doesn't exist in 'msgid'
sl: v ,msgid` ni formatnega doloèila za argument %u, kot v ,%s`

source: a format specification for argument %u doesn't exist in '%s'
sl: v ,%2$s` ni formatnega doloèila za argument %1$u

source: format specifications in 'msgid' and '%s' for argument %u are not the same
sl: formatni doloèili v ,msgid` in ,%s` za argument %u nista enaki

source: number of format specifications in 'msgid' and '%s' does not match
sl: ¹tevili formatnih doloèil v ,msgid` in ,%s` se ne ujemata

source: a format specification for argument {%u}, as in '%s', doesn't exist in 'msgid'
sl: v ,msgid` ni formatnega doloèila za argument {%u}, kot v ,%s`

source: a format specification for argument {%u} doesn't exist in '%s'
sl: v ,%2$s` ni formatnega doloèila za argument {%1$u}

source: format specifications in 'msgid' and '%s' for argument {%u} are not the same
sl: formatni doloèili v ,msgid` in ,%s` za argument {%u} nista enaki

source: format specifications in 'msgid' and '%s' are not equivalent
sl: formatni doloèili v ,msgid` in ,%s` nista enakovredni

source: format specifications in '%s' are not a subset of those in 'msgid'
sl: formatna doloèila v ,%s` niso podmno¾ica tistih v ,msgid`

source: a format specification for argument '%s' doesn't exist in '%s'
sl: v ,%2$s` ni formatnega doloèila za argument ,%1$s`

source: format specifications in 'msgid' expect a mapping, those in '%s' expect a tuple
sl: formatno doloèilo v ,msgid` zahteva preslikavo, tisto v ,%s` pa prièakuje n-terèek

source: format specifications in 'msgid' expect a tuple, those in '%s' expect a mapping
sl: formatno doloèilo v ,msgid` zahteva n-terèek, tisto v ,%s` pa prièakuje preslikavo

source: a format specification for argument '%s', as in '%s', doesn't exist in 'msgid'
sl: v ,msgid` ni formatnega doloèila za argument ,%s`, kot v ,%s`

source: format specifications in 'msgid' and '%s' for argument '%s' are not the same
sl: formatni doloèili v ,msgid` in ,%s` za argument ,%s` nista enaki

source: Copyright (C) %s Free Software Foundation, Inc. This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
sl: Copyright (C) %s Free Software Foundation, Inc. To je prost program; pogoji, pod katerimi ga lahko razmno¾ujete in raz¹irjate so navedeni v izvorni kodi. Za program ni NOBENEGA jamstva, niti jamstev USTREZNOSTI ZA PRODAJO ali PRIMERNOSTI ZA RABO.

source: Written by %s.
sl: Avtor %s.

source: too many arguments
sl: preveè argumentov

source: Try `%s --help' for more information.
sl: Poskusite ,%s --help` za izèrpnej¹a navodila

source: Usage: %s [OPTION]
sl: Uporaba: %s [IZBIRA]

source: Print the machine's hostname.
sl: Izpis gostiteljskega imena raèunalnika.

source: Output format:
sl: Oblika izpisa:

source: -s, --short short host name
sl: -s, --short kratka oblika gostiteljskega imena

source: -f, --fqdn, --long long host name, includes fully qualified domain name, and aliases
sl: -f, --fqdn, --long dolga oblika gostiteljskega imena, vkljuèno s polnim internetim imenom in vzdevki

source: -i, --ip-address addresses for the hostname
sl: -i, --ip-address internetni naslov za gostiteljsko ime

source: Informative output:
sl: Informativni izpis:

source: -h, --help display this help and exit
sl: -h, --help ta navodila

source: -V, --version output version information and exit
sl: -V, --version razlièica programa

source: Report bugs to <bug-gnu-gettext@gnu.org>.
sl: Morebitne napake v programu sporoèite na <bug-gnu-gettext@gnu.org>.

source: could not get host name
sl: gostiteljskega imena ni moè ugotoviti

source: at most one input file allowed
sl: dovoljena je najveè ena vhodna datoteka

source: %s and %s are mutually exclusive
sl: %s in %s se med seboj izkljuèujeta

source: Usage: %s [OPTION] [INPUTFILE]
sl: Uporaba: %s [IZBIRA] [VHODNA_DATOTEKA]

source: Filters the messages of a translation catalog according to their attributes, and manipulates the attributes.
sl: Filtriranje sporoèil iz kataloga prevodov glede na njihova doloèila in rokovanje z njimi.

source: Mandatory arguments to long options are mandatory for short options too.
sl: Èe je pri dolgi obliki izbire naveden obvezen argument, je ta obvezen tudi za kratko obliko.

source: Input file location:
sl: Izbira vhodne datoteke:

source: INPUTFILE input PO file
sl: VHODNA_DATOTEKA vhodna datoteka PO

source: -D, --directory=DIRECTORY add DIRECTORY to list for input files search
sl: -D, --directory=IMENIK vhodne datoteke i¹èemo tudi v navedenem IMENIKU

source: If no input file is given or if it is -, standard input is read.
sl: Èe vhodna datoteka ni podana ali je enaka -, se bere standardni vhod.

source: Output file location:
sl: Izbira izhodne datoteke:

source: -o, --output-file=FILE write output to specified file
sl: -o, --output-file=DATOTEKA izhod zapisujemo v navedeno DATOTEKO

source: The results are written to standard output if no output file is specified or if it is -.
sl: Èe izhodna datoteka ni podana ali je enaka -, se rezultat izpi¹e na standardni izhod.

source: Message selection:
sl: Izbira sporoèil:

source: --translated keep translated, remove untranslated messages
sl: --translated obdr¾imo prevedena sporoèila, zavr¾emo neprevedena

source: --untranslated keep untranslated, remove translated messages
sl: --untranslated obdr¾imo neprevedena sporoèila, zavr¾emo prevedena

source: --no-fuzzy remove 'fuzzy' marked messages
sl: --no-fuzzy brez ohlapnih samodejno prevedenih sporoèil

source: --only-fuzzy keep 'fuzzy' marked messages
sl: --only-fuzzy zgolj ohlapna samodejno prevedena sporoèila

source: --no-obsolete remove obsolete #~ messages
sl: --no-obsolete brez zastarelih (#~) sporoèil

source: --only-obsolete keep obsolete #~ messages
sl: --only-obsolete zgolj zastarela (#~) sporoèila

source: Attribute manipulation:
sl: Rokovanje z doloèili:

source: --set-fuzzy set all messages 'fuzzy'
sl: --set-fuzzy vsa sporoèila oznaèimo kot ohlapno pprevedena

source: --clear-fuzzy set all messages non-'fuzzy'
sl: --clear-fuzzy izbri¹emo vse oznake o ohlapnosti prevodov

source: --set-obsolete set all messages obsolete
sl: --set-obsolete vsa sporoèila oznaèimo kot zastarela

source: --clear-obsolete set all messages non-obsolete
sl: --clear-obsolete izbri¹emo vse oznake o zastarelosti prevodov

source: --only-file=FILE.po manipulate only entries listed in FILE.po
sl: --only-file=DATOTEKA.po obdelamo le vnose, navedene v DATOTEKI.po

source: --ignore-file=FILE.po manipulate only entries not listed in FILE.po
sl: --ignore-file=DATOTEKA.po obdelamo vnose razen navedenih v DATOTEKI.po

source: --fuzzy synonym for --only-fuzzy --clear-fuzzy
sl: --fuzzy isto kot --only-fuzzy --clear-fuzzy

source: --obsolete synonym for --only-obsolete --clear-obsolete
sl: --obsolete isto kot --only-obsolete --clear-obsolete

source: Output details:
sl: Podrobnosti izpisa:

source: -e, --no-escape do not use C escapes in output (default)
sl: -e, --no-escape brez ube¾nih sekvenc v skladnji jezika C (privzeto)

source: -E, --escape use C escapes in output, no extended chars
sl: -E, --escape z ube¾nimi sekvencami v skladnji C, brez raz¹irjenega nabora znakov

source: --force-po write PO file even if empty
sl: --force-po vedno izpi¹emo datoteko PO, èetudi prazno

source: -i, --indent write the .po file using indented style
sl: -i, --indent izpis datoteke PO z zamiki

source: --no-location do not write '#: filename:line' lines
sl: --no-location brez vrstic ,#: datoteka:vrstica` v izpisu

source: -n, --add-location generate '#: filename:line' lines (default)
sl: -n, --add-location z vrsticami ,#: datoteka:vrstica` v izpisu (privzeto)

source: --strict write out strict Uniforum conforming .po file
sl: --strict izpis v strogi obliki Uniforum, brez raz¹iritev GNU

source: -w, --width=NUMBER set output page width
sl: -w, --width=©TEVILO ¹irina strani pri izpisu, v znakih

source: --no-wrap do not break long message lines, longer than the output page width, into several lines
sl: --no-wrap brez deljenja dolgih sporoèil v veè vrstic

source: -s, --sort-output generate sorted output
sl: -s, --sort-output izhod abecedno urejen po sporoèilih

source: -F, --sort-by-file sort output by file location
sl: -F, --sort-by-file izhod abecedno urejen po izvornih datotekah

source: impossible selection criteria specified (%d < n < %d)
sl: doloèeni kriteriji izbire niso mogoèi (%d < n < %d)

source: Usage: %s [OPTION] [INPUTFILE]...
sl: Uporaba: %s [IZBIRA] [VHODNA_DATOTEKA]...

source: Concatenates and merges the specified PO files. Find messages which are common to two or more of the specified PO files. By using the --more-than option, greater commonality may be requested before messages are printed. Conversely, the --less-than option may be used to specify less commonality before messages are printed (i.e. --less-than=2 will only print the unique messages). Translations, comments and extract comments will be cumulated, except that if --use-first is specified, they will be taken from the first PO file to define them. File positions from all PO files will be cumulated.
sl: Zdru¾imo dane datoteke PO. Poi¹èemo sporoèila, ki so skupna dvema ali veè podanima datotekama PO. Z izbiro --more-than pred izpisom zahtevamo veè skupnih lastnosti. Obratno z izbiro --less-than izberemo manj skupnih lastnosti (npr. --less-than=2 izpi¹e samo unikatna sporoèila). Prevodi, komentarji prevajalcev in komentarji pri izvlaèenju iz vseh datotek se ohranijo, razen èe z izbiro --use-first ne zahtevamo, da se ohranijo samo iz prve datoteke PO, ki jih definira. Mesta v datotekah iz vseh datotek PO se ohranijo.

source: INPUTFILE ... input files
sl: VHODNA_DATOTEKA ... vhodna datoteka (ali veè vhodnih datotek)

source: -f, --files-from=FILE get list of input files from FILE
sl: -f, --files-from=DATOTEKA seznam vhodnih datotek preberemo iz DATOTEKE

source: If input file is -, standard input is read.
sl: Èe je vhodna datoteka enaka -, se bere standardni vhod.

source: -<, --less-than=NUMBER print messages with less than this many definitions, defaults to infinite if not set
sl: -<, --less-than=©TEVILO izpi¹i sporoèila z manj kot ©TEVILO definicij (privzeta vrednost je neskonèno)

source: ->, --more-than=NUMBER print messages with more than this many definitions, defaults to 0 if not set
sl: ->, --more-than=©TEVILO izpi¹i sporoèila z veè kot ©TEVILO definicij (privzeta vrednost je 1)

source: -u, --unique shorthand for --less-than=2, requests that only unique messages be printed
sl: -u, --unique okraj¹ava za --less-than=2, izpi¹emo samo enolièno definirana sporoèila

source: -t, --to-code=NAME encoding for output
sl: -t, --to-code=NABOR nabor znakov izhodne datoteke

source: --use-first use first available translation for each message, don't merge several translations
sl: --use-first uporabimo prvi prevod sporoèila, na katerega naletimo; ne zdru¾ujemo veè prevodov

source: no input files given
sl: vhodni datoteki nista podani

source: exactly 2 input files required
sl: potrebni sta natanèno dve vhodni datoteki

source: Usage: %s [OPTION] def.po ref.pot
sl: Uporaba: %s [IZBIRA] def.po ref.po

source: Compare two Uniforum style .po files to check that both contain the same set of msgid strings. The def.po file is an existing PO file with the translations. The ref.pot file is the last created PO file, or a PO Template file (generally created by xgettext). This is useful for checking that you have translated each and every message in your program. Where an exact match cannot be found, fuzzy matching is used to produce better diagnostics.
sl: Preverimo, èe dve podani datoteki v obliki Uniforum vsebujeta isti nabor nizov msgid. Datoteka def.po je obstojeèa datoteka PO s starimi prevodi, datoteka ref.po pa nazadnje ustvarjena datoteka PO (v splo¹nem z xgettext). To je uporabno, ko ¾elimo preveriti, èe so prevedena res vsa sporoèila v programu. Kadar ne najdemo natanènega ujemanja msgid, zaradi bolj¹e diagnostike poskusimo z ohlapnim (fuzzy) algoritmom.

source: def.po translations
sl: def.po prevodi

source: ref.pot references to the sources
sl: ref.pot sklici na vire

source: Operation modifiers:
sl: Modifikatorji delovanja:

source: -m, --multi-domain apply ref.pot to each of the domains in def.po
sl: -m, --multi-domain ref.po uporabimo na vseh domenah iz def.po

source: this message is used but not defined...
sl: to sporoèilo je uporabljeno, a ne definirano...

source: ...but this definition is similar
sl: ...a ta definicija je podobna

source: this message is used but not defined in %s
sl: to sporoèilo je uporabljeno, a ne definirano v %s

source: warning: this message is not used
sl: opozorilo: to sporoèilo ni uporabljeno

source: found %d fatal error
sl: %d kritiènih napak

source: at least two files must be specified
sl: podani morata biti vsaj dve datoteki

source: Find messages which are common to two or more of the specified PO files. By using the --more-than option, greater commonality may be requested before messages are printed. Conversely, the --less-than option may be used to specify less commonality before messages are printed (i.e. --less-than=2 will only print the unique messages). Translations, comments and extract comments will be preserved, but only from the first PO file to define them. File positions from all PO files will be cumulated.
sl: Poi¹èe sporoèila, ki so skupna dvema ali veè podanima datotekama PO. Z izbiro --more-than pred izpisom zahtevamo veè skupnih lastnosti. Obratno z izbiro --less-than izberemo manj skupnih lastnosti (npr. --less-than=2 izpi¹e samo unikatna sporoèila). Prevodi, komentarji prevajalcev in komentarji pri izvlaèenju se ohranijo samo iz prve podane datoteke PO. Mesta v datotekah se ohranijo iz vseh datotek PO.

source: ->, --more-than=NUMBER print messages with more than this many definitions, defaults to 1 if not set
sl: ->, --more-than=©TEVILO izpi¹i sporoèila z veè kot ©TEVILO definicij (privzeta vrednost je 1)

source: --omit-header don't write header with `msgid ""' entry
sl: --omit-header brez glave z vnosom "msgid"

source: Converts a translation catalog to a different character encoding.
sl: Pretvarjanje kataloga sporoèil v drug kodni nabor.

source: Conversion target:
sl: Cilj pretvorbe:

source: The default encoding is the current locale's encoding.
sl: Privzeta vrednost je kodni nabor izbrane krajevne nastavitve.

source: -i, --indent indented output style
sl: -i, --indent izpis datoteke PO z zamiki

source: --no-location suppress '#: filename:line' lines
sl: --no-location brez vrstic ,#: datoteka:vrstica` v izpisu

source: --add-location preserve '#: filename:line' lines (default)
sl: --add-location z vrsticami ,#: datoteka:vrstica` v izpisu (privzeto)

source: --strict strict Uniforum output style
sl: --strict izpis v strogi obliki Uniforum, brez raz¹iritev GNU

source: no input file given
sl: vhodna datoteka ni podana

source: exactly one input file required
sl: zahtevana je natanèno ena vhodna datoteka

source: Usage: %s [OPTION] INPUTFILE
sl: Uporaba: %s [IZBIRA] VHODNA_DATOTEKA

source: Creates an English translation catalog. The input file is the last created English PO file, or a PO Template file (generally created by xgettext). Untranslated entries are assigned a translation that is identical to the msgid.
sl: Ustvarimo katalog angle¹kih sporoèil. Vhodna datoteka je nazadnje ustvarjena angle¹ka datoteka PO ali vzorèna datoteka POT (slednjo navadno ustvarimo z ukazom xgettext). Neprevedenim sporoèilom se pripi¹e prevod, enak izvirniku msgid.

source: INPUTFILE input PO or POT file
sl: VHODNA_DATOTEKA vhodna datoteka PO

source: missing command name
sl: manjka ime ukaza

source: Usage: %s [OPTION] COMMAND [COMMAND-OPTION]
sl: Uporaba: %s [IZBIRA] UKAZ [IZBIRA-UKAZA]

source: Applies a command to all translations of a translation catalog. The COMMAND can be any program that reads a translation from standard input. It is invoked once for each translation. Its output becomes msgexec's output. msgexec's return code is the maximum return code across all invocations.
sl: Na vsakem prevodu iz kataloga izvedemo dani ukaz. UKAZ je lahko ime kateregakoli programa, ki bere s standardnega vhoda. Po¾ene se za vsak prevod posebej. Izhod programa postane izhod programa msgexec. Izhodna koda programa msgexec je najveèja od izhodnih kod pri klicu ukaza.

source: A special builtin command called '0' outputs the translation, followed by a null byte. The output of "msgexec 0" is suitable as input for "xargs -0".
sl: Poseben vgrajen ukaz ,0` izpi¹e prevod in izpis zakljuèi z znakom s kodo niè. Izhod ukaza "msgexec 0" je primeren kot vhod za ukaz "xargs -0".

source: -i, --input=INPUTFILE input PO file
sl: -i, --input=DATOTEKA vhodna datoteka PO

source: write to stdout failed
sl: izpis na standardni izhod neuspe¹en

source: write to %s subprocess failed
sl: posredovanje podatkov podprocesu %s neuspe¹no

source: missing filter name
sl: manjka ime filtra

source: at least one sed script must be specified
sl: podan mora biti vsaj en skript v sed

source: Usage: %s [OPTION] FILTER [FILTER-OPTION]
sl: Uporaba: %s [IZBIRA] FILTER [IZBIRA-FILTRA]

source: Applies a filter to all translations of a translation catalog.
sl: Na vsakem prevodu iz kataloga uporabimo dani filter.

source: The FILTER can be any program that reads a translation from standard input and writes a modified translation to standard output.
sl: FILTER je lahko ime kateregakoli programa, ki prebere prevod s standardnega vhoda in izpi¹e spremnjen prevod na standardni izhod.

source: Useful FILTER-OPTIONs when the FILTER is 'sed':
sl: Uporabne IZBIRE FILTRA, kadar je FILTER ,sed`:

source: -e, --expression=SCRIPT add SCRIPT to the commands to be executed
sl: -e, --expression=SKRIPT dodaj SKRIPT med ukaze, ki se izvedejo

source: -f, --file=SCRIPTFILE add the contents of SCRIPTFILE to the commands to be executed
sl: -f, --file=SKRIPTNA_DATOTEKA dodaj vsebino SKRIPTNE DATOTEKE med ukaze, ki se izvedejo

source: -n, --quiet, --silent suppress automatic printing of pattern space
sl: -n, --quiet, --silent brez samodejnega izpisa prostora vzorcev

source: --no-escape do not use C escapes in output (default)
sl: --no-escape brez ube¾nih sekvenc v skladnji jezika C (privzeto)

source: --indent indented output style
sl: --indent izpis datoteke PO z zamiki

source: --keep-header keep header entry unmodified, don't filter it
sl: --keep-header ohrani glavo nespremenjeno, ne filtriraj je

source: Not yet implemented.
sl: Funkcija ¹e ni izvedena.

source: cannot set up nonblocking I/O to %s subprocess
sl: s podprocesom %s ni mogoèe vzpostaviti nebloène V/I povezave

source: communication with %s subprocess failed
sl: povezava s podprocesom %s neuspe¹na

source: read from %s subprocess failed
sl: branje izhoda podprocesa %s neuspe¹no

source: %s subprocess terminated with exit code %d
sl: podproces %s zakljuèil z izhodno kodo %d

source: the argument to %s should be a single punctuation character
sl: argument %s mora biti eno samo loèilo

source: %s requires a "-d directory" specification
sl: %s zahteva doloèitev "-d directory"

source: %s requires a "-l locale" specification
sl: %s zahteva doloèitev "-l locale"

source: %s is only valid with %s
sl: %s je veljavno edino z %s

source: %s is only valid with %s or %s
sl: %s je veljavno edino z %s ali %s

source: %d translated message
sl: %d prevedenih sporoèil

source: , %d fuzzy translation
sl: , %d ohlapnih prevodov

source: , %d untranslated message
sl: , %d neprevedenih sporoèil

source: Usage: %s [OPTION] filename.po ...
sl: Uporaba: %s [IZBIRA] datoteka.po ...

source: Generate binary message catalog from textual translation description.
sl: Besedilni opis prevodov pretvorimo v binarni katalog sporoèil.

source: Mandatory arguments to long options are mandatory for short options too. Similarly for optional arguments.
sl: Èe je pri dolgi obliki izbire naveden obvezen argument, je ta obvezen tudi za kratko obliko. Enako za neobvezne argumente.

source: Operation mode:
sl: Naèin delovanja:

source: -j, --java Java mode: generate a Java ResourceBundle class
sl: -j, --java javanski naèin: ustvarimo javanski razred ResourceBundle

source: --java2 like --java, and assume Java2 (JDK 1.2 or higher)
sl: --java2 kot --java, privzeta je java2 (JDK 1.2 ali veè)

source: --tcl Tcl mode: generate a tcl/msgcat .msg file
sl: --tcl naèin tcl: ustvarimo datoteko tcl/msgcat .msg

source: --strict enable strict Uniforum mode
sl: --strict izpis v strogi obliki Uniforum brez raz¹iritev GNU

source: If output file is -, output is written to standard output.
sl: Èe je izhodna datoteka enaka -, se rezultat izpi¹e na standardni izhod.

source: Output file location in Java mode:
sl: Izbira izhodne datoteke v javanskem naèinu:

source: -r, --resource=RESOURCE resource name
sl: -r, --resource=SREDSTVO ime sredstva

source: -l, --locale=LOCALE locale name, either language or language_COUNTRY
sl: -l, --locale=JJ_DD jezikovno okolje (jezik ali jezik_dr¾ava)

source: -d DIRECTORY base directory of classes directory hierarchy
sl: -d IMENIK korenski imenik hierarhije razredov

source: The class name is determined by appending the locale name to the resource name, separated with an underscore. The -d option is mandatory. The class is written under the specified directory.
sl: Ime razreda je sestavljeno iz imena sredstva, ki se mu, loèeno s podèrtajem, pridá ime jezikovnega okolja. Izbira -d je obvezna. Razred se zapi¹e v podani imenik.

source: Output file location in Tcl mode:
sl: Izbira izhodne datoteke v naèinu tcl:

source: -d DIRECTORY base directory of .msg message catalogs
sl: -d IMENIK korenski imenik hierarhije razredov
