Repository: apple-open-source/macos
Catalog: ChatServer/libraries/gettext-0.13/gettext-tools/po/*.po
Languages: sl

source: cannot find a temporary directory, try setting $TMPDIR
sl: zaèasnega imenika ni mogoèe najti, poskusite nastaviti $TMPDIR

source: cannot create a temporary directory using template "%s"
sl: ni mogoèe ustvariti zaèasnega imenika z vzorcem "%s"

source: not a valid Java class name: %s
sl: ni veljavno javansko ime razreda: %s

source: failed to create "%s"
sl: ustvarjanje "%s" neuspe¹no

source: error while writing "%s" file
sl: napaka pri pisanju na datoteko "%s"

source: compilation of Java class failed, please try --verbose or set $JAVAC
sl: prevajanje javanskega razreda neuspe¹no, uporabite --verbose ali nastavite $JAVAC

source: error while opening "%s" for writing
sl: napaka pri pisanju na "%s"

source: internationalized messages should not contain the `\%c' escape sequence
sl: internacionalizirana sporoèila ne smejo vsebovati ube¾ne sekvence ,\%c'

source: The following msgid contains non-ASCII characters. This will cause problems to translators who use a character encoding different from yours. Consider using a pure ASCII msgid instead. %s
sl: Naslednje izvorno sporoèilo (msgid) vsebuje znake, ki niso del nabora ASCII. To bo povzroèilo te¾ave prevajalcem, ki uporabljajo drugaèen nabor znakov kot vi. Razmislite o uporabi sporoèil v naboru znakov ASCII. %s

source: cannot create output file "%s"
sl: izhodne datoteke "%s" ni mogoèe ustvariti

source: standard output
sl: standardni izhod

source: message catalog has plural form translations but the Tcl message catalog format doesn't support plural handling
sl: katalog sporoèil vsebuje mno¾inske oblike, vendar katalog sporoèil TCL ne podpira mno¾inskih oblik

source: %s:%d: warning: unterminated string
sl: %s:%d: opozorilo: nezakljuèen niz

source: %s:%d: warning: unterminated regular expression
sl: %s:%d: opozorilo: nezakljuèen regularni izraz

source: %s:%d: warning: unterminated character constant
sl: %s:%d: opozorilo: nezakljuèena znakovna konstanta

source: %s:%d: warning: unterminated string literal
sl: %s:%d: opozorilo: nezakljuèen niz

source: Language "glade" is not supported. %s relies on expat. This version was built without expat.
sl: Programski jezik "glade" ni podprt. %s se naslanja na expat(). Ta izdaja je bila prevedena brez expat().

source: %s:%d: warning: invalid Unicode character
sl: %s:%d: opozorilo: neveljavni unikodni znak

source: %s:%d: invalid string definition
sl: %s:%d: neveljavna definicija niza

source: %s:%d: missing number after #
sl: %s:%d: za # manjka ¹tevilka

source: %s:%d: invalid string expression
sl: %s:%d: niz ni veljaven izraz

source: --join-existing cannot be used when output is written to stdout
sl: pri izpisu na standardni izhod ne moremo uporabiti --join-existing

source: xgettext cannot work without keywords to look for
sl: xgettext ne deluje brez kljuènih besed, ki naj jih i¹èe

source: warning: file `%s' extension `%s' is unknown; will try C
sl: opozorilo: vrsta datoteka ,%s' s pripono ,%s' ni prepoznana; posku¹amo C

source: Extract translatable strings from given input files.
sl: Iz vhodnih datotek izvleèemo prevedljive nize znakov.

source: -d, --default-domain=NAME use NAME.po for output (instead of messages.po)
sl: -d, --default-domain=DOMENA namesto messages.po je privzeta DOMENA.po

source: -o, --output=FILE write output to specified file
sl: -o, --output-file=DATOTEKA izhod zapisujemo v navedeno DATOTEKO

source: -p, --output-dir=DIR output files will be placed in directory DIR
sl: -p, --output-dir=IMENIK izhodne datoteke pi¹emo v navedeni IMENIK

source: Choice of input file language:
sl: Izbira vhodnega jezika:

source: -C, --c++ shorthand for --language=C++
sl: -C, --c++ okraj¹ava za --language=C++

source: By default the language is guessed depending on the input file name extension.
sl: Privzeto se jezik poskusi uganiti iz pripone vhodne datoteke.

source: --from-code=NAME encoding of input files (except for Python, Tcl, Glade)
sl: --from-code=NABOR nabor znakov vhodnih datotek (razen za Python, Tcl in Glade)

source: By default the input files are assumed to be in ASCII.
sl: Privzeti nabor znakov vhodnih datotek je ASCII.

source: -j, --join-existing join messages with existing file
sl: -j, --join-existing zdru¾i sporoèila z obstojeèo datoteko

source: -x, --exclude-file=FILE.po entries from FILE.po are not extracted
sl: -x, --exclude-file=DATOTEKA.po vnosov iz navedene DATOTEKE ne izvleèemo

source: -c, --add-comments[=TAG] place comment block with TAG (or those preceding keyword lines) in output file
sl: -c, --add-comments[=ZNAÈKA] v vhodno datoteko dodamo komentar z navedeno ZNAÈKO

source: -a, --extract-all extract all strings
sl: -a, --extract-all iz datotek potegnemo vse nize

source: -k, --keyword[=WORD] additional keyword to be looked for (without WORD means not to use default keywords)
sl: -k, --keyword[=BESEDA] iskanje po dodatnih kljuèih besedah (prazen niz BESEDA pomeni brez uporabe privzetih kljuènih besed)

source: -T, --trigraphs understand ANSI C trigraphs for input
sl: -T, --trigraphs razumi trigrafe ANSI C na vhodu

source: --debug more detailed formatstring recognition result
sl: --debug bolj razèlenjen rezultat razpoznave oblikovnega niza

source: --copyright-holder=STRING set copyright holder in output
sl: --copyright-holder=NIZ v izhodu nastavimo nosilca avtorskih pravic na NIZ

source: --foreign-user omit FSF copyright in output for foreign user
sl: --foreign-user brez copyrighta FSF v izpisu za tuje uporabnike

source: --msgid-bugs-address=EMAIL@ADDRESS set report address for msgid bugs
sl: --msgid-bugs-address=EPO©TA@NASLOV naslov za sporoèila o napakah msgid

source: -m, --msgstr-prefix[=STRING] use STRING or "" as prefix for msgstr entries
sl: -m, --msgstr-prefix[=NIZ] NIZ ali "" kot predpona za msgstr

source: -M, --msgstr-suffix[=STRING] use STRING or "" as suffix for msgstr entries
sl: -M, --msgstr-suffix[=NIZ] NIZ ali "" kot pripona za msgstr

source: standard input
sl: standardni vhod

source: %s%s: warning:
sl: %s%s: opozorilo:

source: Empty msgid. It is reserved by GNU gettext: gettext("") returns the header entry with meta information, not the empty string.
sl: Prazen msgid. Ta vnos je rezerviran za GNU gettext: gettext("") vrne glavo z metapodatki, ne pa praznega niza.

source: The option --msgid-bugs-address was not specified. If you are using a `Makevars' file, please specify the MSGID_BUGS_ADDRESS variable there; otherwise please specify an --msgid-bugs-address command line option.
sl: Izbira --msgid-bugs-address ni doloèena. Èe uporabljate datoteko ,Makevars`, doloèite spremenljivko MSGID_BUGS_ADDRESS tam, sicer pa z izbiro --msgid-bugs-address v ukazni vrstici.

source: language `%s' unknown
sl: jezik ,%s` ni poznan
