Repository: apple-open-source/macos
Catalog: ChatServer/libraries/gettext-0.13/gettext-tools/po/*.po
Languages: sl

source: The -l and -d options are mandatory. The .msg file is written in the specified directory.
sl: Izbiri -l in -d sta obvezni. Datoteka .msg se zapi¹e v podani imenik.

source: Input file interpretation:
sl: Interpretacija vhodne datoteke:

source: -c, --check perform all the checks implied by --check-format, --check-header, --check-domain
sl: -c, --check opravimo vse preizkuse, doloèene z izbiramo --check-format, --check-header, --check-domain

source: --check-format check language dependent format strings
sl: --check-format preverimo od jezika odvisne formatne nize

source: --check-header verify presence and contents of the header entry
sl: --check-header preverimo obstoj in vsebino glave

source: --check-domain check for conflicts between domain directives and the --output-file option
sl: --check-domain preverimo morebitna nesoglasja med direktivo domene in izbiro --output-file

source: -C, --check-compatibility check that GNU msgfmt behaves like X/Open msgfmt
sl: -C, --check-compatibility preverimo zdru¾ljivost GNU gettext z X/Open msgfmt

source: --check-accelerators[=CHAR] check presence of keyboard accelerators for menu items
sl: --check-accelerators[=ZNAK] preverimo, ali obstajajo bli¾njice za menujske izbire

source: -f, --use-fuzzy use fuzzy entries in output
sl: -f, --use-fuzzy uporabimo ohlapne samodejno prevedene prevode

source: -a, --alignment=NUMBER align strings to NUMBER bytes (default: %d)
sl: -a, --alignment=©TEVILO poravnava nizov na dano ©TEVILO bajtov (privzeto %d)

source: --no-hash binary file will not include the hash table
sl: --no-hash binarni katalog sporoèil bo brez razpr¹ene tabele

source: --statistics print statistics about translations
sl: --statistics s statistiko glede prevodov

source: -v, --verbose increase verbosity level
sl: -v, --verbose z dodatnimi sporoèili med izvajanjem

source: plural expression can produce negative values
sl: rezultat izraza za izbiro mno¾inske oblike je lahko negativna vrednost

source: nplurals = %lu but plural expression can produce values as large as %lu
sl: nplurals = %lu, izraz za izbiro mno¾inske oblike pa lahko da vrednosti do %lu

source: plural expression can produce division by zero
sl: izraz za izbiro mno¾inske oblike lahko povzroèi deljenje z niè

source: plural expression can produce integer overflow
sl: izraz za izbiro mno¾inske oblike lahko povzroèi prekoraèitev obsega

source: plural expression can produce arithmetic exceptions, possibly division by zero
sl: izraz za izbiro mno¾inske oblike lahko povzroèi aritmetiène napake, morda deljenje z niè

source: message catalog has plural form translations...
sl: katalog sporoèil vsebuje mno¾inske oblike prevodov...

source: ...but header entry lacks a "plural=EXPRESSION" attribute
sl: ...v glavi pa manjka doloèilo "plural=IZRAZ"

source: ...but header entry lacks a "nplurals=INTEGER" attribute
sl: ...v glavi pa manjka doloèilo "nplurals=©TEVILO"

source: invalid nplurals value
sl: neveljavna vrednost nplurals

source: invalid plural expression
sl: neveljaven izraz za mno¾inske oblike

source: ...but some messages have only one plural form
sl: ...nekatera sporoèila pa imajo samo %lu mno¾inskih oblik

source: ...but some messages have one plural form
sl: ...nekatera sporoèila pa imajo %lu mno¾inskih oblik

source: Try using the following, valid for %s:
sl: Poskusite uporabiti naslednje, veljavno za %s:

source: message catalog has plural form translations, but lacks a header entry with "Plural-Forms: nplurals=INTEGER; plural=EXPRESSION;"
sl: katalog sporoèil vsebuje mno¾inske oblike, manjka pa glava z doloèili "Plural-Forms: nplurals=©TEVILO; plural=IZRAZ;"

source: `msgid' and `msgid_plural' entries do not both begin with '\n'
sl: polji ,msgid` in ,msgid_plural` se ne zaèneta obe z ,\n`

source: `msgid' and `msgstr[%u]' entries do not both begin with '\n'
sl: polji ,msgid` in ,msgstr[%u]` se ne zaèneta obe z ,\n`

source: `msgid' and `msgstr' entries do not both begin with '\n'
sl: polji ,msgid` in ,msgstr` se ne zaèneta obe z ,\n`

source: `msgid' and `msgid_plural' entries do not both end with '\n'
sl: polji ,msgid` in ,msgid_plural` se ne konèata obe z ,\n`

source: `msgid' and `msgstr[%u]' entries do not both end with '\n'
sl: polji ,msgid` in ,msgstr[%u]` se ne konèata obe z ,\n`

source: `msgid' and `msgstr' entries do not both end with '\n'
sl: polji ,msgid' in ,msgstr` se ne konèata obe z ,\n`

source: plural handling is a GNU gettext extension
sl: rokovanje z mno¾inskimi oblikami je raz¹iritev GNU gettext

source: '%s' is not a valid %s format string, unlike 'msgid'. Reason: %s
sl: ,%s` za razliko od ,msgid` ni veljaven formatni niz %s. Razlog: %s

source: msgstr lacks the keyboard accelerator mark '%c'
sl: v msgstr manjka oznaka bli¾njice ,%c`

source: msgstr has too many keyboard accelerator marks '%c'
sl: v msgstr je preveè oznak bli¾njic ,%c`

source: headerfield `%s' missing in header
sl: v glavi manjka polje ,%s`

source: header field `%s' should start at beginning of line
sl: polje ,%s` v glavi se mora zaèeti na zaèetku vrstice

source: some header fields still have the initial default value
sl: nekatera polja v glavi imajo ¹e vedno zaèetne privzete vrednosti

source: field `%s' still has initial default value
sl: polje ,%s' ima ¹e vedno zaèetno privzeto vrednost

source: warning: PO file header missing or invalid
sl: opozorilo: glava datoteke PO ni veljavna ali pa manjka

source: warning: charset conversion will not work
sl: opozorilo: pretvorba v navedeni nabor znakov ne bo delovala

source: warning: PO file header fuzzy
sl: opozorilo: glava datoteke PO ni razberljiva

source: warning: older versions of msgfmt will give an error on this
sl: opozorilo: starej¹e izdaje msgfmt bodo pri tem javile napako

source: domain name "%s" not suitable as file name
sl: ime domene "%s" ni primerno kot ime datoteke

source: domain name "%s" not suitable as file name: will use prefix
sl: ime domene "%s" ni primerno kot ime datoteke: uporabimo predpono

source: `domain %s' directive ignored
sl: direktiva ,domain %s` ni bila upo¹tevana

source: empty `msgstr' entry ignored
sl: prazno polje ,msgstr` zavr¾eno

source: fuzzy `msgstr' entry ignored
sl: ohlapni vnos za polje ,msgstr` zavr¾en

source: %s: warning: source file contains fuzzy translation
sl: %s: opozorilo: vhodna datoteka vsebuje ohlapne (fuzzy) prevode

source: option '%c' cannot be used before 'K' or 'T' or 'C' has been specified
sl: izbire ,%c` ni moè uporabiti, preden je izbran ,K`, ,T` ali ,C`

source: Extracts all messages of a translation catalog that match a given pattern or belong to some given source files.
sl: Izvleèemo vsa sporoèila iz kataloga prevodov, ki ustrezajo danemu vzorcu ali pripadajo dani izvorni datoteki.

source: --escape use C escapes in output, no extended chars
sl: --escape z ube¾nimi sekvencami v skladnji C, brez raz¹irjenega nabora znakov

source: --sort-output generate sorted output
sl: --sort-output izhod abecedno urejen po sporoèilih

source: --sort-by-file sort output by file location
sl: --sort-by-file izhod abecedno urejen po izvornih datotekah

source: write to grep subprocess failed
sl: pisanje podprocesu grep neuspe¹no

source: You are in a language indifferent environment. Please set your LANG environment variable, as described in the ABOUT-NLS file. This is necessary so you can test your translations.
sl: Nimate nastavljenega jezikovnega okolja. Prosim, nastavite spremenljivko LANG, kot je opisano v datoteki ABOUT-NLS. Brez tega ne morete preizkusiti va¹ih prevodov.

source: Output file %s already exists. Please specify the locale through the --locale option or the output .po file through the --output-file option.
sl: Izhodna datoteka %s ¾e obstaja. Prosim, izberite jezikovno okolje z izbiro --locale, ali pa doloèite izhodno datoteko PO z izbiro --output-file.

source: Created %s.
sl: Ustvarjena datoteka %s.

source: Creates a new PO file, initializing the meta information with values from the user's environment.
sl: Ustvarimo novo datoteko PO in metainformacije dopolnimo z vrednostmi iz uporabnikovega jezikovnega okolja.

source: -i, --input=INPUTFILE input POT file
sl: -i, --input=DATOTEKA vhodna datoteka POT

source: If no input file is given, the current directory is searched for the POT file. If it is -, standard input is read.
sl: Èe vhodna datoteka ni podana, poskusimo najti datoteko POT v trenutnem imeniku. Èe je enaka -, se bere standardni vhod.

source: -o, --output-file=FILE write output to specified PO file
sl: -o, --output-file=DATOTEKA izhod zapisujemo v navedeno DATOTEKO

source: If no output file is given, it depends on the --locale option or the user's locale setting. If it is -, the results are written to standard output.
sl: Èe izhodna datoteka ni podana, se uporabi vrednost izbire --locale ali pa nastavitev uporabnikovega jezikovnega okolja. Èe je kot izhodna datoteka podan -, se rezultat izpi¹e na standardni izhod.

source: -l, --locale=LL_CC set target locale
sl: -l, --locale=JJ_DD doloèitev ciljnega jezikovnega okolja

source: --no-translator assume the PO file is automatically generated
sl: --no-translator privzamemo, da je datoteka PO samodejno ustvarjena

source: Found more than one .pot file. Please specify the input .pot file through the --input option.
sl: Na¹li smo veè kot eno datoteko .pot. Prosim, doloèite vhodno datoteko .pot z izbiro --input.

source: error reading current directory
sl: napaka pri branju trenutnega imenika

source: Found no .pot file in the current directory. Please specify the input .pot file through the --input option.
sl: V trenutnem imeniku ni najti nobene datoteke .pot. Prosim, doloèite vhodno datoteko .pot z izbiro --input.

source: fdopen() failed
sl: klic fdopen() neuspe¹en

source: %s subprocess I/O error
sl: V/I napaka v podprocesu %s

source: %s subprocess failed with exit code %d
sl: podproces %s neuspe¹en z izhodno kodo %d

source: The new message catalog should contain your email address, so that users can give you feedback about the translations, and so that maintainers can contact you in case of unexpected technical problems.
sl: Novi katalog sporoèil naj vsebuje va¹ epo¹tni naslov, tako da se lahko uporabniki obrnejo na vas s povratnimi informacijami glede prevodov, vzdr¾evalci paketov pa v zvezi z morebitnimi tehniènimi te¾avami.

source: English translations for %s package
sl: Slovenski prevodi paketa %s

source: present charset "%s" is not a portable encoding name
sl: trenutno izbrani nabor "%s" ni prenosljivo ime kodnega nabora

source: two different charsets "%s" and "%s" in input file
sl: v vhodni datoteki sta dva razlièna nabora znakov, "%s" in "%s"

source: input file `%s' doesn't contain a header entry with a charset specification
sl: vhodna datoteka ,%s` ne vsebuje glave z doloèitvijo nabora znakov

source: domain "%s" in input file `%s' doesn't contain a header entry with a charset specification
sl: domena "%s" v vhodni datoteki ,%s` ne vsebuje glave z doloèitvijo nabora znakov<

source: target charset "%s" is not a portable encoding name.
sl: ciljni nabor "%s" ni prenosljivo ime kodnega nabora.

source: warning:
sl: opozorilo:

source: Input files contain messages in different encodings, UTF-8 among others. Converting the output to UTF-8.
sl: Vhodne datoteke vsebujejo sporoèila v razliènih kodnih naborih, med drugim UTF8. Izhod je pretvorjen v UTF8.

source: Input files contain messages in different encodings, %s and %s among others. Converting the output to UTF-8. To select a different output encoding, use the --to-code option.
sl: Vhodne datoteke vsebujejo sporoèila v razliènih kodnih naborih, med %s in %s. Izhod je pretvorjen v UTF8. Drugaèen kodni nabor lahko doloèite z izbiro --to-code.

source: Locale charset "%s" is different from input file charset "%s". Output of '%s' might be incorrect. Possible workarounds are:
sl: Kodni nabor jezikovnega okolja "%s" se razlikuje od kodnega nabora "%s" vhodne datoteke. Izhod ,%s` bo morda napaèen. Predlagane re¹itve za to te¾avo so:

source: - Set LC_ALL to a locale with encoding %s.
sl: - Nastavite LC_ALL na jezikovno okolje s kodnim naborom %s.

source: - Convert the translation catalog to %s using 'msgconv', then apply '%s', then convert back to %s using 'msgconv'.
sl: - Katalog prevodov z ukazom ,msgconv` pretvorite v %s, zatem uporabite ,%s`, in ga konèno z ukazom ,msgconv` pretvorite nazaj v %s.

source: - Set LC_ALL to a locale with encoding %s, convert the translation catalog to %s using 'msgconv', then apply '%s', then convert back to %s using 'msgconv'.
sl: - Nastavite LC_ALL na jezikovno okolje s kodnim naborom %s, katalog prevodov z ukazom ,msgconv` pretvorite v %s, zatem uporabite ,%s`, in ga konèno z ukazom ,msgconv` pretvorite nazaj v %s.

source: Locale charset "%s" is not a portable encoding name. Output of '%s' might be incorrect. A possible workaround is to set LC_ALL=C.
sl: Nabor jezikovnega okolja "%s" ni prenosljivo ime kodnega nabora. Izhod ,%s` bo morda napaèen. Mogoèa re¹itev za to te¾avo je, da nastavite LC_ALL=C.

source: conversion failure
sl: pretvorba neuspe¹na

source: input file doesn't contain a header entry with a charset specification
sl: v vhodni datoteki manjka glava z doloèilom kodnega nabora

source: Cannot convert from "%s" to "%s". %s relies on iconv(), and iconv() does not support this conversion.
sl: Pretvorba iz "%s" v "%s" ni mogoèa. %s klièe iconv(), ta pa ne podpira te pretvorbe.

source: Cannot convert from "%s" to "%s". %s relies on iconv(). This version was built without iconv().
sl: Pretvorba iz "%s" v "%s" ni mogoèa. %s klièe iconv(), vendar ta izvod programa ni preveden za uporabo iconv().

source: backup type
sl: vrsta varnostne kopije

source: Merges two Uniforum style .po files together. The def.po file is an existing PO file with translations which will be taken over to the newly created file as long as they still match; comments will be preserved, but extracted comments and file positions will be discarded. The ref.pot file is the last created PO file with up-to-date source references but old translations, or a PO Template file (generally created by xgettext); any translations or comments in the file will be discarded, however dot comments and file positions will be preserved. Where an exact match cannot be found, fuzzy matching is used to produce better results.
sl: Zdru¾i dve datoteki .po v obliki Uniforum. Datoteka def.po je obstojeèa datoteka s starimi prevodi, ki bodo, kadar se ujemajo, preneseni v novo datoteko. Pri prevedbi se komentarji prevajalca ohranijo, strojno ustvarjeni komentarji in podatki o ¹tevilki vrstice pa ne. Datoteka ref.po je bodisi nazadnje ustvarjena datoteka PO z najnovej¹imi sklici na vire, a starimi prevodi, bodisi vzorèna datoteka PO (navadno ustvarjena z xgettext). Kakr¹nikoli prevodi ali komentarji prevajalca v njej bodo zavr¾eni, ohranjeni pa bodo strojno ustvarjeni komentarji in podatki o ¹tevilki vrstice. Kjer natanènega prevoda ni, se uporabi ohlapni (fuzzy) algoritem.

source: def.po translations referring to old sources
sl: def.po prevodi

source: ref.pot references to new sources
sl: ref.pot sklici na vire

source: -C, --compendium=FILE additional library of message translations, may be specified more than once
sl: -C, --compendium=DATOTEKA dodatna knji¾nica s prevodi sporoèil; navedemo lahko veè kot eno

source: Output file location in update mode:
sl: Mesto izhodne datoteke v posodobitvenem naèinu:

source: The result is written back to def.po.
sl: Rezultat se zapi¹e nazaj v datoteko def.po.

source: --backup=CONTROL make a backup of def.po
sl: --backup=TIP izdelamo varnostno kopijo datoteke def.po

source: --suffix=SUFFIX override the usual backup suffix
sl: -S, --suffix=PRIPONA pripona varnostne kopije naj bo PRIPONA

source: The version control method may be selected via the --backup option or through the VERSION_CONTROL environment variable. Here are the values: none, off never make backups (even if --backup is given) numbered, t make numbered backups existing, nil numbered if numbered backups exist, simple otherwise simple, never always make simple backups
sl: Vrsto varnostnih kopij lahko nastavimo z izbiro --backup ali spremenljivko VERSION_CONTROL. Mo¾nosti so: none, off nikoli ne delamo varnostne kopije, niti z izbiro --backup numbered, t o¹tevilèene varnostne kopije existing, nil o¹tevilèene varnostne kopije, èe take ¾e obstajajo, sicer enostavne simple, never vedno enostavne varnostne kopije

source: The backup suffix is `~', unless set with --suffix or the SIMPLE_BACKUP_SUFFIX environment variable.
sl: Varnostna kopija ima pripono ,~`, razen èe ni z izbiro --suffix ali spremenljivko SIMPLE_BACKUP_SUFFIX nastavljeno drugaèe.

source: -N, --no-fuzzy-matching do not use fuzzy matching
sl: -N, --no-fuzzy-matching ne uporabljamo ohlapnega ujemanja

source: -q, --quiet, --silent suppress progress indicators
sl: -q, --quiet, --silent brez kazalnika poteka

source: this message should define plural forms
sl: pri tem sporoèilu bi morale biti doloèene mno¾inske oblike

source: this message should not define plural forms
sl: pri tem sporoèilu ne bi smele biti doloèene mno¾inske oblike

source: %sRead %ld old + %ld reference, merged %ld, fuzzied %ld, missing %ld, obsolete %ld.
sl: %sPrebrano %ld starih + %ld referenènih, zdru¾enih %ld, ohlapnih %ld, manjkajoèih %ld, opu¹èenih %ld.

source: done.
sl: opravljeno.

source: %s and explicit file names are mutually exclusive
sl: %s in izrecna imena datotek se med seboj izkljuèujejo

source: Usage: %s [OPTION] [FILE]...
sl: Uporaba: %s [IZBIRA] [DATOTEKA]...

source: Convert binary message catalog to Uniforum style .po file.
sl: Pretvorba kataloga sporoèil iz binarne oblike .mo v obliko Uniforum .po.

source: -j, --java Java mode: input is a Java ResourceBundle class
sl: -j, --java javanski naèin: ustvarimo javanski razred ResourceBundle

source: --tcl Tcl mode: input is a tcl/msgcat .msg file
sl: --tcl naèin tcl: vhod je datoteka tcl/msgcat .msg

source: FILE ... input .mo files
sl: DATOTEKA ... datoteka MO (ali veè datotek MO)

source: Input file location in Java mode:
sl: Izbira izhodne datoteke v javanskem naèinu:

source: The class name is determined by appending the locale name to the resource name, separated with an underscore. The class is located using the CLASSPATH.
sl: Ime razreda je sestavljeno iz imena sredstva, ki se mu, loèeno s podèrtajem, pridá ime jezikovnega okolja. Razred je doloèen s spremenljivko CLASSPATH.

source: Input file location in Tcl mode:
sl: Izbira izhodne datoteke v naèinu tcl:

source: The -l and -d options are mandatory. The .msg file is located in the specified directory.
sl: Izbiri -l in -d sta obvezni. Datoteka .msg se zapi¹e v podani imenik.

source: -i, --indent write indented output style
sl: -i, --indent izpis datoteke PO z zamiki

source: --strict write strict uniforum style
sl: --strict izpis v strogi obliki Uniforum, brez raz¹iritev

source: Unifies duplicate translations in a translation catalog. Finds duplicate translations of the same message ID. Such duplicates are invalid input for other programs like msgfmt, msgmerge or msgcat. By default, duplicates are merged together. When using the --repeated option, only duplicates are output, and all other messages are discarded. Comments and extracted comments will be cumulated, except that if --use-first is specified, they will be taken from the first translation. File positions will be cumulated. When using the --unique option, duplicates are discarded.
sl: Poenotenje podvojenih prevodov v katalogu sporoèil. Poi¹èemo podvojene prevode istega izvornega sporoèila. Taki podvojeni vnosi niso veljavni vhodni podatki za programe, kot so msgfmt, msgmerge ali msgcat. Privzeto so podvojeni prevodi zdru¾eni. Z izbiro --repeated izpi¹emo le podvojene prevode, drugih pa ne. Ohranijo se vsi komentarji prevajalcev ter komentarji ob izvlaèenju, razen èe z izbiro --use-first ne zahtevamo, da se ohranijo le komentarji prvega prevoda. Ohranijo se vsi podatki o mestu sporoèila v izvorni datoteki. Z izbiro --unique se podvojena sporoèila zavr¾ejo.

source: -d, --repeated print only duplicates
sl: -d, --repeated izpi¹emo le podvojena sporoèila

source: -u, --unique print only unique messages, discard duplicates
sl: -u, --unique vsako sporoèilo izpi¹emo le enkrat, dvojnike zavr¾emo

source: <stdin>
sl: <st. vhod>

source: %s: warning:
sl: %s: opozorilo:

source: Charset "%s" is not a portable encoding name. Message conversion to user's charset might not work.
sl: Nabor "%s" ni prenosljivo ime kodnega nabora. Pretvorba sporoèil v uporabnikov kodni nabor morda ne bo delovala.

source: Continuing anyway, expect parse errors.
sl: Te¾avam navzlic nadaljujemo, prièakujte napake pri razèlembi.

source: Continuing anyway.
sl: Te¾avam navzlic nadaljujemo.

source: Charset "%s" is not supported. %s relies on iconv(), and iconv() does not support "%s".
sl: Nabor "%s" ni podprt. %s se naslanja na iconv(), in iconv() ne podpira "%s".

source: Installing GNU libiconv and then reinstalling GNU gettext would fix this problem.
sl: Namestitev knji¾nice GNU libiconv in ponovno prevajanje paketa GNU Gettext bi moralo odpraviti to te¾avo.

source: Charset "%s" is not supported. %s relies on iconv(). This version was built without iconv().
sl: Nabor "%s" ni podprt. %s se naslanja na iconv(). Ta izdaja je bila prevedena brez iconv().

source: Charset missing in header. Message conversion to user's charset will not work.
sl: V glavi ni naveden nabor znakov. Pretvorba sporoèil v uporabnikov nabor znakov ne bo delovala.

source: inconsistent use of #~
sl: neskladna raba #~

source: missing `msgstr[]' section
sl: manjkajoè razdelek ,msgstr[]`

source: missing `msgid_plural' section
sl: manjkajoè razdelek ,msgid_plural`

source: missing `msgstr' section
sl: manjkajoè razdelek ,msgstr`

source: first plural form has nonzero index
sl: prva mno¾inska oblika ima indeks razlièen od niè

source: plural form has wrong index
sl: mno¾inska oblika ima napaèen indeks

source: too many errors, aborting
sl: preveè napak, nadaljevanje ni mo¾no

source: invalid multibyte sequence
sl: neveljavno veèzlo¾no zaporedje

source: incomplete multibyte sequence at end of file
sl: nepopolno veèzlo¾no zaporedje na koncu datoteke

source: incomplete multibyte sequence at end of line
sl: nepopolno veèzlo¾no zaporedje na koncu vrstice

source: iconv failure
sl: iconv neuspe¹en

source: error while reading "%s"
sl: napaka pri branju "%s"

source: keyword "%s" unknown
sl: kljuèna beseda "%s" neprepoznana

source: invalid control sequence
sl: neveljavno krmilno zaporedje

source: end-of-file within string
sl: znak za konec datoteke sredi niza

source: end-of-line within string
sl: znak za konec vrstice sredi niza

source: file "%s" is truncated
sl: datoteka "%s" je okrnjena

source: file "%s" contains a not NUL terminated string
sl: datoteka "%s" vsebuje niz, ki ni zakljuèen z NUL

source: file "%s" is not in GNU .mo format
sl: datoteka "%s" ni v obliki GNU .mo

source: file "%s" contains a not NUL terminated string, at %s
sl: datoteka "%s" vsebuje pri %s niz, ki ni zakljuèen z NUL

source: this file may not contain domain directives
sl: ta datoteka morda ne vsebuje direktiv domene

source: duplicate message definition
sl: podvojena definicija sporoèila

source: ...this is the location of the first definition
sl: ...to je kraj prve definicije

source: expected two arguments
sl: prièakujemo dva argumenta

source: Usage: %s [OPTION] URL FILE
sl: Uporaba: %s [IZBIRA] URL DATOTEKA

source: Fetches and outputs the contents of an URL. If the URL cannot be accessed, the locally accessible FILE is used instead.
sl: Prinese in izpi¹e vsebino podanega URL. Èe URL ni dosegljiv, se uporabni krajevno dostopna DATOTEKA.

source: error writing stdout
sl: napaka pri pisanju na standardni izhod
