Administrativa f&ouml;rfr&aring;gningar kan visas p&aring; tv&aring; s&auml;tt, antingen som en <a
href="%(summaryurl)s">&ouml;versikt</a>, eller med <em>alla detaljer</em>. P&aring; &ouml;versiktssidan visas b&aring;de v&auml;ntande anm&auml;lningar/avanm&auml;lningar och e-postbrev som v&auml;ntar p&aring; godk&auml;nnande f&ouml;r att distribueras via listan. Detaljsidan visar dessutom e-postbrevens meddelandehuvuden och ett utdrag av inneh&aring;llet.
<p>P&aring; b&aring;da sidorna kan du ange f&ouml;ljande &aring;tg&auml;rder:
<ul>
<li><b>V&auml;nta</b> -- V&auml;nta med avg&ouml;randet. Ingenting blir gjort med denna f&ouml;rfr&aring;gan nu, men e-postbrev som v&auml;ntar p&aring; godk&auml;nnande kan du h&aring;lla p&aring; eller skicka vidare (se nedan).
<li><b>Godk&auml;nna</b> -- Godk&auml;nna meddelandet som det &auml;r och distribuera det till listan. F&ouml;r f&ouml;rfr&aring;gningar om medlemskap, anm&auml;lningar, avanm&auml;lningar och andra &auml;ndringar.
<li><b>Avsl&aring;</b> -- Radera meddelandet och ge besked tillbaka till avs&auml;ndaren om att meddelandet inte blev godk&auml;nt. F&ouml;r f&ouml;rfr&aring;gningar om medlemskap, avslag p&aring; anm&auml;lan eller avanm&auml;lan. Du b&ouml;r alltid ocks&aring; ange en orsak i den tillh&ouml;rande textrutan.
<li><b>Kasta</b> -- Radera meddelandet utan att n&aring;got besked skickas till avs&auml;ndaren. Anv&auml;ndbart f&ouml;r skr&auml;ppost och reklampost (spam). F&ouml;r f&ouml;rfr&aring;gningar om medlemskap, avslag p&aring; anm&auml;lan eller avanm&auml;lan utan att den som f&ouml;rs&ouml;kte anm&auml;la sig eller avanm&auml;la sig p&aring; listan f&aring;r veta n&aring;got.  
</ul>

<p>Kryssa f&ouml;r <b>Beh&aring;ll meddelandet</b> om du &ouml;nskar att spara en kopia f&ouml;r systemets administrat&ouml;r.  Detta kan vara anv&auml;ndbart f&ouml;r meddelanden som &auml;r f&ouml;rknippade med missbruk av systemet och som du egentligen vill radera, men som det kan vara nyttigt att ta en titt p&aring; senare. 
<p>Kryssa f&ouml;r <b>Skicka meddelandet vidare</b> och uppge en e-postadress om du vill skicka meddelandet vidare till n&aring;gon annan. F&ouml;r att redigera ett e-postbrev som h&aring;lls tillbaka innan det skickas till listan, b&ouml;r du skicka det till dig sj&auml;lv (eller eventuellt till listans &auml;gare), och radera det ursprungliga e-postbrevet. D&auml;refter, n&auml;r e-postbrevet kommer till din in-box, redigerar du det och g&ouml;r de &auml;ndringar som du &ouml;nskar. Skicka d&auml;refter brevet till listan p&aring;
nytt med ett <tt>Approved:</tt> f&auml;lt i meddelandehuvudet efterf&ouml;ljt av listans l&ouml;senord. Kom ih&aring;g att det &auml;r vanlig netiquette i ett s&aring;dant fall att uppge att du har redigerat inneh&aring;llet.
<p>Om avs&auml;ndaren &auml;r medlem av listan, men &auml;r modererad, kan du ta bort moderationsflaggan om du s&aring; &ouml;nskar. Detta &auml;r anv&auml;ndbart n&auml;r du har satt upp listan p&aring; ett s&aring;dant s&auml;tt att  nya medlemmar har en pr&ouml;votid p&aring; listan, och du har best&auml;mt att den pr&ouml;votiden nu &auml;r &ouml;ver f&ouml;r denna medlem.
<p>Om avs&auml;ndaren inte &auml;r medlem av listan, kan du f&aring; e-postadressen inlagd i ett av <em>avs&auml;ndarfiltren</em>. Avs&auml;ndarfilter f&ouml;rklaras p&aring; sidan <a
href="%(filterurl)s">Filtrering av avs&auml;ndare</a> och kan vara inst&auml;llt p&aring; <b>auto-godk&auml;nna</b>, <b>auto-h&aring;llatillbaka</b>, <b>auto-avsl&aring;</b>, eller
<b>auto-kasta</b>. Detta val kommer inte att vara tillg&auml;ngligt om adressen redan &auml;r
inlagd i ett s&aring;dant filter.
<p>Efter det att du gjort dina val, klickar du p&aring; knappen <em>Utf&ouml;r</em> &ouml;verst eller nederst p&aring; sidan f&ouml;r att verkst&auml;lla dina beslut.
<p><a href="%(summaryurl)s">Tillbaka till &ouml;versiktssidan</a>.
