man/usr/man/man8/cd9660.util.8
.\""Copyright (c) 2001 Apple Computer, Inc. All Rights Reserved.
.\"The contents of this file constitute Original Code as defined in and are 
.\"subject to the Apple Public Source License Version 1.2 (the 'License'). 
.\"You may not use this file except in compliance with the
.\"License. Please obtain a copy of the License at 
.\"http://www.apple.com/publicsource and read it before using this file.
.\"
.\"This Original Code and all software distributed under the License are 
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER 
.\"EXPRESS OR IMPLIED, AND APPLE
.\"HEREBY DISCLAIMS ALL SUCH WARRANTIES, INCLUDING WITHOUT LIMITATION, ANY 
.\"WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,
.\"QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the License for the 
.\"specific language governing rights and limitations under the License."
.Dd March 24, 2001
.Dt CD9660.UTIL 8 
.Os Darwin
.Sh NAME
.Nm cd9660.util
.Nd helps mount, probe, and unmount cd9660 filesystems
.Sh SYNOPSIS
.Nm
.Op Fl mM Ar mountflag1 mountflag2 mountflag3 mountflag4
.Ar device mount_point
.Pp
.Nm
.Op Fl p Ar mountflag1 mountflag2 mountflag3 mountflag4
.Ar device
.Pp
.Nm
.Op Fl u 
.Ar device
.Sh DESCRIPTION
.Nm
helps to coordinate the mounting, probing, and unmounting of cd9660 filesystems.  It essentially wraps
.Xr mount 8
and it's ilk in one interface that is generic enough for the disk mounter to work with, so that the underlying mount commands do not have to fit into one mold.  This allows us to more easily port mount commands without forcing us to reorder or redo the command itself or the disk mounter to understand each specific mount command.
.Pp
Options:
.Bl -tag -width -indent
.It Fl a 
adopt permissions
.It Fl k 
get UUID key
.It Fl m Ar mountflag1 mountflag2 mountflag3 mountflag4
mount
.It Fl M Ar mountflag1 mountflag2 mountflag3 mountflag4
force mount
.It Fl n 
new UUID key
.It Fl p Ar mountflag1 mountflag2 mountflag3 mountflag4
probe for mounting
.It Fl u 
unmount
.El
.Pp
.Ar mountflags 
above are either:
.Bl -bullet -indent
.It
.Ar removable 
or
.Ar fixed
.It
.Ar readonly
or
.Ar writeable  
.It
.Ar suid
or
.Ar nosuid  
.It
.Ar dev
or
.Ar nodev
.El
.Sh SEE ALSO 
.Xr autodiskmount 8 , 
.Xr hfs.util 8 ,
.Xr msdos.util 8 ,
.Xr udf.util 8 ,
.Xr ufs.util 8
.Sh HISTORY
Defived from the Openstep Workspace Manager filesystem utility programs.
