Repository: apple-open-source/macos
Catalog: gnutar/tar/po/*.po
Languages: ko, sl

source: Unknown system error
ko: ¾Ë ¼ö ¾ø´Â ½Ã½ºÅÛ ¿À·ù
sl: Neznana sistemska napaka

source: Memory exhausted
ko: ¸Ş¸ğ¸®°¡ ¹Ù´Ú³²
sl: Zmanjkalo pomnilnika

source: Total bytes written:
ko: ÃÑ ¾²¿©Áø ¹ÙÀÌÆ®:
sl: Skupno zapisanih zlogov:

source: Cannot close file #%d
ko: ÆÄÀÏ #%d¸¦ ´İÀ» ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe zapreti datoteke #%d

source: Cannot close descriptor %d
ko: ±â¼úÀÚ %d¸¦ ´İÀ» ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe zapreti deskriptorja %d

source: Cannot properly duplicate %s
ko: %s¸¦ Á¦´ë·Î º¹»çÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe pravilno podvojiti %s

source: Cannot use compressed or remote archives
ko: ¾ĞÃàµÈ ¾ÆÄ«ÀÌºê³ª ¿ø°İ ¾ÆÄ«ÀÌºê¸¦ »ç¿ëÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe uporabiti stisnjenih ali ne-lokalnih arhivov

source: Cannot open pipe
ko: ÆÄÀÌÇÁ¸¦ ¿­ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odpreti cevi

source: Cannot fork
ko: forkÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Vejitev ni mo¾na

source: tar (child)
ko: tar (ÀÚ½Ä)
sl: tar (naslednik)

source: (child) Pipe to stdin
ko: (ÀÚ½Ä) Ç¥ÁØÀÔ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: (naslednik) cev na stdin

source: Cannot open archive %s
ko: %s ¾ÆÄ«ÀÌºê¸¦ ¿­ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odpreti arhiva %s

source: Archive to stdout
ko: Ç¥ÁØÃâ·Â¿¡ ´ëÇÑ ¾ÆÄ«ÀÌºê
sl: Arhiv na stdout

source: Cannot exec %s
ko: %s¸¦ ½ÇÇàÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe pognati %s

source: Child cannot fork
ko: ÀÚ½ÄÀº forkÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Vejitev naslednika ni mo¾na

source: ((child)) Pipe to stdout
ko: ((ÀÚ½Ä)) Ç¥ÁØÃâ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: ((naslednik)) cev na stdout

source: tar (grandchild)
ko: tar (¼ÕÀÚ)
sl: tar (pranaslednik)

source: (grandchild) Pipe to stdin
ko: (¼ÕÀÚ) Ç¥ÁØÀÔ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: (pranaslednik) cev na stdin

source: Cannot read from compression program
ko: ¾ĞÃà ÇÁ·Î±×·¥À¸·ÎºÎÅÍ ÀĞ¾îµéÀÏ ¼ö ¾ø½À´Ï´Ù
sl: Branje z izhoda programa za stiskanje ne gre

source: (child) Pipe to stdout
ko: (ÀÚ½Ä) Ç¥ÁØÃâ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: (naslednik) cev na stdout

source: Archive to stdin
ko: Ç¥ÁØÀÔ·Â¿¡ ´ëÇÑ ¾ÆÄ«ÀÌºê
sl: Arhiv na stdin

source: ((child)) Pipe to stdin
ko: ((ÀÚ½Ä)) Ç¥ÁØÀÔ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: ((naslednik)) cev na stdin

source: (grandchild) Pipe to stdout
ko: (¼ÕÀÚ) Ç¥ÁØÃâ·Â¿¡ ´ëÇÑ ÆÄÀÌÇÁ
sl: (pranaslednik) cev na stdout

source: Cannot write to compression program
ko: ¾ĞÃà ÇÁ·Î±×·¥¿¡ ¾µ ¼ö ¾ø½À´Ï´Ù
sl: Pisanje na vhod programa za stiskanje ne gre

source: Invalid value for record_size
ko: record_size·Î ºÎÀûÀıÇÑ °ª
sl: Neveljavna vrednost za dol¾ino zapisa (record_size)

source: No archive name given
ko: ¾ÆÄ«ÀÌºê ÀÌ¸§ÀÌ ÁÖ¾îÁöÁö ¾Ê¾Ò½À´Ï´Ù
sl: Ime arhiva ni podano

source: Could not allocate memory for blocking factor %d
ko: ºí·° °è¼ö %d¿¡ ´ëÀÀÇÏ´Â ¸Ş¸ğ¸®¸¦ ÇÒ´çÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe rezervirati pomnilnika za bloèni faktor %d

source: Cannot verify multi-volume archives
ko: ´ÙÁß-º¼·ı ¾ÆÄ«ÀÌºê¸¦ °ËÁõÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Arhivov v veè delih ni mo¾no preveriti

source: Cannot use multi-volume compressed archives
ko: ¾ĞÃàµÈ ´ÙÁß-º¼·ı ¾ÆÄ«ÀÌºê¸¦ »ç¿ëÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Stisnjeni arhivi v veè delih niso mo¾ni

source: Cannot verify compressed archives
ko: ¾ĞÃàµÈ ¾ÆÄ«ÀÌºê¸¦ °ËÁõÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Stisnjenega arhiva ni mogoèe preveriti

source: Cannot update compressed archives
ko: ¾ĞÃàµÈ ¾ÆÄ«ÀÌºê¸¦ °»½ÅÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Stisnjenega arhiva ni mogoèe a¾urirati

source: Cannot verify stdin/stdout archive
ko: Ç¥ÁØÀÔ/Ãâ·Â ¾ÆÄ«ÀÌºê¸¦ °ËÁõÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Arhivov na stdin/stdout ni mo¾no preveriti

source: Cannot open %s
ko: %s¸¦ ¿­ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odpreti %s

source: Archive not labelled to match `%s'
ko: `%s'¿Í ÀÏÄ¡ÇÏµµ·Ï ¶óº§ÀÌ ºÙÁö ¾ÊÀº ¾ÆÄ«ÀÌºê
sl: Oznaka arhiva ne ustreza ,%s`

source: Volume `%s' does not match `%s'
ko: º¼·ı `%s'°¡ `%s'¿Í ÀÏÄ¡ÇÏÁö ¾Ê½À´Ï´Ù
sl: Del ,%s` ne ustreza ,%s`

source: Write checkpoint %d
ko: °Ë»çÁöÁ¡ %d¸¦ ¾¸
sl: Pisanje oznake %d

source: Cannot write to %s
ko: %s¿¡ ¾µ ¼ö ¾ø½À´Ï´Ù
sl: Pisanje na %s ni mo¾no

source: Read error on %s
ko: %s¿¡¼­ ÀĞ±â ¿À·ù
sl: Napaka pri pisanju na %s

source: At beginning of tape, quitting now
ko: Å×ÀÌÇÁÀÇ ½ÃÀÛ ºÎºĞ¿¡¼­ Áö±İ Á¾·áÇÔ
sl: Na zaèetku traku, konèujem

source: Too many errors, quitting
ko: ¿À·ù°¡ ³Ê¹« ¸¹¾Æ¼­ Á¾·áÇÕ´Ï´Ù
sl: Preveè napak, konèujem

source: Read checkpoint %d
ko: °Ë»çÁöÁ¡ %d¸¦ ÀĞÀ½
sl: Branje oznake %d

source: Reading %s
ko: %s¸¦ ÀĞ´Â Áß
sl: Branje %s

source: WARNING: No volume header
ko: °æ°í: º¼·ı Çì´õ ¾øÀ½
sl: POZOR: Oznaka dela manjka

source: %s is not continued on this volume
ko: %s´Â ÀÌ º¼·ı¿¡ ¿¬¼ÓµÇ¾î ÀÖÁö ¾Ê½À´Ï´Ù
sl: %s se ne nadaljuje v tem delu

source: This volume is out of sequence
ko: ÀÌ º¼·ıÀº ¼ø¼­¸¦ ¹ş¾î³µ½À´Ï´Ù
sl: Ta del ne sodi v zaporedje

source: Archive %s EOF not on block boundary
ko: ºí·° °æ°è°¡ ¾Æ´Ñ ºÎºĞ¿¡¼­ ¾ÆÄ«ÀÌºê %sÀÇ EOF °ËÃâ
sl: Arhiv %s se ne konèa s koncem bloka

source: WARNING: Cannot close %s (%d, %d)
ko: °æ°í: %s¸¦ ´İÀ» ¼ö ¾ø½À´Ï´Ù (%d, %d)
sl: POZOR: Ni mogoèe zapreti %s (%d, %d)

source: Could not backspace archive file; it may be unreadable without -i
sl: Nazaj po arhivu ne gre, morda ni berljiv brez izbire -i

source: Child died with signal %d%s
ko: ÀÚ½ÄÀÌ ½ÅÈ£ %d%s¿Í ÇÔ²² Á×¾úÀ½
sl: Naslednik umrl s signalom %d%s

source: Child returned status %d
ko: ÀÚ½ÄÀÌ »óÅÂ %d¸¦ µÇµ¹·Á ÁÖ¾ú½À´Ï´Ù
sl: Naslednik vrnil status %d

source: Prepare volume #%d for %s and hit return:
sl: Pripravite del #%d za %s in pritisnite Return:

source: EOF where user reply was expected
ko: »ç¿ëÀÚÀÇ ÀÀ´äÀÌ ÇÊ¿äÇÑ °÷¿¡ EOF°¡ ÀÖÀ½
sl: Znak EOF na mestu, kjer se prièakuje odgovor uporabnika

source: WARNING: Archive is incomplete
ko: °æ°í: ¾ÆÄ«ÀÌºê°¡ ºÒ¿ÏÀüÇÕ´Ï´Ù
sl: POZOR: Arhiv nepopoln

source: n [name] Give a new file name for the next (and subsequent) volume(s) q Abort tar ! Spawn a subshell ? Print this list
ko: n [ÀÌ¸§] ´ÙÀ½(°ú ±× ÀÌÈÄÀÇ) º¼·ı¿¡ ´ëÇÑ »õ ÆÄÀÏ ÀÌ¸§À» ÁöÁ¤ÇÕ´Ï´Ù q tar¸¦ Áß´ÜÇÕ´Ï´Ù ! ¼­ºê¼ĞÀ» ½ÇÇàÇÕ´Ï´Ù ? ÀÌ ¸ñ·ÏÀ» ÀÎ¼âÇÕ´Ï´Ù
sl: n [name] Podamo novo ime datoteke za naslednji del (in vse nadaljnje) q Konèamo tar ! Po¾enemo sekundarno ukazno lupino ? Ta seznam uzazov

source: No new volume; exiting.
ko: »õ º¼·ıÀÌ ¾Æ´Ô; Á¾·á.
sl: Novega dela ni, konec.

source: Cannot fork!
ko: forkÇÒ ¼ö ¾ø½À´Ï´Ù!
sl: Vejitev ni mo¾na!

source: Cannot exec a shell %s
ko: %s ¼ĞÀ» ½ÇÇàÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe pognati lupine %s

source: Cannot read %s
ko: %s¸¦ ÀĞÀ» ¼ö ¾ø½À´Ï´Ù
sl: Branje %s ni mo¾no

source: Data differs
ko: ÀÚ·á°¡ ´Ù¸¨´Ï´Ù
sl: Podatki se razlikujejo

source: Unexpected EOF on archive file
ko: ¾ÆÄ«ÀÌºê ÆÄÀÏ¿¡ ¿¹±âÄ¡ ¾ÊÀº EOF
sl: Neprièakovan znak za konec datoteke v arhivu

source: File does not exist
ko: ÆÄÀÏÀÌ Á¸ÀçÇÏÁö ¾Ê½À´Ï´Ù
sl: Datoteka ne obstaja

source: Cannot stat file %s
sl: Ni mogoèe do statistike za datoteko %s

source: Verify
ko: °ËÁõ
sl: Preverjanje

source: Unknown file type '%c' for %s, diffed as normal file
sl: Neznan tip datoteke ,%c' za %s, diff kot na navadni datoteki

source: Not a regular file
ko: ÀÏ¹İÀûÀÎ ÆÄÀÏÀÌ ¾Æ´Ô
sl: Ni navadna datoteka

source: Mode differs
ko: ¸ğµå°¡ ´Ù¸¨´Ï´Ù
sl: Naèin se razlikuje

source: Uid differs
ko: uid°¡ ´Ù¸¨´Ï´Ù
sl: ©tevilka uporabnika (UID) se razlikuje

source: Gid differs
ko: gid°¡ ´Ù¸¨´Ï´Ù
sl: ©tevilka skupine (GID) se razlikuje

source: Mod time differs
ko: º¯°æ ½Ã°¢ÀÌ ´Ù¸¨´Ï´Ù
sl: Èas zadnje spremembe se razlikuje

source: Size differs
ko: Å©±â°¡ ´Ù¸¨´Ï´Ù
sl: Velikost se razlikuje

source: Error while closing %s
ko: %s¸¦ ´İ´Â µ¿¾È ¿À·ù ¹ß»ı
sl: Napaka pri zapiranju %s

source: Does not exist
ko: °¡ Á¸ÀçÇÏÁö ¾Ê½À´Ï´Ù
sl: Ne obstaja

source: Not linked to %s
ko: %s¿¡ ¿¬°áµÇÁö ¾ÊÀ½
sl: Ni povezana z %s

source: No such file or directory
ko: ±×·± ÆÄÀÏÀÌ³ª µğ·ºÅä¸®°¡ ¾øÀ½
sl: Datoteka ali imenik s tem imenom ne obstaja

source: Cannot read link %s
ko: ¸µÅ© %s¸¦ ÀĞÀ» ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe prebrati povezave %s

source: Symlink differs
ko: ±âÈ£¸µÅ©°¡ ´Ù¸¨´Ï´Ù
sl: Simbolna povezava se razlikuje

source: Device numbers changed
ko: ÀåÄ¡ ¹øÈ£°¡ ¹Ù²î¾úÀ½
sl: ©tevilka enote je spremenjena

source: Mode or device-type changed
ko: ¸ğµå ¶Ç´Â ÀåÄ¡ Å¸ÀÔÀÌ º¯°æµÊ
sl: Naèin ali tip enote je spremenjen

source: No longer a directory
ko: ´õ ÀÌ»ó µğ·ºÅä¸®°¡ ¾Æ´Ô
sl: Ni veè imenik

source: Cannot open file %s
ko: %s ÆÄÀÏÀ» ¿­ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odpreti datoteke %s

source: Could not rewind archive file for verify
ko: °ËÁõÀ» À§ÇØ ¾ÆÄ«ÀÌºê ÆÄÀÏÀ» µÇ°¨À» ¼ö ¾ø½À´Ï´Ù
sl: Arhiva ni mo¾no previti na zaèetek, preverjanje ni mo¾no

source: VERIFY FAILURE: %d invalid header(s) detected
ko: °ËÁõ ½ÇÆĞ: %d°³ÀÇ ºÎÀûÀıÇÑ Çì´õ°¡ °ËÃâµÊ
sl: NAPAKA: pri preverjanju najdeno %d neveljavnih glav

source: Removing drive spec from names in the archive
ko: ¾ÆÄ«ÀÌºê¿¡ ÀÖ´Â ÀÌ¸§µé¿¡¼­ µå¶óÀÌºê ÁöÁ¤¹®À» Á¦°ÅÇÔ
sl: Imena datotek v arhivu oèistimo imena pogona

source: Removing leading `/' from absolute path names in the archive
ko: ¾ÆÄ«ÀÌºê ¾È¿¡ ÀÖ´Â Àı´ë °æ·Î¸í¿¡¼­ ¾Õ¿¡ ºÙÀº `/'¸¦ Á¦°ÅÇÔ
sl: Imena datotek v arhivu oèistimo vodilnega ,/` pri absolutnih poteh

source: Cannot add file %s
ko: ÆÄÀÏ %s¸¦ Ãß°¡ÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe dodati datoteke %s

source: %s: is unchanged; not dumped
ko: %s: º¯°æµÇÁö ¾Ê¾Ò½À´Ï´Ù; ´ıÇÁµÇÁö ¾ÊÀ½
sl: %s: nespremenjena; brez sprememb

source: %s is the archive; not dumped
ko: %s´Â ¾ÆÄ«ÀÌºêÀÔ´Ï´Ù; ´ıÇÁµÇÁö ¾ÊÀ½
sl: %s je v arhivu; brez sprememb

source: Removing leading `/' from absolute links
ko: Àı´ë ¸µÅ©µé¿¡¼­ ¾Õ¿¡ ºÙÀº `/'¸¦ Á¦°ÅÇÔ
sl: Odstranjujemo vodilne ,/` iz absolutnih povezav

source: Cannot remove %s
ko: %s¸¦ Áö¿ï ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odstraniti %s

source: Cannot add directory %s
ko: %s µğ·ºÅä¸®¸¦ Ãß°¡ÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe dodati imenika %s

source: %s: On a different filesystem; not dumped
ko: %s: ´Ù¸¥ ÆÄÀÏ½Ã½ºÅÛ »ó¿¡ ÀÖÀ½; ´ıÇÁµÇÁö ¾ÊÀ½
sl: %s: Na drugem datoteènem sistemu; brez sprememb

source: Cannot open directory %s
ko: %s µğ·ºÅä¸®¸¦ ¿­ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe odpreti imenika %s

source: File name %s%s too long
ko: ÆÄÀÏ ÀÌ¸§ %s%s´Â ³Ê¹« ±é´Ï´Ù
sl: Ime datoteke %s%s predolgo

source: %s: Unknown file type; file ignored
ko: %s: ¾Ë ¼ö ¾ø´Â ÆÄÀÏ Å¸ÀÔ; ÆÄÀÏÀÌ ¹«½ÃµÊ
sl: %s: Neznan tip datoteke; datoteka ignorirana

source: Could not re-position archive file
ko: ¾ÆÄ«ÀÌºê ÆÄÀÏÀ» ÀçÀ§Ä¡½ÃÅ³ ¼ö ¾ø½À´Ï´Ù
sl: Repozicija arhiva neuspe¹na

source: This does not look like a tar archive
ko: ÀÌ°ÍÀº tar ¾ÆÄ«ÀÌºêÃ³·³ º¸ÀÌÁö ¾Ê½À´Ï´Ù
sl: To ne deluje kot arhiv ,tar'

source: Skipping to next header
ko: ´ÙÀ½ Çì´õ·Î °Ç³Ê ¶Ü
sl: Preskok na naslednjo glavo

source: Deleting non-header from archive
ko: ¾ÆÄ«ÀÌºê¿¡¼­ ºñÇì´õ ºÎºĞÀ» Á¦°ÅÇÔ
sl: Brisanje ne-glave iz arhiva

source: %s: Could not change access and modification times
ko: %s: Á¢±Ù ½Ã°¢°ú ¼öÁ¤ ½Ã°¢À» ¹Ù²Ü ¼ö ¾ø½À´Ï´Ù
sl: %s: Èasa zadnje spremembe in dostopa ni mo¾no spremeniti

source: %s: Could not write to file
ko: %s: ÆÄÀÏ¿¡ ¾µ ¼ö ¾ø½À´Ï´Ù
sl: %s: Zapis na datoteko ni mogoè

source: %s: Was unable to backup this file
ko: %s: ÀÌ ÆÄÀÏÀ» ¹é¾÷ÇÒ ¼ö ¾ø¾ú½À´Ï´Ù
sl: %s: Varnostne kopije te datoteke ni moè napraviti

source: Extracting contiguous files as regular files
ko: ¿¬¼ÓµÇ¾î ÀÖ´Â ÆÄÀÏÀ» ÀÏ¹İ ÆÄÀÏ·Î ÃßÃâÇÔ
sl: Neprekinjene datoteke izvleèemo kot navadne

source: %s: Could not create file
ko: %s: ÆÄÀÏÀ» ¸¸µé ¼ö ¾ø½À´Ï´Ù
sl: %s: Ni mogoèe ustvariti datoteke

source: %s: Error while closing
ko: %s: ´İ´Â µ¿¾È ¿À·ù ¹ß»ı
sl: %s: Napaka pri zapiranju

source: %s: Could not create symlink to `%s'
ko: %s: `%s'¿¡ ´ëÇÑ ±âÈ£¸µÅ©¸¦ ¸¸µé ¼ö ¾ø½À´Ï´Ù
sl: %s: Ni mogoèe ustvariti simbolne povezave na ,%s'

source: Attempting extraction of symbolic links as hard links
ko: ±âÈ£ ¸µÅ©¸¦ ÇÏµå ¸µÅ©·Î ÃßÃâÇÏ°í ÀÖ½À´Ï´Ù
sl: Simbolne povezave poskusimo dearhivirati kot trde

source: %s: Could not link to `%s'
ko: %s: `%s'¿¡ ¸µÅ©ÇÒ ¼ö ¾ø½À´Ï´Ù
sl: %s: Povezava na ,%s' ni mo¾na

source: %s: Could not make node
ko: %s: ³ëµå¸¦ ¸¸µé ¼ö ¾ø½À´Ï´Ù
sl: %s: Ni mo¾no ustvariti vozla

source: %s: Could not make fifo
ko: %s: fifo¸¦ ¸¸µé ¼ö ¾ø½À´Ï´Ù
sl: %s: Ni mo¾no ustvariti FIFO

source: %s: Could not create directory
ko: %s: µğ·ºÅä¸®¸¦ ¸¸µé ¼ö ¾ø½À´Ï´Ù
sl: %s: Ni mo¾no ustvariti imenika

source: Added write and execute permission to directory %s
ko: %s µğ·ºÅä¸®¿¡ ¾²±â¿Í ½ÇÇà ±ÇÇÑÀ» ºÎ°¡Çß½À´Ï´Ù
sl: Imeniku %s dodani dovoljenji za pisanje in izvajanje

source: Cannot extract `%s' -- file is continued from another volume
ko: `%s'¸¦ ÃßÃâÇÒ ¼ö ¾ø½À´Ï´Ù -- ÀÌ ÆÄÀÏÀº ´Ù¸¥ º¼·ı¿¡ ¿¬¼ÓµÇ¾î ÀÖ½À´Ï´Ù
sl: Dearhivacija ,%s' ni mo¾na - datoteka se nadaljuje iz prejn¹njega dela

source: Visible long name error
ko: °¡½ÃÀûÀÎ ±ä ÀÌ¸§ ¿À·ù
sl: Opazna napaka zaradi dolgih imen

source: Unknown file type '%c' for %s, extracted as normal file
sl: Neznan tip ,%c' pri datoteki %s, dearhiviramo kot navadno datoteko

source: Directory %s has been renamed
ko: %s µğ·ºÅä¸®´Â ÀÌ¸§ÀÌ ¹Ù²î¾ú½À´Ï´Ù
sl: Imenik %s je bil preimenovan

source: Directory %s is new
ko: %s´Â »õ µğ·ºÅä¸®ÀÔ´Ï´Ù
sl: Imenik %s je nov

source: Could not get current directory
ko: ÇöÀç µğ·ºÅä¸®¸¦ ¾Ë ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe izvedeti trenutnega imenika

source: Could not get current directory: %s
ko: ÇöÀç µğ·ºÅä¸®¸¦ ¾Ë ¼ö ¾ø½À´Ï´Ù: %s
sl: Ni mogoèe izvedeti trenutnega imenika: %s

source: File name %s/%s too long
ko: ÆÄÀÏ ÀÌ¸§ %s/%s´Â ³Ê¹« ±é´Ï´Ù
sl: Ime datoteke %s/%s je predolgo

source: Cannot chdir to %s
ko: %s·Î µğ·ºÅä¸®¸¦ ¹Ù²Ü ¼ö ¾ø½À´Ï´Ù
sl: Imenik %s ni dostopen

source: Unexpected EOF in archive
ko: ¾ÆÄ«ÀÌºê¿¡ ¿¹±âÄ¡ ¾ÊÀº EOF
sl: Neprièakovan znak za konec datoteke v arhivu

source: %s: Deleting %s
ko: %s: %s¸¦ Áö¿ò
sl: %s: Bri¹emo %s

source: Error while deleting %s
ko: %s¸¦ Áö¿ì´Â µ¿¾È ¿À·ù ¹ß»ı
sl: Napaka pri brisanju %s

source: Omitting %s
ko: %s¸¦ »ı·«
sl: Izpu¹èamo %s

source: Hmm, this doesn't look like a tar archive
ko: Èì, ÀÌ°ÍÀº tar ¾ÆÄ«ÀÌºêÃ³·³ º¸ÀÌÁö ¾Ê´Â±º¿ä
sl: Hmm, to ne izgleda kot arhiv tar

source: Skipping to next file header
ko: ´ÙÀ½ ÆÄÀÏ Çì´õ·Î °Ç³Ê ¶Ü
sl: Preskoèimo na naslednjo glavo datoteke

source: EOF in archive file
ko: ¾ÆÄ«ÀÌºê ÆÄÀÏ¿¡ EOF
sl: Znak za konec datoteke v arhivu

source: Visible longname error
ko: °¡½ÃÀûÀÎ ±äÀÌ¸§ ¿À·ù
sl: Opazna napaka zaradi dolgih imen

source: link to %s
ko: %s·Î ¸µÅ©
sl: povezava na %s

source: unknown file type `%c'
ko: ¾Ë ¼ö ¾ø´Â ÆÄÀÏ Å¸ÀÔ `%c'
sl: neznan tip ,%c'

source: --Volume Header--
ko: --º¼·ı Çì´õ--
sl: --Glava dela--

source: --Mangled file names--
sl: --Predelana imena datotek--

source: Creating directory:
ko: µğ·ºÅä¸®¸¦ ¸¸µå´Â Áß:
sl: Ustvarjamo imenik:

source: Unexpected EOF in mangled names
sl: Neprièakovan znak za konec datoteke med predelanimi imeni

source: Cannot rename %s to %s
ko: %s¸¦ %s·Î ÀÌ¸§À» ¹Ù²Ü ¼ö ¾ø½À´Ï´Ù
sl: Datoteke %s ni mogoèe preimenovati v %s

source: Renamed %s to %s
ko: %s¸¦ %s·Î ÀÌ¸§ ¹Ù²Ş
sl: Datoteka %s preimenovana v %s

source: Cannot symlink %s to %s
ko: %s¸¦ %s·Î ±âÈ£¸µÅ©ÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Simbolna povezava %s na %s ni mogoèa

source: Symlinked %s to %s
ko: %s¿¡¼­ %s·Î ±âÈ£¸µÅ©µÇ¾úÀ½
sl: %s simbolno povezano z %s

source: Unknown demangling command %s
sl: Neznan ukaz %s za restavriranje izvornih imen

source: Cannot change to directory %s
ko: %s·Î µğ·ºÅä¸®¸¦ ¹Ù²Ü ¼ö ¾ø½À´Ï´Ù
sl: Imenik %s ni dosegljiv

source: Missing file name after -C
ko: -C µÚ¿¡ ÆÄÀÏ ÀÌ¸§ÀÌ ºüÁ³À½
sl: Za izbiro -C manjka ime datoteke

source: %s: Not found in archive
ko: %s: ¾ÆÄ«ÀÌºê¿¡ ¾øÀ½
sl: %s: Ni najdeno v arhivu

source: rmtd: Cannot allocate buffer space
ko: rmtd: ¹öÆÛ °ø°£À» ÇÒ´çÇÒ ¼ö ¾ø½À´Ï´Ù
sl: rmtd: Ni mogoèe rezervirati prostora za medpomnilnik

source: Cannot allocate buffer space
ko: ¹öÆÛ °ø°£À» ÇÒ´çÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe rezervirati prostora za medpomnilnik

source: rmtd: Premature eof
ko: rmtd: Àß¸øµÈ eof
sl: rmtd: Predèasen znak za konec datoteke

source: Premature end of file
ko: Àß¸øµÈ ÆÄÀÏ ³¡
sl: Predèasen znak za konec datoteke

source: rmtd: Garbage command %c
ko: rmtd: ¾µ¸ğ¾ø´Â ¸í·É %c
sl: rmtd: Neveljaven ukaz %c

source: Garbage command
ko: ¾µ¸ğ¾ø´Â ¸í·É
sl: Neveljaven ukaz

source: exec/tcp: Service not available
ko: exec/tcp: ¾µ ¼ö ¾ø´Â ¼­ºñ½º
sl: exec/tcp: Storitev ni dosegljiva

source: stdin
ko: Ç¥ÁØÀÔ·Â
sl: standardni vhod

source: stdout
ko: Ç¥ÁØÃâ·Â
sl: standardni izhod

source: Cannot execute remote shell
ko: ¿ø°İ ¼ĞÀ» ½ÇÇàÇÒ ¼ö ¾ø½À´Ï´Ù
sl: Ni mogoèe pognati nelokalne ukazne lupine

source: Options `-%s' and `-%s' both want standard input
ko: `-%s'°ú `-%s' ¿É¼ÇÀº ¸ğµÎ Ç¥ÁØ ÀÔ·ÂÀÌ ÇÊ¿äÇÕ´Ï´Ù
sl: Izbiri ,-%s' in ,-%s' obe zahtevata standardni vhod

source: Cannot read confirmation from user
ko: »ç¿ëÀÚÀÇ È®ÀÎÀ» ÀĞÀ» ¼ö ¾ø½À´Ï´Ù
sl: Uporabnikova potrditev ni izvedljiva

source: Try `%s --help' for more information.
ko: ´õ ¸¹Àº Á¤º¸¸¦ º¸·Á¸é `%s --help' ÇÏ½Ê½Ã¿À.
sl: Poskusite ,%s --help' za izèrpnej¹a navodila.

source: GNU `tar' saves many files together into a single tape or disk archive, and can restore individual files from the archive.
sl: GNU ,tar` shranjuje veè datotek skupaj na trak ali arhiv na disku, ter lahko vrne posamezne datoteke iz arhiva.

source: Usage: %s [OPTION]... [FILE]...
ko: »ç¿ë¹ı: %s [¿É¼Ç]... [ÆÄÀÏ]...
sl: Uporaba: %s [IZBIRA]... [DATOTEKA]...

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. Similarly for optional arguments.
sl: Èe je pri dalj¹i obliki izbire napisano, da ta zahteva argument, je argument obvezen tudi za kratko obliko. Podobno velja za neobvezne argumente.

source: Main operation mode: -t, --list list the contents of an archive -x, --extract, --get extract files from an archive -c, --create create a new archive -d, --diff, --compare find differences between archive and file system -r, --append append files to the end of an archive -u, --update only append files newer than copy in archive -A, --catenate append tar files to an archive --concatenate same as -A --delete delete from the archive (not on mag tapes!)
ko: ÁÖ¿ä µ¿ÀÛ ¸ğµå: -t, --list ¾ÆÄ«ÀÌºêÀÇ ³»¿ë¹°À» Ãâ·ÂÇÕ´Ï´Ù -x, --extract, --get ¾ÆÄ«ÀÌºê¿¡¼­ ÆÄÀÏÀ» ÃßÃâÇÕ´Ï´Ù -c, --create »õ·Î¿î ¾ÆÄ«ÀÌºê¸¦ ¸¸µì´Ï´Ù -d, --diff, --compare ¾ÆÄ«ÀÌºê¿Í ÆÄÀÏ ½Ã½ºÅÛ°£ÀÇ Â÷ÀÌÁ¡À» ºñ±³ÇÕ´Ï´Ù -r, --append ¾ÆÄ«ÀÌºê ³¡¿¡ ÆÄÀÏÀ» Ãß°¡ÇÕ´Ï´Ù -u, --update ¾ÆÄ«ÀÌºê ¾ÈÀÇ °Íº¸´Ù »õ·Î¿î ÆÄÀÏ¸¸ Ãß°¡ÇÕ´Ï´Ù -A, --catenate ¾ÆÄ«ÀÌºê¿¡ tar ÆÄÀÏÀ» Ãß°¡ÇÕ´Ï´Ù --concatenate -A¿Í °°À½ --delete ¾ÆÄ«ÀÌºê·ÎºÎÅÍ Á¦°ÅÇÕ´Ï´Ù (ÀÚ±â Å×ÀÌÇÁ¿¡¼± ¾ÈµÊ!)
sl: Glavni naèini delovanja: -t, --list izpis vsebine arhiva -x, --extract, --get izvleèenje datoteke iz arhiva -c, --create ustvarjanje novega arhiva -d, --diff, --compare iskanje razlik med arhivom in datoteènim sistemom -r, --append dodajanje datotek na konec arhiva -u, --update nadomestitev starih/dodajanje novih datotek -A, --catenate zlivanje arhivov --concatenate isto kot -A --delete brisanje datotek iz arhiva (ne deluje na traku!)

source: Operation modifiers: -W, --verify attempt to verify the archive after writing it --remove-files remove files after adding them to the archive -k, --keep-old-files don't overwrite existing files when extracting -U, --unlink-first remove each file prior to extracting over it --recursive-unlink empty hierarchies prior to extracting directory -S, --sparse handle sparse files efficiently -O, --to-stdout extract files to standard output -G, --incremental handle old GNU-format incremental backup -g, --listed-incremental handle new GNU-format incremental backup --ignore-failed-read do not exit with nonzero on unreadable files
ko: µ¿ÀÛ º¯°æÀÚ: -W, --verify ¾ÆÄ«ÀÌºê¸¦ ±â·ÏÇÑ ´ÙÀ½ °ËÁõÇÏµµ·Ï ÇÕ´Ï´Ù --remove-files ¾ÆÄ«ÀÌºê¿¡ ÆÄÀÏÀ» Ãß°¡ÇÑ ´ÙÀ½ Áö¿ó´Ï´Ù -k, --keep-old-files ÃßÃâÇÒ ¶§ ÀÌ¹Ì Á¸ÀçÇÏ´Â ÆÄÀÏÀ» µ¤¾î¾²Áö ¾Ê½À´Ï´Ù -U, --unlink-first ÃßÃâÇÏ±â¿¡ ¾Õ¼­ ´ë»ó ÆÄÀÏÀ» Áö¿ó´Ï´Ù --recursive-unlink µğ·ºÅä¸®¸¦ ÃßÃâÇÏ±â¿¡ ¾Õ¼­ ±× Ã¼°è¸¦ ºñ¿ó´Ï´Ù -S, --sparse ½ºÆÄ½º ÆÄÀÏÀ» È¿À²ÀûÀ¸·Î Ã³¸®ÇÕ´Ï´Ù -O, --to-stdout Ç¥ÁØ Ãâ·ÂÀ¸·Î ÆÄÀÏÀ» ÃßÃâÇÕ´Ï´Ù -G, --incremental ¿À·¡µÈ GNU Çü½ÄÀÇ Á¡ÁøÀû ¹é¾÷ ÆÄÀÏÀ» Ã³¸®ÇÕ´Ï´Ù -g, --listed-incremental »õ·Î¿î GNU Çü½ÄÀÇ Á¡ÁøÀû ¹é¾÷ ÆÄÀÏÀ» Ã³¸®ÇÕ´Ï´Ù --ignore-failed-read ÀĞÀ» ¼ö ¾ø´Â ÆÄÀÏ¿¡ ´ëÇØ ¿µ ¾Æ´Ñ °ªÀ¸·Î Á¾·áÇÏÁö ¾Ê½À´Ï´Ù
sl: Doloèila: -W, --verify s poskusom preverjanja zapisanega arhiva --remove-files z brisanjem datotek, dodanih v arhiv -k, --keep-old-files brez brisanja obstojeèih datotek pri izvlaèenju -U, --unlink-first z brisanjem starih datotek pri izvlaèenju novih prek njih (tudi celih imenikov, èe je dan dvakrat) --recursive-unlink izpraznimo hierarhije pred izvlaèenjem imenikov -S, --sparse ekonomièno ravnanje z razpr¹enimi datotekami -O, --to-stdout izvlaèenje na standardni izhod -G, --incremental stari format GNU za inkrementalne arhive -g, --listed-incremental novi format GNU za inkrementalne arhive --ignore-failed-read nadaljuj z branjem, tudi èe datoteke ni moè prebrati

source: Handling of file attributes: --owner=NAME force NAME as owner for added files --group=NAME force NAME as group for added files --mode=CHANGES force (symbolic) mode CHANGES for added files --atime-preserve don't change access times on dumped files -m, --modification-time don't extract file modified time --same-owner try extracting files with the same ownership --numeric-owner always use numbers for user/group names -p, --same-permissions extract all protection information --preserve-permissions same as -p -s, --same-order sort names to extract to match archive --preserve-order same as -s --preserve same as both -p and -s
sl: Ravnanje z atributi datotek: --owner=IME pri dodajanju datotek spremenimo lastnika v IME --group=IME pri dodajanju datotek spremenimo skupino v IME --mode=ZA©ÈITA pri dodajanju datotek nastavimo ZA©ÈITO --atime-preserve brez spreminjanja èasa zadnjega dostopa -m, --modification-time brez izvlaèenja èasa spremembe --same-owner z ohranitvijo lastni¹tva, èe je mo¾no --numeric-owner s ¹tevilènimi vrednostmi UID/GID namesto imen -p, --same-permissions z ohranitvijo za¹èite datotek --preserve-permissions isto kot -p -s, --same-order imena razvrstimo tako, da se ujemajo z arhivom --preserve-order isto kot -s --preserve isto kot -p in -s skupaj

source: Device selection and switching: -f, --file=ARCHIVE use archive file or device ARCHIVE --force-local archive file is local even if has a colon --rsh-command=COMMAND use remote COMMAND instead of rsh -[0-7][lmh] specify drive and density -M, --multi-volume create/list/extract multi-volume archive -L, --tape-length=NUM change tape after writing NUM x 1024 bytes -F, --info-script=FILE run script at end of each tape (implies -M) --new-volume-script=FILE same as -F FILE --volno-file=FILE use/update the volume number in FILE
ko: ÀåÄ¡ ¼±ÅÃ°ú ÀüÈ¯: -f, --file=ARCHIVE ¾ÆÄ«ÀÌºê ÆÄÀÏ ¶Ç´Â ARCHIVE ÀåÄ¡¸¦ »ç¿ëÇÕ´Ï´Ù --force-local ÀÌ¸§¿¡ Äİ·ĞÀÌ ÀÖ´Â ¾ÆÄ«ÀÌºê ÆÄÀÏµµ Áö¿ª ÆÄÀÏ·Î ÀÎ½ÄÇÕ´Ï´Ù --rsh-command=COMMAND rsh ´ë½Å ¿ø°İ COMMAND¸¦ »ç¿ëÇÕ´Ï´Ù -[0-7][lmh] µå¶óÀÌºê¿Í ±â·Ï ¹Ğµµ¸¦ ÁöÁ¤ÇÕ´Ï´Ù -M, --multi-volume ´ÙÁß º¼·ı ¾ÆÄ«ÀÌºê¸¦ »ı¼º/Ãâ·Â/ÃßÃâÇÕ´Ï´Ù -L, --tape-length=NUM NUM x 1024 ¹ÙÀÌÆ®¸¦ ¾´ µÚ¿¡ Å×ÀÌÇÁ¸¦ ¹Ù²ß´Ï´Ù -F, --info-script=FILE °¢ Å×ÀÌÇÁÀÇ ³¡¿¡¼­ ½ºÅ©¸³Æ®¸¦ ½ÇÇàÇÕ´Ï´Ù (-MÀ» Æ÷ÇÔÇÔ) --new-volume-script=FILE -F FILE°ú °°À½ --volno-file=FILE FILE ¾È¿¡ ÀÖ´Â º¼·ı ¹øÈ£¸¦ »ç¿ë/°»½ÅÇÕ´Ï´Ù
sl: Izbira enote: -f, --file=ARHIV uporabi datoteko ali enoto ARHIV --force-local arhiv je lokalen ne glede na dvopièje v imenu --rsh-command=UKAZ uporabi nelokalen UKAZ namesto rsh -[0-7][lmh] doloèi enoto in gostoto zapisa -M, --multi-volume ustvarjanje/pregled/izvleèek arhiva v veè delih -L, --tape-length=©T menjava traku po ©T x 1024 zapisanih zlogih -F, --info-script=SKRIPT po¾eni SKRIPT po koncu traku (privzema -M) --new-volume-script=SKRIPT isto kot -F SKRIPT --volno-file=DATOTEKA uporabimo/a¾uriramo ¹tevilo dela v DATOTEKI
