Repository: apple-open-source/macos
Catalog: gnutar/tar/po/*.po
Languages: ko, sl

source: Device blocking: -b, --blocking-factor=BLOCKS BLOCKS x 512 bytes per record --record-size=SIZE SIZE bytes per record, multiple of 512 -i, --ignore-zeros ignore zeroed blocks in archive (means EOF) -B, --read-full-records reblock as we read (for 4.2BSD pipes)
ko: ÀåÄ¡ ºí·° ¼³Á¤: -b, --blocking-factor=BLOCK ·¹ÄÚµå´ç BLOCK x 512 ¹ÙÀÌÆ® --record-size=SIZE ·¹ÄÚµå´ç SIZE ¹ÙÀÌÆ®, 512ÀÇ ¹è¼ö -i, --ignore-zeros ¾ÆÄ«ÀÌºê¿¡¼­ ¿µÀ¸·Î µÈ ºí·°À» ¹«½ÃÇÕ´Ï´Ù (EOF¸¦ ÀÇ¹ÌÇÔ) -B, --read-full-records ÀĞÀº °ÍÀ» Àçºí·°È­ÇÕ´Ï´Ù (4.2BSD ÆÄÀÌÇÁ¿ëÀ¸·Î)
sl: Bloèna razdelitev enote: -b, --blocking-factor=BLOKI dol¾ina zapisa BLOKI x 512 zlogov --record-size=DOL®INA DOL®INA zapisa v zlogih (veèkratnik 512) -i, --ignore-zeros ne meni se za bloke nièel (EOF) -B, --read-full-records reblock as we read (for 4.2BSD pipes)

source: Archive format selection: -V, --label=NAME create archive with volume name NAME PATTERN at list/extract time, a globbing PATTERN -o, --old-archive, --portability write a V7 format archive --posix write a POSIX conformant archive -z, --gzip, --ungzip filter the archive through gzip -Z, --compress, --uncompress filter the archive through compress --use-compress-program=PROG filter through PROG (must accept -d)
sl: Izbira formata arhiva: -V, --label=IME ustvarjanje arhiva z danim IMENOM VZOREC pri pregledu vsebine/izvleèku je ime lahko regularni izraz VZOREC -o, --old-archive, --portability zapis arhiva v formatu V7 --posix zapis arhiva v formatu POSIX -z, --gzip, --ungzip arhiv spustimo skozi program gzip -Z, --compress, --uncompress arhiv spustimo skozi program compress --use-compress-program=PROGRAM arhiv spustimo skozi PROGRAM (ki mora sprejemati izbiro -d)

source: Local file selection: -C, --directory=DIR change to directory DIR -T, --files-from=NAME get names to extract or create from file NAME --null -T reads null-terminated names, disable -C --exclude=PATTERN exclude files, given as a globbing PATTERN -X, --exclude-from=FILE exclude globbing patterns listed in FILE -P, --absolute-names don't strip leading `/'s from file names -h, --dereference dump instead the files symlinks point to --no-recursion avoid descending automatically in directories -l, --one-file-system stay in local file system when creating archive -K, --starting-file=NAME begin at file NAME in the archive
sl: Izbira lokalne datoteke: -C, --directory=IMENIK prestavimo se v navedeni IMENIK -T, --files-from=DATOTEKE seznam datotek preberemo z navedene DATOTEKE --null -T prebere z \000 terminirana imena; onemogoèi -C --exclude=VZOREC razen datotek, ki jih opisuje VZOREC -X, --exclude-from=DATOTEKA vse datoteke razen vzorcev, prebranih z DATOTEKE -P, --absolute-names ohranimo vodilni ,/` pri imenih datotek -h, --dereference shranimo datoteke, na katere ka¾ejo simbolne povezave --no-recurse podimenikov ne vkljuèujemo avtomatièno -l, --one-file-system izpustimo datotek na nelokalnih datoteènih sistemih -K, --starting-file=IME zaèen¹i z navedenim IMENOM v arhivu

source: -N, --newer=DATE only store files newer than DATE --newer-mtime compare date and time when data changed only --after-date=DATE same as -N
ko: -N, --newer=DATE DATE ÀÌÈÄÀÇ ÆÄÀÏµé¸¸ ÀúÀåÇÕ´Ï´Ù --newer-mtime µ¥ÀÌÅÍ°¡ ¹Ù²î¾úÀ» ¶§¸¸ ³¯Â¥¿Í ½Ã°£À» ºñ±³ÇÕ´Ï´Ù --after-date=DATE -N°ú °°À½
sl: -N, --newer=DATUM arhiviramo samo datoteke, mlaj¹e od DATUMA --newer-mtime datum in èas primerjamo le ob spremembah podatkov --after-date=DATUM isto kot -N

source: --backup[=CONTROL] backup before removal, choose version control --suffix=SUFFIX backup before removel, override usual suffix
sl: --backup[=CONTROL] varnostna kopija pred brisanjem, z mo¾nostjo izbire nadzora verzije --suffix=SUFFIX varnostna kopija pred brisanjem, doloèimo pripono

source: Informative output: --help print this help, then exit --version print tar program version number, then exit -v, --verbose verbosely list files processed --checkpoint print directory names while reading the archive --totals print total bytes written while creating archive -R, --block-number show block number within archive with each message -w, --interactive ask for confirmation for every action --confirmation same as -w
ko: Á¤º¸ Ãâ·Â¿¡ °üÇÑ ¿É¼Ç: --help ÀÌ µµ¿ò¸»À» ÀÎ¼âÇÏ°í ³¡³À´Ï´Ù --version tar ÇÁ·Î±×·¥ÀÇ ¹öÀü ¹øÈ£¸¦ ÀÎ¼âÇÏ°í ³¡³À´Ï´Ù -v, --verbose Ã³¸®µÇ´Â ÆÄÀÏÀ» ¼ø¼­´ë·Î Ãâ·ÂÇÕ´Ï´Ù --checkpoint ¾ÆÄ«ÀÌºê¸¦ ÀĞÀ» µ¿¾È µğ·ºÅä¸® ÀÌ¸§À» ÀÎ¼âÇÕ´Ï´Ù --totals ¾ÆÄ«ÀÌºê¸¦ ¸¸µé µ¿¾È ¾²¿©Áø ÃÑ ¹ÙÀÌÆ® ¼ö¸¦ ÀÎ¼âÇÕ´Ï´Ù -R, --block-number °¢ ¸Ş½ÃÁö¸¶´Ù ¾ÆÄ«ÀÌºê³»ÀÇ ºí·° ¹øÈ£¸¦ Ç¥½ÃÇÕ´Ï´Ù -w, --interactive ¸ğµç Çàµ¿¿¡ ´ëÇØ È®ÀÎÀ» ¿ä±¸ÇÕ´Ï´Ù --confirmation -w¿Í °°À½
sl: Informativni izpisi: --help ta navodila --version verzija programa -v, --verbose z zgovornim izpisom obdelanih datotek --checkpoint z izpisom imenikov pri branju arhiva --totals z izpisom celotne dol¾ine pri zapisu -R, --block-number z izpisom zaporednega bloka v arhivu ob vsakem sporoèilu -w, --interactive z uporabnikovo potrditvijo za vsako opravilo --confirmation isto kot -w

source: The backup suffix is `~', unless set with --suffix or SIMPLE_BACKUP_SUFFIX. The version control may be set with --backup or VERSION_CONTROL, values are: t, numbered make numbered backups nil, existing numbered if numbered backups exist, simple otherwise never, simple always make simple backups
sl: Pripona varnostne kopije je ,~`, razen èe ni drugaèe doloèeno z izbiro --suffix ali s spremenljivko SIMPLE_BACKUP_SUFFIX. Tip varnostne kopije lahko doloèimo z izbiro --backup ali s spremenljivko VERSION_CONTROL. Vrednosti so: t, numbered o¹tevilèene varnostne kopije nil, existing o¹tevilèene varnostne kopije, èe take ¾e obstajajo, sicer enostavne never, simple vedno enostavne varnostne kopije

source: GNU tar cannot read nor produce `--posix' archives. If POSIXLY_CORRECT is set in the environment, GNU extensions are disallowed with `--posix'. Support for POSIX is only partially implemented, don't count on it yet. ARCHIVE may be FILE, HOST:FILE or USER@HOST:FILE; and FILE may be a file or a device. *This* `tar' defaults to `-f%s -b%d'.
ko: GNU tar´Â `--posix' ¾ÆÄ«ÀÌºê¸¦ ÀĞ°Å³ª ¸¸µé¾î ³¾ ¼ö ¾ø½À´Ï´Ù. ¸¸¾à POSIXLY_CORRECT°¡ È¯°æ¿¡¼­ ¼³Á¤µÇ¾î ÀÖ´Ù¸é, GNU È®ÀåÀº `--posix'À» ÅëÇØ ºñÈ°¼ºÈ­µË´Ï´Ù. POSIX Áö¿øÀº °Ü¿ì ºÎºĞÀûÀ¸·Î¸¸ ±¸ÇöµÇ¾úÀ¸¹Ç·Î ¾ÆÁ÷ ½Å·Ú ÇÏÁö´Â ¸¶½Ê½Ã¿À. ARCHIVE´Â FILE, HOST:FILE, ¶Ç´Â USER@HOST:FILEÀÌ µÉ ¼ö ÀÖÀ¸¸ç, ¿©±â¼­ FILEÀº ÆÄÀÏÀÌ³ª ÀåÄ¡°¡ µÉ ¼ö ÀÖ½À´Ï´Ù. ÀÌ `tar'ÀÇ ³»Á¤°ªÀº `-f%s -b%d'ÀÔ´Ï´Ù.
sl: GNU tar ne zna ne prebrati in ne ustvariti arhivov ,--posix`. Pri nastavljeni spremenljivki POSIXLY_CORRECT in uporabi izbire ,--posix` raz¹iritve GNU niso dovoljene. Podpora za POSIX ¹e ni v celoti izvedena, ne zana¹ajte se nanjo. ARHIV je lahko podan v obliki DATOTEKA, RAÈUNALNIK:DATOTEKA ali UPORABNIK@RAÈUNALNIK:DATOTEKA; kjer je DATOTEKA lahko datoteka ali enota. Privzeta izbira *tega* programa ,tar` je `-f%s -b%d'.

source: Report bugs to <tar-bugs@gnu.org>.
ko: <tar-bugs@gnu.org>·Î ¹ö±×¸¦ º¸°íÇØ ÁÖ½Ê½Ã¿À.
sl: Poroèila o morebitnih napakah javite na <tar-bugs@gnu.org>.

source: You may not specify more than one `-Acdtrux' option
ko: `-Acdtrux' ¿É¼Ç Áß ÇÏ³ª ÀÌ»óÀ» ÁöÁ¤ÇÏ¸é ¾È µË´Ï´Ù
sl: Najveè ena od izbir ,,-Acdtrux'' je dovoljena naenkrat

source: Conflicting compression options
ko: Çò°¥¸®´Â ¾ĞÃà ¿É¼Ç
sl: Nasprotujoèe si izbire glede stiskanja arhiva

source: Old option `%c' requires an argument.
ko: ¿À·¡µÈ ¿É¼Ç `%c'´Â ÀÎ¼ö°¡ ÇÊ¿äÇÕ´Ï´Ù.
sl: Stara izbira ,%c' zahteva argument.

source: Obsolete option, now implied by --blocking-factor
ko: --blocking-factor¿¡ Æ÷ÇÔµÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç
sl: Zastarela izbira, zdaj privzeta z --blocking-factor

source: Obsolete option name replaced by --blocking-factor
ko: --block-factor·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --blocking-factor

source: Obsolete option name replaced by --read-full-records
ko: --read-full-records·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --read-full-records

source: Obsolete option name replaced by --touch
ko: --touch·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --touch

source: More than one threshold date
sl: Veè kot en pra¾ni podatek

source: Invalid date format `%s'
ko: ºÎÀûÀıÇÑ ³¯Â¥ Çü½Ä `%s'
sl: Neveljavna oblika datuma v ,%s`

source: Conflicting archive format options
ko: Çò°¥¸®´Â ¾ÆÄ«ÀÌºê Çü½Ä ¿É¼Ç
sl: Nasprotujoèe si izbire glede formata arhiva

source: Obsolete option name replaced by --absolute-names
ko: --absolute-names·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --absolute-names

source: Obsolete option name replaced by --block-number
ko: --block-number·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --block-number

source: Obsolete option name replaced by --backup
ko: --backupÀ¸·Î ´ëÃ¼µÇ¾î ¾µ¸ğ¾ø°Ô µÈ ¿É¼Ç ÀÌ¸§
sl: Zastarela izbira, zdaj nadome¹èena z --backup

source: Invalid group given on option
ko: ¿É¼Ç¿¡ ºÎÀûÀıÇÑ ±×·ìÀÌ ÁÖ¾îÁü
sl: Podana skupina ni veljavna

source: Invalid mode given on option
ko: ¿É¼Ç¿¡ ºÎÀûÀıÇÑ ¸ğµå°¡ ÁÖ¾îÁü
sl: Podana za¹èita ni veljavna

source: Invalid owner given on option
ko: ¿É¼Ç¿¡ ºÎÀûÀıÇÑ ¼ÒÀ¯ÀÚ°¡ ÁÖ¾îÁü
sl: Podani uporabnik ni veljaven

source: Record size must be a multiple of %d.
ko: ·¹ÄÚµå Å©±â´Â %dÀÇ ¹è¼ö°¡ µÇ¾î¾ß ÇÕ´Ï´Ù.
sl: Dol¾ina zapisa mora biti veèkratnik %d.

source: Options `-[0-7][lmh]' not supported by *this* tar
ko: `-[0-7][lmh]' ¿É¼ÇÀº ÀÌ tar¿¡¼± Áö¿øµÇÁö ¾Ê½À´Ï´Ù
sl: *Ta* tar ne podpira izbir ,,-[0-7][lmh]''

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
sl: To je prost program; pogoji, pod katerimi ga lahko razmno¾ujete in raz¹irjate so navedeni v izvorni kodi. Za program ni NOBENEGA jamstva, niti jamstev USTREZNOSTI ZA PRODAJO ali PRIMERNOSTI ZA UPORABO.

source: Written by John Gilmore and Jay Fenlason.
ko: John Gilmore¿Í Jay FenlasonÀÌ ¸¸µé¾ú½À´Ï´Ù.
sl: Avtorja John Gilmore in Jay Fenlason.

source: GNU features wanted on incompatible archive format
sl: Raz¹iritve GNU izbrane na nezdru¾ljivem formatu arhiva

source: Multiple archive files requires `-M' option
ko: ´ÙÁß ¾ÆÄ«ÀÌºê ÆÄÀÏÀº `-M' ¿É¼ÇÀÌ ÇÊ¿äÇÕ´Ï´Ù
sl: Arhivi v veè delih zahtevajo izbiro ,-M'

source: Cowardly refusing to create an empty archive
sl: Zahteva po odprtju praznega arhiva bojazljivo zavrnjena

source: Options `-Aru' are incompatible with `-f -'
ko: `-Aru' ¿É¼ÇÀº `-f -'°ú µ¿½Ã¿¡ ¾µ ¼ö ¾ø½À´Ï´Ù
sl: Izbire ,-Ary' so nezdru¾ljive z ,,-f -''

source: You must specify one of the `-Acdtrux' options
ko: `-Acdtrux' ¿É¼Çµé Áß ÇÏ³ª¸¦ ÁöÁ¤ÇØ¾ß ÇÕ´Ï´Ù
sl: Ena od izbir ,,-Acdtrux'' je obvezna

source: Error exit delayed from previous errors
sl: Izhod ob napaki zakasnjen zaradi prej¹njih napak

source: Generate data files for GNU tar test suite.
ko: GNU tar ½ÃÇè µµ±¸¿ë µ¥ÀÌÅÍ ÆÄÀÏÀ» »ı¼ºÇÕ´Ï´Ù.
sl: Ustvarimo podatkovne datoteke za testno zbirko GNU tar.

source: Usage: %s [OPTION]...
ko: »ç¿ë¹ı: %s [¿É¼Ç]...
sl: Uporaba: %s [IZBIRA]...

source: If a long option shows an argument as mandatory, then it is mandatory for the equivalent short option also. -l, --file-length=LENGTH LENGTH of generated file -p, --pattern=PATTERN PATTERN is `default' or `zeros' --help display this help and exit --version output version information and exit
ko: ±ä ¿É¼Ç¿¡ ºÎ°¡µÇ´Â ÀÎ¼ö°¡ ÀÖÀ» ¶§, ÀÌ´Â µ¿ÀÏÇÑ ÀÇ¹ÌÀÇ ÂªÀº ¿É¼Ç¿¡µµ Àû¿ëµË´Ï´Ù. -l, --file-length=±æÀÌ »ı¼ºµÇ´Â ÆÄÀÏÀÇ ±æÀÌ -p, --pattern=ÆĞÅÏ ÆĞÅÏÀº `default'³ª `zeros'ÀÔ´Ï´Ù --help ÀÌ µµ¿ò¸»À» º¸¿©ÁÖ°í ¸¶Ä¨´Ï´Ù --version ¹öÀü Á¤º¸¸¦ Ãâ·ÂÇÏ°í ¸¶Ä¨´Ï´Ù
sl: Argumenti, ki so obvezni za dolge oblike izbire, so obvezni tudi za kratke. -l, --file-length=DOL®INA DOL®INA ustvarjene datoteke -p, --pattern=VZOREC mo¾nosti za VZOREC sta ,default` in ,zeros` --help ta navodila --version verzija programa

source: Ambiguous pattern `%s'
ko: ¸ğÈ£ÇÑ ÆĞÅÏ `%s'
sl: Dvoumen vzorec ,%s`

source: Unknown pattern `%s'
ko: ¾Ë ¼ö ¾ø´Â ÆĞÅÏ `%s'
sl: Neznan vzorec ,%s`

source: Copyright (C) 1995, 1996, 1997 Free Software Foundation, Inc.
ko: ÀúÀÛ±Ç (C) 1995, 1996, 1997 Free Software Foundation, Inc.
sl: Copyright (C) 1988, 1992-1997, 1998 Free Software Foundation, Inc.

source: Written by François Pinard <pinard@iro.umontreal.ca>.
ko: François Pinard <pinard@iro.umontreal.ca>°¡ ¸¸µé¾ú½À´Ï´Ù.
sl: Avtor François Pinard <pinard@iro.umontreal.ca>.

source: (core dumped)
ko: (ÄÚ¾î Ãâ·ÂµÊ)

source: Cannot stat %s
ko: %s¸¦ statÇÒ ¼ö ¾ø½À´Ï´Ù
