0x3150000 NFS_vfsop_init
0x3150004 NFS_vfsop_mount
0x3150008 NFS_vfsop_unmount
0x315000c NFS_vfsop_root
0x3150010 NFS_vfsop_getattr
0x3150014 NFS_vfsop_sync
0x3150018 NFS_vfsop_sysctl
0x3150040 NFS_vnop_lookup
0x3150044 NFS_vnop_open
0x3150048 NFS_vnop_close
0x315004c NFS_vnop_access
0x3150050 NFS_vnop_setattr
0x3150054 NFS_vnop_read
0x3150058 NFS_vnop_write
0x315005c NFS_vnop_ioctl
0x3150060 NFS_vnop_mmap
0x3150064 NFS_vnop_mmap_check
0x3150068 NFS_vnop_mnomap
0x315006c NFS_vnop_fsync
0x3150070 NFS_vnop_remove
0x3150074 NFS_vnop_rename
0x3150078 NFS_vnop_readdir
0x315007c NFS_vnop_readlink
0x3150080 NFS_vnop_inactive
0x3150084 NFS_vnop_reclaim
0x3150088 NFS_vnop_pathconf
0x315008c NFS_vnop_advlock
0x3150090 NFS_vnop_pagein
0x3150094 NFS_vnop_pageout
0x3150098 NFS_vnop_blktooff
0x315009c NFS_vnop_offtoblk
0x31500a0 NFS_vnop_monitor
0x3150100 NFS_vnop3_create
0x3150104 NFS_vnop3_mknod
0x3150108 NFS_vnop3_getattr
0x315010c NFS_vnop3_link
0x3150110 NFS_vnop3_mkdir
0x3150114 NFS_vnop3_rmdir
0x3150118 NFS_vnop3_symlink
0x3150200 NFS_vnop4_create
0x3150204 NFS_vnop4_mknod
0x3150208 NFS_vnop4_getattr
0x315020c NFS_vnop4_link
0x3150210 NFS_vnop4_mkdir
0x3150214 NFS_vnop4_rmdir
0x3150218 NFS_vnop4_symlink
0x315021c NFS_vnop4_getxattr
0x3150220 NFS_vnop4_setxattr
0x3150224 NFS_vnop4_removexattr
0x3150228 NFS_vnop4_listxattr
0x315022c NFS_vnop4_getnamedstream
0x3150230 NFS_vnop4_makenamedstream
0x3150234 NFS_vnop4_removenamedstream
0x3150280 NFS_bio_upl_setup
0x3150284 NFS_bio_upl_check
0x3150288 NFS_bio_page_inval
0x315028c NFS_bio_buf_freeup
0x3150290 NFS_bio_buf_incore
0x3150294 NFS_bio_buf_map
0x3150298 NFS_bio_buf_get
0x315029c NFS_bio_buf_release
0x31502a0 NFS_bio_buf_iowait
0x31502a4 NFS_bio_buf_iodone
0x31502a8 NFS_bio_buf_write_delayed
0x31502ac NFS_bio_buf_read
0x31502b0 NFS_bio_buf_write
0x31502b4 NFS_bio_buf_flush_commits
0x31502b8 NFS_bio_buf_flush
0x31502bc NFS_bio_buf_vinvalbuf
0x31502c0 NFS_bio_buf_vinvalbuf2
0x31502c4 NFS_bio_buf_asyncio_finish
0x3150300 NFS_op_loadattrcache
0x3150304 NFS_op_getattrcache
0x3150308 NFS_op_req_match_reply
0x315030c NFS_op_req_finish
0x3150310 NFS_op_req_2
0x3150314 NFS_op_req_gss
0x3150318 NFS_op_req_async
0x315031c NFS_op_req_async_finish
0x3150320 NFS_op_req_async_cancel
0x3150324 NFS_op_soft_term
0x3150328 NFS_op_nget
0x315032c NFS_op_node_lock
0x3150330 NFS_op_node_unlock
0x3150334 NFS_op_data_lock
0x3150338 NFS_op_data_unlock
0x315033c NFS_op_data_update_size
0x3150340 NFS_op_rpc_commit_v3
0x3150344 NFS_op_rpc_commit_v4
0x3150348 NFS_op_rpc_read
0x315034c NFS_op_rpc_write2
0x3150350 NFS_op_getattr_internal
0x3150354 NFS_op_silly_rename
0x3150358 NFS_op_data_lock_stoe
0x315035c NFS_op_data_lock_etos
