Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Normally, Mailman sends the regular delivery messages to the mail server in batches. This is much more efficent because it reduces the amount of traffic between Mailman and the mail server. <p>However, some lists can benefit from a more personalized approach. In this case, Mailman crafts a new message for each member on the regular delivery list. Turning this feature on may degrade the performance of your site, so you need to carefully consider whether the trade-off is worth it, or whether there are other ways to accomplish what you want. You should also carefully monitor your system load to make sure it is acceptable. <p>Select <em>No</em> to disable personalization and send messages to the members in batches. Select <em>Yes</em> to personalize deliveries and allow additional substitution variables in message headers and footers (see below). In addition, by selecting <em>Full Personalization</em>, the <code>To</code> header of posted messages will be modified to include the member's address instead of the list's posting address. <p>When personalization is enabled, a few more expansion variables that can be included in the <a href="?VARHELP=nondigest/msg_header">message header</a> and <a href="?VARHELP=nondigest/msg_footer">message footer</a>. <p>These additional substitution variables will be available for your headers and footers, when this feature is enabled: <ul><li><b>user_address</b> - The address of the user, coerced to lower case. <li><b>user_delivered_to</b> - The case-preserved address that the user is subscribed with. <li><b>user_password</b> - The user's password. <li><b>user_name</b> - The user's full name. <li><b>user_optionsurl</b> - The url to the user's option page. </ul>
hr: Normalno, Mailman ¹alje ispravne poruke mail serveru u odreðenim batch procesima. Ovo je mnogo vi¹e korisno, zato ¹to smanjuje kolièinu prometa izmeðu Mailmana i mail servera. <p>Ipak, neke liste mogu imati koristi sa vi¹e personaliziranim pristupom. U tom sluèaju, Mailman sastavlja novu poruku za svakog èlana regularne liste za dostavu. Ukljuèivanjem ove postavke mo¾e umanjiti performanse va¹eg raèunala, pa trebate pa¾ljivo razmotriti da li se to isplati ili postoje drugi naèini da biste postigli ono ¹to ¾elite. Takoðer bi trebali pa¾ljivo nadgledati optereæenje svoga sistema, da biste bili sigurni da je ono prihvatljivo. <p>Izaberite <em>Ne</em> da biste onemoguæili personalizaciju i poslali èlanovima poruke u batchu. Izaberite <em>Da</em> da biste personalizirali dostave i dozvolili dodatne zamjene varijabli u zaglavljima i podno¾jima poruke (pogledajte dole). Dodatno, izborom <em>Cjelokupna Personalizacija</em>, <code>To</code> zaglavlje poslane poruke æe biti promjenjeno tako da ukljuèuje adresu èlana, umjesto adresu liste. <p>Kada je personalizacija omoguæena, jo¹ nekoliko dodatnih varijabli variables koje mogu biti ukljuèene u <a href="?VARHELP=nondigest/msg_header">zaglavlje poruke</a> and <a href="?VARHELP=nondigest/msg_footer">podno¾je poruke</a>. <p>Ove dodatne, zamjenske varijable æe biti dostupne za va¹a zaglavlja i podno¾ja, kada je ova postavka omoguæena: <ul><li><b>korisnièka_adresa</b> - Adresa korisnika, zbijena u mala slova. <li><b>dostava_za_korisnika</b> - Adresa u kojoj su saèuvana velika i mala slova, preko koje je korisnik pretplaæen. <li><b>korisnièka_lozinka</b> - Lozinka korisnika. <li><b>korisnièko_ime</b> - Puno ime korisnika. <li><b>korisnièki_opcijeurl</b> - URL za stranicu sa korisnièkim opcijama. </ul>

source: None - no verification steps (<em>Not Recommended </em>)<br> Confirm (*) - email confirmation step required <br> Require approval - require list administrator Approval for subscriptions <br> Confirm and approve - both confirm and approve <p>(*) when someone requests a subscription, Mailman sends them a notice with a unique subscription request number that they must reply to in order to subscribe.<br> This prevents mischievous (or malicious) people from creating subscriptions for others without their consent.
hr: Nijedan - nema provjere (<em>Nije Preporuèeno </em>)<br> Potvrdi (*) - potrebno je potvrditi e-mail <br> Treba odobrenje - treba Odobrenje za pretplatu administratora liste <br> Potvrdi i odobri - obadvoje potrdi i odobri <p>(*) kada netko ¹alje zahtjev za pretplatom, Mailman mu ¹alje obavijest sa jedinstvenim brojem pretplatnièkog zahtjeva na koji on mora odgovoriti da bi se pretplatio.<br> Ovo sprjeèava zlonamjerne osobe od kreiranja pretplata za druge, bez njihovog pristanka.

source: Mar
hr: O¾u
