Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Each list member has a <em>moderation flag</em> which says whether messages from the list member can be posted directly to the list, or must first be approved by the list moderator. When the moderation flag is turned on, list member postings must be approved first. You, the list administrator can decide whether a specific individual's postings will be moderated or not. <p>When a new member is subscribed, their initial moderation flag takes its value from this option. Turn this option off to accept member postings by default. Turn this option on to, by default, moderate member postings first. You can always manually set an individual member's moderation bit by using the <a href="%(adminurl)s/members">membership management screens</a>.
hr: Svaki èlan liste ima <em>moderacijsku zastavicu</em> koja oznaèava mogu li poruke èlanova liste biti poslane izravno na listu ili ih prvo mora odobriti moderator liste. Kada je moderacijska zastavica ukljuèena, poruke koje su poslali èlanovi na listi, moraju prvo biti odobrene. Vi, kao administrator liste, mo¾ete odluèiti da li æe posebne, individualne poruke biti moderirane ili neæe. <p>Kada je pretplaæen novi èlan, vrijednost njegove poèetne moderacijske zastavice postaje jednaka ovoj moguænosti. Iskljuèite navedenu opciju da biste primali èlanske poruke. Ukljuèite je, da biste prvo moderirali èlanske poruke. Uvijek mo¾ete ruèno postaviti individualni moderacijski bit koristeæi <a href="%(adminurl)s/members">Èlanski management ekran</a>.
ro: Fiecare membru abonal al listei are un <em>fanion de moderare</em> care indicã dacã mesajele de la acest abonat pot fi publicate direct pe listã, sau trebuie mai întâi aprobate de moderatorul listei. Atunci când fanionul de moderare este activat, mesajele trimise spre publicare trebuie mai întâi aprobate. Dumnevoastrã, în calitate de administrator, puteþi decide dacã mesajele unui anumit abonat sã fie moderate sau nu. <p>Când un nou membru se aboneazã, starea iniþialã a fanionului sãu de moderare ia valoarea acestei opþiuni. Dezactivaþi aceastã opþiune pentru a accepta implicit mesajele noilor abonaþi. Activaþi aceastã opþiune pentru a modera implicit primele mesaje ale noilor abonaþi. Veþi putea seta oricând manual fanionul de moderare pentru fiecare abonat în parte, folosind <a href="%(adminurl)s/members">paginile de administrare ale abonamentelor</a>.
tr: Her üyenin bir <em>moderatör onay ayarý</em> vardýr ve bu ayara göre üyenin mesajýnýn listeye doðrudan mý gönderileceðine yoksa önce moderatör onayýndan mý geçeceðine karar verilir. Moderatör onay ayarý açýksa, üye mesajlarýnýn önce onaydan geçmesi gerekir. Siz, liste yöneticisi olarak her bir kiþinin mesajlarýnýn moderatör onayýndan geçip geçmeyeceðine karar verebilirsiniz. <p>Yeni bir kiþi listeye üye olduðunda, baþlangýç moderatör onay ayarý, deðerini bu seçenekten alýr. Bu seçeneði kapatarak yeni üye mesajlarýnýn varsayýlan olarak kendiliðinden onaylanmasýný saðlayabilirsiniz. Bu seçeneði açarak yeni üye mesajlarýnýn varsayýlan olarak moderatör onayýndan geçmesini saðlayabilirsiniz. Her zaman kiþilerin ayrý ayrý moderatör onay ayarlarýný <a href="%(adminurl)s/members">üyelik yönetimi sayfalarýnda</a> yapabilirsiniz.

source: Action to take when a moderated member posts to the list.
hr: Akcija koja æe se poduzeti kada moderirani èlan po¹alje poruku na listu.
ro: Acþiunea de urmat când un membru supravegheat (moderat) trimite un mesaj listei.
tr: Moderatör onay ayarý açýk bir üye listeye mesaj gönderdiðinde uygulanacak eylem.

source: <ul><li><b>Hold</b> -- this holds the message for approval by the list moderators. <p><li><b>Reject</b> -- this automatically rejects the message by sending a bounce notice to the post's author. The text of the bounce notice can be <a href="?VARHELP=privacy/sender/member_moderation_notice" >configured by you</a>. <p><li><b>Discard</b> -- this simply discards the message, with no notice sent to the post's author. </ul>
hr: <ul><li><b>Zadr¾i</b> -- zadr¾ava poruku za odobrenje moderatora liste. <p><li><b>Odbij</b> -- automatski odbija poruku slanjem odbijene obavijesti autoru poruke. Tekst odbijene obavijesti mo¾ete i sami <a href="?VARHELP=privacy/sender/member_moderation_notice" >napisati</a>. <p><li><b>Odbaci</b> -- odbacuje poruku bez obavijesti namijenjene autoru poruke. </ul>
ro: <ul><li><b>Hold</b> -- reþine mesajul pentru aprobare de cãtre moderatorii listei. <p><li><b>Reject</b> -- respinge automat orice mesaj primit, prin trimiterea unei notificãri de eºec (bounce) la expeditor. Textul notificãrii poate fi <a href="?VARHELP=privacy/sender/member_moderation_notice">configurat de dumneavoastrã</a>. <p><li><b>Discard</b> -- aceastã opþiune ignorã pur ºi simplu mesajul, fãrã a trimite vreo notificare la expeditor. </ul>
tr: <ul><li><b>Beklet</b> -- bu, mesajý liste moderatörlerinin onayýndan geçmesi için bekletir. <p><li><b>Reddet</b> -- bu, mesajý otomatik olarak reddederek mesaj göndericisine bir geri dönüþ bildirimi gönderir. Geri dönüþ bildiriminin içeriði, <a href="?VARHELP=privacy/sender/member_moderation_notice" >sizin tarafýnýzdan yapýlandýrýlabilir.</a>. <p><li><b>Gözardý Et</b> -- bu, basitçe mesajý gözardý eder ve mesaj göndericisine herhangi bir bildirim göndermez. </ul>

source: Text to include in any <a href="?VARHELP/privacy/sender/member_moderation_action" >rejection notice</a> to be sent to moderated members who post to this list.
hr: Tekst koji æe biti ukljuèen u svaku <a href="?VARHELP/privacy/sender/member_moderation_action" >obavijest o odbijanju</a> a treba biti poslan moderiranim èlanovima koji ¹alju poruke na listu.
ro: Textul ce este inclus în orice <a href="?VARHELP/privacy/sender/member_moderation_action" >notã de respingere</a> trimisã membrilor supravegheaþi ce publicã mesaje pe acestã listã.
tr: Bu listeye mesaj gönderip reddedilen tüm üyelere gönderilen <a href="?VARHELP/privacy/sender/member_moderation_action" >reddetme bildirimlerine</a> eklenecek yazý.

source: Non-member filters
hr: Ne-èlanski filteri
ro: Filtre pentru non-membrii
tr: Üye olmayan kiþi filtreleri

source: List of non-member addresses whose postings should be automatically accepted.
hr: Lista ne-èlanskih adresa èije bi poruke trebale biti automatski prihvaæene.
ro: Lista adreselor care nu sunt abonate, dar ale cãror mesaje sunt automat acceptate.
tr: Mesajlarý otomatik olarak onaylanacak üye olmayan kiþi adreslerinin listesi.

source: List of non-member addresses whose postings will be immediately held for moderation.
hr: Lista ne-èlanskih adresa èije æe poruke biti odmah zadr¾ane za moderaciju.
ro: Lista adreselor care nu sunt abonate, ale cãror mesaje vor fi reþinute imediat pentru verificare.
tr: Mesajlarý hemen moderatör onayý için bekletilecek üye olmayan kiþi adreslerinin listesi.

source: Postings from any of these non-members will be immediately and automatically held for moderation by the list moderators. The sender will receive a notification message which will allow them to cancel their held message. Add member addresses one per line; start the line with a ^ character to designate a regular expression match.
hr: Poruke koje su poslale osobe koje nisu èlanovi liste bit æe automatski zadr¾ane za moderaciju od strane moderatora liste. Po¹iljatelji æe primiti poruku koja æe im omoguæiti da zanemare njihovu zadr¾anu poruku. Dodajte po liniji jednu èlansku adresu; zapoènite liniju sa znakom ^ da biste koristili regular expression poredbu.
ro: Mesajele de la oricare din aceºti expeditori non-membri vor fi imediat reþinute pentru aprobare de cãtre moderatorii listei. Expeditorul va primi un mesaj de notificare, care îi va permite sã anuleze mesajul reþinut. Adãugaþi adresele câte una pe rând, folosind caracterul ^ pentru a desemna o expresie regulatã.
tr: Bu üye olmayan kiþilerden gelecek tüm mesajlar hemen moderatör onayý için beklemeye alýnacaktýr. Gönderici, bekleyen mesajýndan vazgeçebilmesine olanak saðlayan bir bildirim mesajý alýr. Her satýra bir adres olacak þekilde ekleyin, bir ^ karakteri ile baþlayarak bir regular expression eþleþmesi belirleyebilirsiniz.

source: List of non-member addresses whose postings will be automatically rejected.
hr: Lista ne-èlanskih adresa èije æe poruke biti automatski odbijene.
ro: Lista adreselor care nu sunt abonate, ale cãror mesaje vor fi automat respinse.
tr: Mesajlarý otomatik olarak reddedilecek üye olmayan kiþi adreslerinin listesi.

source: Postings from any of these non-members will be automatically rejected. In other words, their messages will be bounced back to the sender with a notification of automatic rejection. This option is not appropriate for known spam senders; their messages should be <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >automatically discarded</a>. <p>Add member addresses one per line; start the line with a ^ character to designate a regular expression match.
hr: Poruke koje su poslale osobe koje nisu èlanovi liste bit æe automatski odbijene. Drugim rijeèima, njihove æe poruke biti vraæene po¹iljateljima s automatski generiranom obavijesti o odbijanju. Ova opcija nije pogodna za poznate spammere; njihove poruke bi trebale biti <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >automatski odbaèene</a>. <p>Dodajte po liniji jednu èlansku adresu; zapoènite liniju sa znakom ^ da biste koristili regular expression poredbu.
ro: Mesajele trimise de oricare dintre aceºti non-membri vor fi automat respinse. Cu alte cuvinte, mesajele lor vor fi returnate expeditorului, cu o notificare a respingerii automate. Aceastã opþiune nu este cea mai potrivitã în cazul spammerilor recunoscuþi, în cazul lor mesajele trebuind <a href="?VARHELP=privacy/sender/discard_these_nonmembers">ignorate automat</a>. <p>Adãugaþi adresele câte una pe linie; începeþi fiecare linie cu un caracter <strong>^</strong> pentru a desemna o expresie regulatã</p>.
tr: Bu üye olmayan kiþilerden gelecek tüm mesajlar otomatik olarak reddedilecektir, Baþka bir deyiþle, mesajlarý bir otomatik reddetme bildirimi ile beraber kendilerine geri dönecektir. Bu seçenek bilinen spam göndericileri için uygun deðildir, bu kiþilerin mesajlarý <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >otomatik olarak gözardý edilmelidir</a>. <p>Her satýra bir adres olacak þekilde ekleyin, bir ^ karakteri ile baþlayarak bir regular expression eþleþmesi belirleyebilirsiniz.

source: List of non-member addresses whose postings will be automatically discarded.
hr: Lista ne-èlanskih adresa èije æe poruke automatski biti odbaèene.
ro: Lista adreselor ne-abonateale cãror mesajevor fi automat ignorate.
tr: Mesajlarý otomatik olarak gözardý edilecek üye olmayan kiþi adreslerinin listesi.

source: Postings from any of these non-members will be automatically discarded. That is, the message will be thrown away with no further processing or notification. The sender will not receive a notification or a bounce, however the list moderators can optionally <a href="?VARHELP=privacy/sender/forward_auto_discards" >receive copies of auto-discarded messages.</a>. <p>Add member addresses one per line; start the line with a ^ character to designate a regular expression match.
hr: Poruke koje su poslale osobe koje nisu èlanovi liste bit æe automatski odbaèene. To znaèi da æe poruke biti uni¹tene bez daljnje obrade iste. Po¹iljatelji neæe primiti obavijest, meðutim moderatori liste mogu opcionalno <a href="?VARHELP=privacy/sender/forward_auto_discards" >primiti kopije automatski odbaèenih poruka</a>. <p>Dodajte po liniji jednu èlansku adresu; zapoènite liniju sa znakom ^ da biste koristili regular expression poredbu.
ro: Mesajele trimise de oricare dintre aceºti non-membri vor fi automat ignorate. Cu alte cuvinte, mesajele vor fi ºterse fãrã nici o procesare sau notificare ulterioarã. Deºi expeditorul nu va primi nici o notificare sau vreun mesaj returnat, moderatorii listei au opþiunea de a <a href="?VARHELP=privacy/sender/forward_auto_discards">primi copii ale mesajelor auto-ignorate</a>. <p>Adãugaþi adresele câte una pe linie; începeþi fiecare linie cu un caracter <strong>^</strong> pentru a desemna o expresie regulatã</p>.
tr: Bu üye olmayan kiþilerden gelecek tüm mesajlar otomatik olarak gözardý edilecektir. Yani mesaj daha ileri bir iþleme veya bir bildirim olmaksýzýn silinecektir. Gönderici bir bildirim veya geri dönüþ almayacaktýr, ancak liste moderatörleri ayrýca <a href="?VARHELP=privacy/sender/forward_auto_discards" >otomatik olarak gözardý edilmiþ mesajlarýn bir kopyasýný alabilir.</a>. <p>Her satýra bir adres olacak þekilde ekleyin, bir ^ karakteri ile baþlayarak bir regular expression eþleþmesi belirleyebilirsiniz.

source: Action to take for postings from non-members for which no explicit action is defined.
hr: Akcija koja æe se poduzeti za poruke ne-èlanova za koju nije eksplicitno definirana nikakva radnja.
ro: Acþiunea de urmat în cazul mesajelor trimise de neabonaþi, pentru care nu este definitã o acþiune explicitã.
tr: Mesajlarý için açýkça bir eylem tanýmlanmamýþ üye olmayan kiþilerin gönderdiði mesajlar için uygulanacak eylem.

source: When a post from a non-member is received, the message's sender is matched against the list of explicitly <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >accepted</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">held</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >rejected</a> (bounced), and <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >discarded</a> addresses. If no match is found, then this action is taken.
hr: Kada je poruka primljena od osbe koja nije èlan liste, po¹iljatelj iste se usporeðuje s adresama koje mogu biti <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >prihvaæene</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">zadr¾ane</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >odbijene</a> (bounced) i <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >odbaèene</a>. Ako nije pronaðena nijedna koja odgovara, tada se poduzima ova akcija.
ro: Când este recepþionat un mesaj de la un expeditor neabonat, adresa expeditorului este comparatã cu adresele din listele adreselor explicit <a href="?VARHELP=privacy/sender/accept_these_nonmembers">acceptate</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">reþinute</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers">respinse</a> (bounced), ºi respectiv <a href="?VARHELP=privacy/sender/discard_these_nonmembers">ignorate</a>. Dacã nu este gãsitã nici o corespondenþã, atunci este aplicatã aceastã acþiune.
tr: Üye olmayan bir kiþiden bir mesaj alýndýðýnda, mesaj göndericisi açýkça <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >onaylanan</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">bekletilen</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >reddedilen</a> (geri döndürülen) ve <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >gözardý edilen</a> addresler listeleri ile karþýlaþtýrýlýr. Bu listelerle herhangi bir eþleþme olmazsa, bu eylem uygulanýr.

source: Should messages from non-members, which are automatically discarded, be forwarded to the list moderator?
hr: Trebaju li poruke ne-èlanova, koje su automatski odbaèene biti proslijeðene moderatoru liste?
ro: Sã trimit moderatorior listei o copie a mesajelor de la expeditori neabonaþi, care sunt automat ignorate?
tr: Üye olmayan kiþilerden gelen ve otomatik olarak gözardý edilen mesajlar liste moderatörüne iletilsin mi?

source: This section allows you to configure various filters based on the recipient of the message.
hr: Ova sekcija vam omoguæava da konfigurirate razlièite filtere koji su temeljeni na primatelju poruke.
ro: Aceastã secþiune vã permite configurarea diverselor filtre bazate pe analiza recipientului mesajului.
tr: Bu bölüm mesajýn alýcýsýna dayanan çeþitli filtreler yapýlandýrmanýzý saðlar.

source: Recipient filters
hr: Primateljevi filteri
ro: Filtre pentru recipiente
tr: Alýcý filtreleri

source: Must posts have list named in destination (to, cc) field (or be among the acceptable alias names, specified below)?
hr: Moraju li poruke imati naziv liste u (to, cc) poljima (ili trebaju biti meðu prihvatljivim imenima aliasa, koji su dolje navedeni)?
ro: Trebuie mesajele sã aibã adresa listei la destinatar (câmpurile to, cc), sau sã fie printre alias-urile acceptate, specificate mai jos ?
tr: Mesajlarýn giden (alýcý, cc) ananýnda liste adresi olmalý mý (veya aþaðýda belirlenecek kabul edilebilir takma adlar)?

source: Alias names (regexps) which qualify as explicit to or cc destination names for this list.
hr: Nazivi aliasa (regexpovi) koji predstavljaju eksplicitne to ili cc odredi¹ne nazive za ovu listu.
ro: Aliasurile (regexp) calificate ca ºi destinaþii explicite în câmpurile to sau cc pentru aceastã listã.
tr: Bu liste için alýcý veya cc alanlarýnda bulunabilecek takma adlar (regexp).

source: Alternate addresses that are acceptable when `require_explicit_destination' is enabled. This option takes a list of regular expressions, one per line, which is matched against every recipient address in the message. The matching is performed with Python's re.match() function, meaning they are anchored to the start of the string. <p>For backwards compatibility with Mailman 1.1, if the regexp does not contain an `@', then the pattern is matched against just the local part of the recipient address. If that match fails, or if the pattern does contain an `@', then the pattern is matched against the entire recipient address. <p>Matching against the local part is deprecated; in a future release, the pattern will always be matched against the entire recipient address.
hr: Alternativne adrese koje su prihvatljive kada je omoguæeno `zahtjevaj_eksplicitno_odredi¹te'. Ova opcija uzima listu regular expressiona, jednog po liniji, koji se usporeðuje sa svakom adresom primatelja u poruci. Usporeðivanje se vr¹i s Pythonovom re.match() funkcijom, ¹to znaèi da su povezani na poèetak teksta. <p>Za kompatibilnost prema dole s Mailmanom 1.1, ako regexp ne sadr¾i `@', onda se uzorak usporeðuje sa samo lokalnim dijelom primateljeve adrese. Ako usporedba ne uspije ili ako uzorak ne sadr¾i `@', usporeðuje se s cjelokupnom adresom primatelja. <p>Usporeðivanje s lokalnim dijelom nije ba¹ najbolje; u buduæim inaèicama, uzorak æe se uvijek usporeðivati s cjelokupnom adresom primatelja.
ro: Adresele alternative acceptate atunci când este activat parametrul 'require_explicit_destination'. Aceastã opþiune ia lista expresiilor regulate, câte una pe linie, ºi o comparã cu fiecare recipient din lista de adrese a mesajului. Compararea se face folosind funcþia Python re.match(), însemnând cã cele douã expresii sunt verificate de la începutul stringului. <p>Pentru a asigura compatibilitatea cu versiunile anterioare (Mailman 1.1), dacã regexp-ul nu conþine un caracter '@', atunci ºablonul este comparat doar cu partea localã a adresei recipientului. Dacã aceastã comparare eºueazã, sau dacã ºablonul conþine un '@', atunci ºablonul este comparat cu întreaga adresã a recipientului.</p> <p>Compararea cu segmentul local al adresei este depreciat, ºi în versiunile viitoare compararea se va face întotdeauna cu întreaga adresã a recipientului.</p>
tr: `require_explicit_destination' seçeneði etkinken kabul edilecek diðer adresler. Bu seçenek her satýrda bir regular expression listesi alýr ve mesajdaki her alýcý adresi ile karþýlaþtýrýr. Karþýlaþtýrma Python'un re.match() iþlevi ile yapýlýr. Yani dizginin baþýna baðlanýrlar. <p>Mailman 1.1 ile geriye dönük uyumluluk için, eðer regexp bir `@' iþareti içermiyorsa, bu durumda desen, alýcý adresinin sadece yerel bölümü ile karþýlaþtýrýlýr. Bir eþleþme olmazsa veya desen bir `@' iþareti içeriyorsa, desen tüm alýcý adresi ile karþýlaþtýrýlýr. <p>Yerel bölüm ile karþýlaþtýrma eskimiþ durumdadýr, gelecekteki bir sürümde desen her zaman tüm alýcý adresi ile karþýlaþtýrýlmaya baþlanacaktýr.

source: Ceiling on acceptable number of recipients for a posting.
hr: Prag prihvatljivog broja primatelja poruke.
ro: Limita maximã a recipientelor acceptate pentru un mesaj.
tr: Bir mesajdaki kabul edilebilir en fazla alýcý sayýsý

source: If a posting has this number, or more, of recipients, it is held for admin approval. Use 0 for no ceiling.
hr: Ako poruka ima ovaj ili veæi broj primatelja zadr¾ana je za administratorsko odobrenje. Koristite 0 ako ne ¾elite prag.
ro: Dacã un mesaj are acest numãr, sau mai multe, de destinatari, este reþinut pentru aprobare. Folosiþi valoarea 0 dacã nu doriþi prag limitã.
tr: Bir mesaj bu veya bundan fazla sayýda alýcý içeriyorsa yönetici onayý için bekletilir. Herhangi bir kýsýtlama olmamasý için 0 kullanýn.

source: This section allows you to configure various anti-spam filters posting filters, which can help reduce the amount of spam your list members end up receiving.
hr: Ova sekcija vam omoguæava da konfigurirate razlièite antispam filtere, koji mogu pomoæi da smanjite kolièinu spama kojeg primaju va¹i èlanovi liste.
ro: Aceastã secþiune permite configurarea diverselor filtre anti-spam, care pot reduce drastic mesajele nedorite primite de membrii listei.
tr: Bu bölüm, çeþitli anti-spam filtreleri yapýlandýrarak liste üyelerinizin alacaðý spam sayýsýný azaltmanýzý saðlar.

source: Header filters
hr: Filteri zaglavlja
ro: Filtre header
tr: Baþlýk filtreleri

source: Filter rules to match against the headers of a message.
hr: Pravila filtera koja se usporeðuju sa zaglavljima poruke.
ro: Cuvintele cheie ale topicii, câte unul pe linie, care trebuie cãutate în fiecare mesaj.
tr: Bir mesajýn baþlýklarýyla eþleþtirilecek filtre kurallarý

source: Legacy anti-spam filters
hr: Anti-Spam filteri
ro: Filtre anti-SPAM moºtenite
tr: Kalýcý anti-spam filtreleri

source: Hold posts with header value matching a specified regexp.
hr: Zadr¾i poruke kojima se zaglavlje podudara s navedenim regexp izrazom.
ro: Reþine mesajele ale cãror header se potriveºte cu o expresie regulatã (regexp) specificatã.
tr: Belirtilen bir regexp ile baþlýk deðeri eþleþen ve bekletilecek mesajlar.
