Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Clone a member address. Cloning a member address means that a new member will be added who has all the same options and passwords as the original member address. Note that this operation is fairly trusting of the user who runs it -- it does no verification to the new address, it does not send out a welcome message, etc. The existing member's subscription is usually not modified in any way. If you want to remove the old address, use the -r flag. If you also want to change any list admin addresses, use the -a flag. Usage: clone_member [options] fromoldaddr tonewaddr Where: --listname=listname -l listname Check and modify only the named mailing lists. If -l is not given, then all mailing lists are scanned from the address. Multiple -l options can be supplied. --remove -r Remove the old address from the mailing list after it's been cloned. --admin -a Scan the list admin addresses for the old address, and clone or change them too. --quiet -q Do the modifications quietly. --nomodify -n Print what would be done, but don't actually do it. Inhibits the --quiet flag. --help -h Print this help message and exit. fromoldaddr (`from old address') is the old address of the user. tonewaddr (`to new address') is the new address of the user.
ro: Cloneazã o adresã abonatã. Clonarea unei adrese abonate înseamnã cã va fi creat un nou abonament, ce are toate opþiunile ºi parolele de acces ca ºi abonamentul original. Notaþi cã aceastã operaþiune presupune foartã multã încrederedin partea celui ce o ruleazã -- nu verificã noua adresã, nu trimite nici un mesaj de bun venit, etc. De obicei, abonamentul original nu este modificat în nici o formã. Dacã doriþi sã ºtergeþi vechea adresã, folosiþi fanionul -r. Dacã de asemenea, doriþi sã modificaþi oricare din adresele administrative ale listei, folosiþi fanionul -a. Folosire: clone_member [opþiuni] adresaveche adresanoua Unde: --listname=numelistã -l numelistã Verificã ºi modificã numai listele date. Dacã opþiunea -l nu este specificatã, atunci sunt scanate toate listele de discuþii în cãutarea adresei date. Puteþi scrie mai multe opþiuni -l. --remove -r ªterge vechea adresã din lista de discuþii, dupã clonare. --admin -a Parcuge lista adreselor administrative ºi dacã gãseºte adresele vechi, le cloneazã sau le modificã ºi pe acestea. --quiet -q Face modificãrile în liniºte, fãrã a afiºa date de stare. --nomodify -n Simuleazã modificãrile, afiºând ceea ce va fi modificat. Aceastã opþiune inhibã fanionul --quiet. --help -h Afiºeazã acest mesaj de ajutor ºi terminã execuþia programului. adresaveche este vechea adresã a abonatului adresanouã este noua adresã a abonatului.

source: processing mailing list:
ro: procesez lista:

source: scanning list owners:
ro: caut proprietarii listei:

source: new list owners:
ro: noii proprietari ai listei:

source: (no change)
ro: (fãrã modificãri)

source: address not found:
ro: adresa nu a fost gãsitã:

source: clone address added:
ro: adresa clonã a fost adãugatã:

source: clone address is already a member:
ro: adresa clonã este deja înregistratã ca membru:

source: original address removed:
ro: adresa originalã a fost ºtearsã:

source: Not a valid email address: %(toaddr)s
ro: Adresã de email invalidã: %(toaddr)s

source: Error opening list "%(listname)s", skipping. %(e)s
ro: Eroare la deschiderea listei "%(listname)s", sar mai departe.. %(e)s

source: options
ro: opþiuni

source: legal values are:
ro: valorile permise sunt:

source: attribute "%(k)s" ignored
ro: atributul "%(k)s" a fost ignorat

source: attribute "%(k)s" changed
ro: atributul "%(k)s" a fost modificat

source: Non-standard property restored: %(k)s
ro: Proprietatea non-standard a fost restauratã: %(k)s

source: Invalid value for property: %(k)s
ro: Valoare invalidã pentru proprietatea: %(k)s

source: Bad email address for option %(k)s: %(v)s
ro: Adresã de email invalidã pentru opþiunea %(k)s: %(v)s

source: Only one of -i or -o is allowed
ro: Doar unul din parametri -i sau -o este permis

source: One of -i or -o is required
ro: Unul din parametri -i sau -o este necesar

source: List name is required
ro: Numele listei este obligatoriu

source: Convert a list's interpolation strings from %-strings to $-strings. This script is intended to be run as a bin/withlist script, i.e. % bin/withlist -l -r convert <mylist>
ro: Converteºte stringurile de interpolare ale unei liste de la %-strings to $-strings. Acest script trebuie rulat ca un script bin/withlist, astfel: % bin/withlist -l -r convert <mylist>

source: Saving list
ro: Salvez lista

source: Discard held messages. Usage: discard [options] file ... Options: --help / -h Print this help message and exit. --quiet / -q Don't print status messages.
ro: Ignorã mesajele reþinute. Folosire: discard [opþiuni] fiºier ... Opþiuni: --help / -h Tipãreºte acest mesaj de ajutor ºi iese. --quiet / -q Nu tipãreºte mesajele de stare.

source: Ignoring non-held message: %(f)s
ro: Ignor mesajul ne-reþinut: %(f)s

source: Ignoring held msg w/bad id: %(f)s
ro: Ignor mesajul reþinut cu id eronat: %(f)s

source: Discarded held msg #%(id)s for list %(listname)s
ro: Am aruncat mesajul reþinut: msg #%(id)s pentru lista %(listname)s

source: No filename given.
ro: Lipseºte numele fiºierului.

source: Bad arguments: %(pargs)s
ro: Argumente eronate: %(pargs)s

source: Please specify either -p or -m.
ro: Specificaþi ori -p ori -m

source: Search regular expression required
ro: Expresie regularã de cãutare obligatorie

source: No lists to search
ro: Nu sunt liste de cãutat

source: found in:
ro: gãsit în

source: (as owner)
ro: (ca ºi proprietar)

source: Setting web_page_url to: %(web_page_url)s
ro: Setez web_page_url la valoarea: %(web_page_url)s

source: Setting host_name to: %(mailhost)s
ro: Setez host_name la valoarea: %(mailhost)s

source: Regenerate Mailman specific aliases from scratch. The actual output depends on the value of the `MTA' variable in your mm_cfg.py file. Usage: genaliases [options] Options: -q/--quiet Some MTA output can include more verbose help text. Use this to tone down the verbosity. -h/--help Print this message and exit.
ro: Regenereazã aliasurile specifice Mailman de la zero. Rezultatul actual depinde de valoarea variabilei MTA din fiºierul dumneavoastrã mm_cfg.py. Folosire: genaliases [opþiuni] Opþiuni: -q/--quiet Rezultatele date de unii MTA pot include texte explicative mai detaliate. Folosiþi aceastã comandã pentru a reduce detaliile afiºate. -h/--help Afiºeazã acest mesaj de ajutor ºi terminã execuþia.

source: Bad queue directory: %(qdir)s
ro: Director de coadã eronat: %(qdir)s

source: A list name is required
ro: Un nume de listã este obligatoriu

source: List all the owners of a mailing list. Usage: %(program)s [options] listname ... Where: --all-vhost=vhost -v=vhost List the owners of all the mailing lists for the given virtual host. --all -a List the owners of all the mailing lists on this system. --help -h Print this help message and exit. `listname' is the name of the mailing list to print the owners of. You can have more than one named list on the command line.
ro: Afiºeazã toþi proprietarii unei liste de discuþii. Folosire: %(program)s [opþiuni] numelistã ... Unde: --all-vhost=vhost -v=vhost Afiºeazã toþi proprietarii tuturor listelor pentru adresa virtualã datã. --all -a Afiºeazã toþi proprietarii tuturor listelor de discuþie din acest sistem --help -h Afiºeazã acest mesaj de ajutor ºi terminã execuþia programului. `numelistã' este numele listei de discuþii pentru care doriþi afiºarea proprietarilor. Puteþi avea mai multe nume de liste în linia de comandã.

source: List: %(listname)s, Owners: %(owners)s
ro: Lista: %(listname)s, Posesori: %(owners)s

source: No matching mailing lists found
ro: Nu am gãsit liste de discuþii conforme cererii

source: matching mailing lists found:
ro: liste de discuþii gãsite:

source: Bad --nomail option: %(why)s
ro: Opþiune eronatã --nomail: %(why)s

source: Bad --digest option: %(kind)s
ro: Opþiune eronatã --digest: %(kind)s

source: Could not open file for writing:
ro: Nu am putut deschide fiºierul pentru scriere:

source: PID unreadable in: %(pidfile)s
ro: PID nu poate fi citit în: %(pidfile)s

source: Is qrunner even running?
ro: Dar qrunner funcþioneazã oare?

source: No child with pid: %(pid)s
ro: Nici un copil cu pid: %(pid)s

source: Stale pid file removed.
ro: Fiºierul stale pid a fost ºters.

source: Site list is missing: %(sitelistname)s
ro: Lista site-ului lipseºte: %(sitelistname)s

source: Run this program as root or as the %(name)s user, or use -u.
ro: Rulaþi acest program ca ºi root sau ca ºi userul %(name)s, sau folosiþi parametrul -u.

source: No command given.
ro: Lipseºte comanda.

source: Bad command: %(command)s
ro: Comandã eronatã: %(command)s

source: Warning! You may encounter permission problems.
ro: Atenþie: S-ar putea sã întâmpinaþi probleme la permisiuni.

source: Shutting down Mailman's master qrunner
ro: Opresc total programul principal qrunner al Mailman

source: Restarting Mailman's master qrunner
ro: Restartez programul principal qrunner al Mailman

source: Re-opening all log files
ro: Redeschid toate fiºierele de jurnal (log)

source: Starting Mailman's master qrunner.
ro: Pornesc programul principal qrunner al Mailman

source: list creator
ro: creatorul listei

source: New %(pwdesc)s password:
ro: Noua %(pwdesc)s parolã:

source: Again to confirm password:
ro: Din nou, pentru confirmarea parolei:

source: Passwords do not match; no changes made.
ro: Parolele nu se potrivesc; nu modific nimic.

source: Interrupted...
ro: Întrerupt...

source: Password changed.
ro: Parola a fost schimbatã.

source: Password change failed.
ro: Schimbarea parolei a eºuat.

source: Add a non-fuzzy translation to the dictionary.
ro: Adãugaþi o nouã traducere non-fuzzy în dicþionar

source: Return the generated output.
ro: Returnez ieºirea generatã.

source: Unknown language: %(lang)s
ro: Limbã necunoscutã: %(lang)s

source: Enter the name of the list:
ro: Introduceþi numele listei:

source: Enter the email of the person running the list:
ro: Introduceþi adresa de email a persoanei ce administreazã lista:

source: Initial %(listname)s password:
ro: Parola iniþialã a listei %(listname)s:

source: The list password cannot be empty
ro: Parola listei nu poate fi nulã

source: Hit enter to notify %(listname)s owner...
ro: Apãsaþi enter pentru a notifica proprietarul listei %(listname)s

source: %(name)s runs the %(runnername)s qrunner
ro: %(name)s ruleazã qrunner-ul %(runnername)s

source: All runs all the above qrunners
ro: Toate funcþioneazã peste instanþele qrunners de mai sus.

source: No runner name given.
ro: Lipseºte numele runner-ului.

source: Could not open file for reading: %(filename)s.
ro: Nu am putut deschide fiºierul pentru citire: %(filename)s.

source: Error opening list %(listname)s... skipping.
ro: Eroare la deschiderea listei %(listname)s... trec mai departe.

source: No such member: %(addr)s
ro: Nu existã acest membru: %(addr)s

source: User `%(addr)s' removed from list: %(listname)s.
ro: Utilizatorul '%(addr)s' a fost ºters din lista: %(listname)s.

source: New password for member %(member)40s: %(randompw)s
ro: Noua parolã pentru utilizatorul %(member)40s: %(randompw)s

source: Removing %(msg)s
ro: ªterg %(msg)s

source: %(listname)s %(msg)s not found as %(filename)s
ro: nu am gãsit %(listname)s %(msg)s ca ºi %(filename)s

source: No such list (or list already deleted): %(listname)s
ro: Lista aceata nu existã (sau a fost ºtearsã deja): %(listname)s

source: No such list: %(listname)s. Removing its residual archives.
ro: Nu existã lista: %(listname)s. ªterg arhivele ei reziduale.

source: Not removing archives. Reinvoke with -a to remove them.
ro: Nu ºterg arhivele. Reinvocaþi folosind parametrul -a pentru a le ºterge.

source: list info
ro: info listã

source: stale lock file
ro: fiºier stale lock

source: private archives
ro: arhive private

source: public archives
ro: arhive publice

source: Show the contents of one or more Mailman queue files. Usage: show_qfiles [options] qfile ... Options: -q / --quiet Don't print `helpful' message delimiters. -h / --help Print this text and exit. Example: show_qfiles qfiles/shunt/*.pck
ro: Afiºeazã conþinutul unuia sau mai multor fiºiere queue Mailman. Folosire: show_qfiles [opþiuni] qfile ... Opþiuni: -q / --quiet Nu tipãri delimitatorii de ajutor în mesaj; -h / --help Tipãreºte acest mesaj de ajutor ºi terminã execuþia progrsmului Exeplu: show_qfiles qfiles/shunt/*.pck

source: Synchronize a mailing list's membership with a flat file. This script is useful if you have a Mailman mailing list and a sendmail :include: style list of addresses (also as is used in Majordomo). For every address in the file that does not appear in the mailing list, the address is added. For every address in the mailing list that does not appear in the file, the address is removed. Other options control what happens when an address is added or removed. Usage: %(PROGRAM)s [options] -f file listname Where `options' are: --no-change -n Don't actually make the changes. Instead, print out what would be done to the list. --welcome-msg[=<yes|no>] -w[=<yes|no>] Sets whether or not to send the newly added members a welcome message, overriding whatever the list's `send_welcome_msg' setting is. With -w=yes or -w, the welcome message is sent. With -w=no, no message is sent. --goodbye-msg[=<yes|no>] -g[=<yes|no>] Sets whether or not to send the goodbye message to removed members, overriding whatever the list's `send_goodbye_msg' setting is. With -g=yes or -g, the goodbye message is sent. With -g=no, no message is sent. --digest[=<yes|no>] -d[=<yes|no>] Selects whether to make newly added members receive messages in digests. With -d=yes or -d, they become digest members. With -d=no (or if no -d option given) they are added as regular members. --notifyadmin[=<yes|no>] -a[=<yes|no>] Specifies whether the admin should be notified for each subscription or unsubscription. If you're adding a lot of addresses, you definitely want to turn this off! With -a=yes or -a, the admin is notified. With -a=no, the admin is not notified. With no -a option, the default for the list is used. --file <filename | -> -f <filename | -> This option is required. It specifies the flat file to synchronize against. Email addresses must appear one per line. If filename is `-' then stdin is used. --help -h Print this message. listname Required. This specifies the list to synchronize.
ro: Sincronizeazã lista membrilor unei liste cu un fiºier. Acest script este util când aveþi o listã de discuþii Mailman ºi o listã de adrese în stilul :include: (folosit de asemena ºi în Majordomo). Pentru fiecare adresã din fiºier care nu se regãseºte în lista abonaþilor, aceasta este adãugatã. Pentru fiecare adresã din lista abonaþilor, ºi care nu se regãseºte în fiºier, aceasta este ºtearsã. Alte opþiuni controleazã ce se întâmplã când o adresã nouã este adãugatã sau ºtearsã. Folosire:%(PROGRAM)s [opþiuni] -f fiºier numelistã Unde opþiunile sunt: --no-change -n Nu face nici o modificare; în schimb, afiºeazã ce trebuie modificat în listã. --welcome-msg[=<yes|no>] -w[=<yes|no>] Alege dacã va fi sau nu trimis noilor abonaþi un mesaj de întâmpinare, indiferent de valoarea parametrului listei 'send_welcome_msg'. Folosind -w=yes sau doar -w, mesajul este trimis; folosind -w=no, nu se trimite nici un mesaj. --goodbye-msg[=<yes|no>] -g[=<yes|no>] Alege dacã va fi sau nu trimis un mesaj de rãmas bun celor de pãrãsesc lista, indiferent de valoarea parametrului 'send_goodbye_message'. Folosind -g=yes sau doar -g, mesajul va fi trimis; folosind -g=no, nu se trimite nici un mesaj. --digest[=<yes|no>] -d[=<yes|no>] Alege modul de livrare a mesajelor pentru noii abonaþi. Folosind -d=yes sau doar -d, noii abonaþi vor primi mesajele adunate în volume (digest), iar cu parametrul -d=no (sau dacã opþiunea -d lipseºte) noii abonaþi vor primi mesajele individual. --notofyadmin[=<yes|no>] -a[=<yes|no>] Specificã dacã administratorul listei va fi sau nu notificat pentru fiecare abonare sau pãrãsire a listei. Dacã adãugaþi un numãr foarte mare de adrese, cu siguranþã veþi dori sã dezactivaþi aceastã opþiune! Folosind -a=yes sau doar -a, administratorul este notificat. Dacã nu adãugaþi opþiunea -a, este folositã valoarea implicitã pentru listã. --file <fiºier | -> -f <fiºier | -> Acest parametru este obligatoriu. El specificã fiºierul cu care se va face sincronizarea. Adresele de e-mail trebuie scrise câte una pe linie. Dacã numele fiºierului este '-', atunci este folosit stdin. --help -h Afiºeazã acest mesaj. numelistã Necesar; acesta este numele listei de sincronizat.

source: Bad choice: %(yesno)s
ro: Opþiune eronatã: %(yesno)s

source: Dry run mode
ro: Mod dry run

source: Only one -f switch allowed
ro: Numai parametrul -f este permis

source: No argument to -f given
ro: Lipseºte argumentul pentru parametrul -f

source: Illegal option: %(opt)s
ro: Opþiune ilegalã: %(opt)s

source: No listname given
ro: Lipseºte numele listei

source: Must have a listname and a filename
ro: Trebuie sã aveþi un nume de listã ºi un nume de fiºier

source: Cannot read address file: %(filename)s: %(msg)s
ro: Nu pot citi fiºierul cu adrese: %(filename)s: %(msg)s

source: Ignore : %(addr)30s
ro: Ignor : %(addr)30s

source: You must fix the preceding invalid addresses first.
ro: Trebuie sã corectaþi mai întâi adresa invalidã precedentã.

source: Added : %(s)s
ro: Adãugat : %(s)s

source: Removed: %(s)s
ro: ªters: %(s)s

source: Check a given Mailman translation, making sure that variables and tags referenced in translation are the same variables and tags in the original templates and catalog. Usage: cd $MAILMAN_DIR %(program)s [-q] <lang> Where <lang> is your country code (e.g. 'it' for Italy) and -q is to ask for a brief summary.
ro: Verificã o traducere la Mailman existentã, asigurându-se cã variabilele ºi tag-urile referite în traducere sunt aceleaºi cu cele din versiunea originalã a ºabloanelor ºi catalogului. Folosire: cd $MAILMAN_DIR %(program)s [-q] <lang> Unde <lang> este codul þãrii dumneavoastrã (de ex. 'ro' pentru România), iar parametrul -q este pentru a afiºa un scurt sumar.

source: check a translation comparing with the original string
ro: verific o traducere prin comparare cu stringul original

source: scan a string from the original file
ro: scanez un string din fiºierul original

source: scan a translated string
ro: scanez un string tradus

source: check for differences between checked in and checked out
ro: verific diferenþele dintre intrãri ºi ieºiri

source: parse a .po file extracting msgids and msgstrs
ro: parcurg un fiºier .po ºi extrag msgids ºi msgstrs

source: States table for the finite-states-machine parser: 0 idle 1 filename-or-comment 2 msgid 3 msgstr 4 end
ro: Tabelul de stare pentru parserul finite-states-machine: 0 idle 1 nume de fiºier sau comentariu 2 msgid 3 msgstr 4 sfârºit

source: check a translated template against the original one search also <MM-*> tags if html is not zero
ro: verificã un ºablon tradus prin comparare cu cel original de asemena, cautã tagurile <MM-*> în cazul în care codul HTML nu este nul

source: scan the po file comparing msgids with msgstrs
ro: scanez fiºierul po ºi compar msgids cu msgstrs

source: Perform all necessary upgrades. Usage: %(PROGRAM)s [options] Options: -f/--force Force running the upgrade procedures. Normally, if the version number of the installed Mailman matches the current version number (or a `downgrade' is detected), nothing will be done. -h/--help Print this text and exit. Use this script to help you update to the latest release of Mailman from some previous version. It knows about versions back to 1.0b4 (?).
ro: Executã toate actualizãrile necesare. Folosire: %(PROGRAM)s [opþiuni] Opþiuni: -f/--force Forþeazã rularea procedurilor de actualizare. În mod normal, dacã versiunea instalatã este aceeaºi cu cea curentã (sau dacã încercaþi un downgrade), nu se executã nimic. -h/--help Tipãreºte acest mesaj de ajutor ºi terminã execuþia programului. Folosiþi acest script pentru a vã uºura munca de actualizare a programului Mailman de la o versiune anterioarã. ªtie sã acualizeze de la versiuni începând cu 1.0b4 (?).

source: Fixing language templates: %(listname)s
ro: Repar ºabloanele de limbã: %(listname)s

source: WARNING: could not acquire lock for list: %(listname)s
ro: ATENÞIE: nu am putut asigura asigura lista: %(listname)s

source: Updating the held requests database.
ro: Actualizez baza de date a cererilor reþinute.

source: For some reason, %(mbox_dir)s exists as a file. This won't work with b6, so I'm renaming it to %(mbox_dir)s.tmp and proceeding.
ro: Din diverse motive, %(mbox_dir)s existã ca ºi fiºier. Acesta nu funcþioneazã cu b6, aºa cã îl voi redenumi în %(mbox_dir)s.tmp ºi voi continua.

source: %(listname)s has both public and private mbox archives. Since this list currently uses private archiving, I'm installing the private mbox archive -- %(o_pri_mbox_file)s -- as the active archive, and renaming %(o_pub_mbox_file)s to %(o_pub_mbox_file)s.preb6 You can integrate that into the archives if you want by using the 'arch' script.
ro: %(listname)s are atât arhive mbox publice, cât ºi private. Devreme ce aceastã listã foloseºte acum arhivele private, voi instala arhiva mbox privatã -- %(o_pri_mbox_file)s -- ca ºi arhivã curentã, ºi voi redenumi %(o_pub_mbox_file)s în %(o_pub_mbox_file)s.preb6 Veþi putea integra aceastã arhivã în arhivele curente folosind scriptul arch.

source: %s has both public and private mbox archives. Since this list currently uses public archiving, I'm installing the public mbox file archive file (%s) as the active one, and renaming %s to %s.preb6 You can integrate that into the archives if you want by using the 'arch' script.
ro: %s are atãt arhive mbox publice, cât ºi private. Devreme ce aceastã listã foloseºte în mod curent arhivele publice, voi instala fiºierul public mbox, fiºierul arhivã (%s) ca fiind activ, ºi voi redenumi %s în %s.preb6 Veþi putea integra asta în arhive dacã doriþi, folosind scriptul 'arch'.

source: - updating old private mbox file
ro: actualizez vechiul fiºier privat mbox

source: unknown file in the way, moving %(o_pri_mbox_file)s to %(newname)s
ro: fiºier necunoscut în cale, mut %(o_pri_mbox_file)s în %(newname)s

source: - updating old public mbox file
ro: - actualizez vechiul fiºier public mbox

source: unknown file in the way, moving %(o_pub_mbox_file)s to %(newname)s
ro: fiºier necunoscut, mut %(o_pub_mbox_file)s în %(newname)s

source: - This list looks like it might have <= b4 list templates around
ro: - Aceasta aratã de parcã ar avea ºabloane de listã <= b4

source: - moved %(o_tmpl)s to %(n_tmpl)s
ro: - am mutat %(o_tmpl)s în %(n_tmpl)s

source: - both %(o_tmpl)s and %(n_tmpl)s exist, leaving untouched
ro: - atât %(o_tmpl)s cât ºi %(n_tmpl)s existã; termin execuþia fãrã intervenþie

source: - %(o_tmpl)s doesn't exist, leaving untouched
ro: - %(o_tmpl)s nu existã, las locul neatins

source: removing directory %(src)s and everything underneath
ro: ºterg directorul %(src)s ºi tot conþinutul acestuia

source: removing %(src)s
ro: ºterg %(src)s

source: Warning: couldn't remove %(src)s -- %(rest)s
ro: Atenþie: nu am putut ºterge %(src)s -- %(rest)s

source: couldn't remove old file %(pyc)s -- %(rest)s
ro: nu am putut ºterge vechiul fiºier %(pyc)s -- %(rest)s

source: updating old qfiles
ro: actualizez vechile fiºiere qfiles

source: message is unparsable: %(filebase)s
ro: mesajul nu poate fi parcurs: %(filebase)s

source: Updating Mailman 2.1.4 pending.pck database
ro: Actualizez vechea bazã de date pending.pck de tip Mailman 2.1.4

source: Ignoring bad pended data: %(key)s: %(val)s
ro: Ignor date în aºteptare eronate: %(key)s: %(val)s
