Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: <b>plain</b> -- If getting digests, does the member get plain text digests? (otherwise, MIME)
hr: <b>obièan</b> -- Ako èlan dobija digeste, da li su to obièni tekstualni digesti? (inaèe, MIME)
ro: <b>simplu</b> -- în cazul livrãrii de rezumate, doreºte acest mebru sã le primeascã sub formã de text simplu? (altfel le primeºte în format MIME)
tr: <strong>düz yazý</strong> -- Eðer toplu halde alýyorsa, üye mesajlarý düz yazý olarak mý alýyor? (aksi halde MIME gönderilir)

source: <b>language</b> -- Language preferred by the user
hr: <b>jezik</b> -- Jezik koji preferira korisnik
ro: <b>limba</b> -- Limba preferatã de utilizator
tr: <strong>dil</strong> -- Kullanýcýnýn tercih ettiði dil

source: Click here to hide the legend for this table.
hr: Kliknite ovdje da biste sakrili legendu ove tablice
ro: Apasati aici pentru a ascunde legenda acestui tabel.
tr: Bu tablonun ayrýntýlarýný gizlemek için buraya týklayýnýz.

source: Click here to include the legend for this table.
hr: Kliknite ovdje da biste prikazali legendu za ovu tablicu.
ro: Apasati aici pentru a afiºa legenda acestui tabel.
tr: Bu tablonun ayrýntýlarýný göstermek için buraya týklayýnýz.

source: <p><em>To view more members, click on the appropriate range listed below:</em>
hr: <p><em>Da biste vidjeli vi¹e èlanova, kliknite na odgovarajuæi èlan skupa koji je prikazan dolje:</em>
ro: <p><em>Pentru a afiºa mai mulþi membrii, apãsaþi pe intervalul corespunzãtor, afiºat mai jos:</em>
tr: <p><em>Daha fazla üye görüntülemek için aþaðýda uygun aralýða týklayýn:</em>

source: from %(start)s to %(end)s
hr: od %(start)s do %(end)s
ro: de la %(start)s pânã la %(end)s
tr: %(start)s ile %(end)s arasý

source: Subscribe these users now or invite them?
hr: Odmah pretplati ove korisnike ili ih pozovi?
ro: Abonez acum aceºti utilizatori sau doar îi invit?
tr: Bu kullanýcýlar hemen mi üye yapýlsýn yoksa davet mi edilsin?

source: Invite
hr: Pozovi
ro: Invitã
tr: Davet Et

source: Subscribe
hr: Pretplati
ro: Aboneazã
tr: Üye Yap

source: Send welcome messages to new subscribees?
hr: Po¹alji poruku dobrodo¹lice novim pretplatnicima?
ro: Trimit mesaje de bun venit noilor abonaþi?
tr: Yeni üyelere hoþgeldiniz mesajý gönderilsin mi?

source: No
hr: Ne
ro: Nu
tr: Hayýr

source: Yes
hr: Da
ro: Da
tr: Evet

source: Send notifications of new subscriptions to the list owner?
hr: Po¹alji obavijesti o novim pretplatnicima vlasniku liste?
ro: Trimit notificãri de noi abonaþi cãtre proprietarul listei?
tr: Liste sahibine yeni üyeliklerin bilgisi gönderilsin mi?

source: Enter one address per line below...
hr: Unesite dolje jednu adresu po liniji...
ro: Introduceþi mai jos câte o adresã pe rând...
tr: Her satýra bir adres olacak þekilde yazýn...

source: ...or specify a file to upload:
hr: ...ili specificirajte datoteku za upload:
ro: ...sau specificaþi un fiºier pentru încãrcare (upload)
tr: ...veya yüklemek için bir dosya seçin:

source: Below, enter additional text to be added to the top of your invitation or the subscription notification. Include at least one blank line at the end...
hr: Ispod unesite dodatni tekst koji æe biti dodan na vrh va¹e pozivnice, ili na obavijest o pretplati. Ukljuèite najmanje jednu praznu liniju na kraju...
ro: Introduceþi mai jos un text adiþional ce va fi adãugat la începutul invitaþiei dumneavoastrã de abonare.<br>Includeþi cel puþin un rând gol la sfârºit...
tr: Aþaðýya davet veya üyelik bildiriminizin üstüne eklenecek yazýyý giriniz. Sonda en az bir adet boþ satýr býrakýnýz...

source: Send unsubscription acknowledgement to the user?
hr: Po¹alji potvrdu odjave korisniku?
ro: Trimit utilizatorului confirmarea de dezabonare?
tr: Üyeye listeden çýkarýlmasýyla ilgili ek bilgi gönderilsin mi?

source: Send notifications to the list owner?
hr: Po¹alji obavijesti vlasniku liste?
ro: Trimit notificãri proprietarului listei?
tr: Liste sahibine bildirimler gönderilsin mi?

source: Change list ownership passwords
hr: Promjeni lozinku vlasnika liste
ro: Parolele de proprietate ale listei
tr: Liste sahibi þifrelerini deðiþtir

source: The <em>list administrators</em> are the people who have ultimate control over all parameters of this mailing list. They are able to change any list configuration variable available through these administration web pages. <p>The <em>list moderators</em> have more limited permissions; they are not able to change any list configuration variable, but they are allowed to tend to pending administration requests, including approving or rejecting held subscription requests, and disposing of held postings. Of course, the <em>list administrators</em> can also tend to pending requests. <p>In order to split the list ownership duties into administrators and moderators, you must set a separate moderator password in the fields below, and also provide the email addresses of the list moderators in the <a href="%(adminurl)s/general">general options section</a>.
hr: <em>Administratori liste</em> su ljudi koji imaju potpunu kontrolu svih parametara ove mailing liste. Oni su u moguænosti promijeniti bilo koju konfiguracijsku varijablu liste koja je dostupna na ovim administratorskim stranicama. <p><em>Moderatori liste</em> imaju ogranièene moguænosti; oni ne mogu promijeniti sve konfiguracijske varijable liste, ali mogu raditi sa administratorskim zahtjevima na èekanju. To ukljuèuje odobravanje ili odbijanje zadr¾anih zahtjeva za pretplatom i odbijanje poruka na èekanju. Naravno, <em>administratori liste</em> mogu raditi i sa zahtjevima na èekanju. <p>Da biste podijelili du¾nosti nad vlasni¹tvom liste izmeðu administratora i moderatora, morate postaviti posebnu moderatorsku lozinku u donja polja i upisati e-mail adresu moderatora liste na <a href="%(adminurl)s/general">dio opæih postavki</a>.
ro: <em>Administratorii listei</em> sunt cei ce au controlul absolut asupra tuturor parametrilor acestei liste de discuþii. Ei au posibilitatea sã modifice orice parametru de configurare, prin intermediul acestor pagini web. <p><em>Moderatorii listei</em> au permisiuni mai limitate; ei nu pot modifica orice parametru de configurare a listei, dar au dreptul sã proceseze cererile în aºteptare, inclusiv aprobarea sau respingerea cererilor de abonare ºi moderarea mesajelor reþinute. Desigur, ºi <em>administratorii listei</em> pot gestiona cererile în aºteptare. <p>Pentru a putea separa sarcinile dintre administratori ºi moderatori, trebuie sã setaþi parole separate în câmpurile de mai jos, ºi de asemenea sã furnizaþi adresele de email ale moderatorilor listei, în <a href="%(adminurl)s/general">secþiunea de opþiuni generale</a>.
tr: <em>Liste yöneticileri</em> bu listede tüm parametreler üzerinde kontrol sahibi olan kiþilerdir. Liste ayarlarýyla ilgili her deðeri bu yönetim sayfalarý aracýlýðýyla deðiþtirebilirler. <p><em>Moderatörler</em> daha sýnýrlý izinlere sahiptirler, herhangi bir ayar deðerini deðiþtiremezler, sadece bekleyen yönetim isteklerine bakarak üyelik istekleri ile gönderileri kabul edebilir veya reddedebilirler. Tabi ki <em>liste yöneticileri</em> de bekleyen yönetim isteklerine cevap verebilir. <p>Liste yönetim görevlerini yöneticiler ve moderatörler arasýnda bölmek için aþaðýda farklý bir moderatör þifresi belirlemeniz ve ayrýca liste moderatörlerinin e-posta adreslerini <a href="%(adminurl)s/general">genel seçenekler</a> bölümünde tanýmlamanýz gereklidir.

source: Enter new administrator password:
hr: Unesite novu administratorsku lozinku:
ro: Introduceþi noua parolã de administrator:
tr: Yeni yönetici þifresini girin:

source: Confirm administrator password:
hr: Potvrdite administratorsku lozinku:
ro: Confirmaþi parola de administrator:
tr: Yönetici þifresini onaylayýn:

source: Enter new moderator password:
hr: Unesite novu moderatorsku lozinku:
ro: Introduceþi noua parolã de moderator:
tr: Yeni moderatör þifresini girin:

source: Confirm moderator password:
hr: Potvrdite moderatorsku lozinku:
ro: Confirmaþi parola de moderator:
tr: Moderatör þifresini onaylayýn:

source: Submit Your Changes
hr: Po¹aljite promjene
ro: Salveazã modificãrile
tr: Deðiþiklikleri Kaydet

source: Moderator passwords did not match
hr: Moderatorske lozinke se ne podudaraju
ro: Parolele de moderator nu se potrivesc
tr: Moderatör þifreleri birbiriyle eþleþmedi

source: Administrator passwords did not match
hr: Administratorske lozinke se ne podudaraju
ro: Parolele de administrator nu se potrivesc
tr: Yönetici þifreleri birbiriyle eþleþmedi

source: Already a member
hr: Veæ je èlan
ro: Este membru deja
tr: Zaten listeye üye

source: &lt;blank line&gt;
ro: &lt;linie goalã&gt;
tr: &lt;boþ satýr&gt;

source: Bad/Invalid email address
hr: Kriva/Neispravna e-mail adresa
ro: Adresã de email greºitã/invalidã
tr: Kötü/Geçersiz e-posta adresi

source: Hostile address (illegal characters)
hr: Hostile adresa (nedozvoljeni znakovi)
ro: Adresã ostilã (caractere ilegale)
tr: Saldýrgan adres (geçersiz karakterler içeriyor)

source: Successfully invited:
hr: Uspje¹no pozvani:
ro: Au fost invitaþi cu succes:
tr: Baþarýyla davet edildi:

source: Successfully subscribed:
hr: Uspje¹no pretplaæeni:
ro: Au fost abonaþi cu succes:
tr: Baþarýyla üye yapýldý:

source: Error inviting:
hr: Gre¹ka kod pozivanja:
ro: Eroare la invitare:
tr: Davet ederken hata oldu:

source: Error subscribing:
hr: Gre¹ka kod pretplaæivanja:
ro: Eroare la abonare:
tr: Üye yaparken hata oldu:

source: Successfully Unsubscribed:
hr: Uspje¹no Odjavljeni:
ro: Au fost dezabonaþi cu succes:
tr: Baþarýyla üyelikten çýkarýldý:

source: Cannot unsubscribe non-members:
hr: Ne mogu odjaviti one koji nisu èlanovi:
ro: Nu pot dezabona non-membri:
tr: Zaten üye olmayanlar çýkarýlamýyor:

source: Bad moderation flag value
hr: Kriva vrijednost moderacijske zastavice
ro: Valoare eronatã a flagului de moderare
tr: Kötü moderatör onay deðeri

source: Not subscribed
hr: Nije pretplaæen
ro: Nu sunt abonaþi
tr: Üye deðil

source: Ignoring changes to deleted member: %(user)s
hr: Ignoriram promjene obrisanog èlana: %(user)s
ro: Ignor modificãrile în cazul membrului ºters: %(user)s
tr: Silinmiþ üye üzerindeki deðiþiklikler gözardý ediliyor: %(user)s

source: Successfully Removed:
hr: Uspje¹no Maknut:
ro: Au fost dezabonaþi cu succes:
tr: Baþarýyla Silindi:

source: Error Unsubscribing:
hr: Gre¹ka kod Odjavljivanja:
ro: Eroare la dezabonare:
tr: Üyelikten çýkarýlýrken hata oldu:

source: %(realname)s Administrative Database
hr: %(realname)s Administracijska Baza Podataka
ro: Baza de date administrativã a %(realname)s
tr: %(realname)s Yönetimsel Veritabaný

source: %(realname)s Administrative Database Results
hr: %(realname)s Rezultati Administracijske Baze Podataka
ro: Rezultatele bazei de date administrative a %(realname)s
tr: %(realname)s Yönetimsel Veritabaný Sonuçlarý

source: There are no pending requests.
hr: Nema zahtjeva na èekanju.
ro: Nu sunt cereri în aºteptare.
tr: Bekleyen istek yok.

source: Click here to reload this page.
hr: Kliknite ovdje da biste osvje¾ili stranicu.
ro: Clic aici pentru reîncãrcare.
tr: Bu sayfayý yeniden yüklemek için buraya týklayýn.

source: Detailed instructions for the administrative database
hr: Detaljnje upute za administracijsku bazu podataka
ro: Instrucþiuni detaliate pentru baza de date administrativã
tr: Yönetimsel veritabaný için ayrýntýlý açýklamalar

source: Administrative requests for mailing list:
hr: Administrativni zahtjev za mailing listu:
ro: Cereri administrative pentru lista:
tr: Mesaj listesi için yönetimsel istekler:

source: Submit All Data
hr: Po¹alji Sve Podatke
ro: Salveazã toate datele
tr: Tüm Veriyi Gönder

source: all of %(esender)s's held messages.
hr: sve od %(esender)s's zadr¾anih poruka.
ro: toate mesajele reþinute trimise de %(esender)s's
tr: %(esender)s göndericisinin tüm bekletilen mesajlarý.

source: a single held message.
hr: jedna zadr¾ana poruka.
ro: un singur mesaj reþinut.
tr: tek bir bekletilen mesaj.

source: all held messages.
hr: sve zadr¾ane poruke.
ro: toate mesajele reþinute.
tr: tüm bekletilen mesajlar.

source: Mailman Administrative Database Error
hr: Mailmanova Administracijska Gre¹ka Baze Podataka
ro: Eroare în baza de date administrativã Mailman
tr: Mailman Yönetimsel Veritabaný Hatasý

source: list of available mailing lists.
hr: lista dostupnih mailing lista.
ro: lista listelor de discuþii disponibile.
tr: mevcut mesaj listelerinin listesi.

source: You must specify a list name. Here is the %(link)s
hr: Morate specificirati naziv liste. Ovdje je %(link)s
ro: Trebuie sã specificaþi un nume pentru listã. Iatã: %(link)s
tr: Bir liste ismi belirtmelisiniz. Ýþte %(link)s

source: Subscription Requests
hr: Zahtjevi za Pretplatom
ro: Cereri de abonare
tr: Listeye Üyelik Ýstekleri

source: Address/name
hr: Adresa/ime
ro: Nume/Adresã
tr: Adres/isim

source: Your decision
hr: Va¹a odluka
ro: Decizia dumneavoastrã
tr: Kararýnýz

source: Reason for refusal
hr: Razlog odbijanja
ro: Motivul refuzului
tr: Reddetme için neden

source: Approve
hr: Odobri
ro: Aprobare
tr: Onayla

source: Permanently ban from this list
hr: Trajno zabrani pristup ovoj listi
ro: Exclude definitiv de pe aceastã listã
tr: Bu listede kalýcý olarak yasakla

source: User address/name
hr: Korisnièka adresa/ime
ro: Numele/adresa utilizatorului
tr: Kullanýcý adresi/ismi

source: Unsubscription Requests
hr: Zahtjevi za Odjavom
ro: Cereri de dezabonare
tr: Listeden Çýkma Ýstekleri

source: From:
hr: Od:
ro: De la:
tr: Gönderen:

source: Action to take on all these held messages:
hr: Poduzmi navedene akcije za sve ove zadr¾ane poruke:
ro: Ce faceþi cu toate aceste mesaje reþinute:
tr: Tüm bekleyen mesajlar için uygulanacak eylem:

source: Preserve messages for the site administrator
hr: Saèuvaj poruke za site administratora
ro: Pãstreazã mesajele pentru administratorul site-ului
tr: Site yöneticisi için mesajlarý sakla

source: Forward messages (individually) to:
hr: Prosljedi poruke (individualno) na:
ro: Înainteazã (forward) fiecare mesaj cãtre:
tr: Mesajlarý (ayrý ayrý) ilet:

source: Clear this member's <em>moderate</em> flag
hr: Iskljuèi ovom èlanu <em>moderatorsku</em> oznaku
ro: Dezactiveazã flagul de <em>moderare</em> a acestui membru
tr: Bu üyenin <em>moderatör onayý ayarýný</em> kaldýr

source: <em>The sender is now a member of this list</em>
hr: <em>Po¹iljatelj je sada èlan ove liste</em>
ro: <em>Expeditorul este acum membru al acestei liste</em>
tr: <em>Gönderici artýk bu listenin bir üyesi</em>

source: Add <b>%(esender)s</b> to one of these sender filters:
hr: Dodaj <b>%(esender)s</b> u jedan od ovih filtera po¹iljatelja:
ro: Adaugã <b>%(esender)s</b> la unul din aceste filtre de expeditor:
tr: <b>%(esender)s</b> adresini þu gönderici filtrelerinden birine ekle:

source: Accepts
hr: Prihvaæeno
ro: Acceptate
tr: Onaylanacaklar

source: Discards
hr: Zanemareno
ro: Refuzate
tr: Gözardý Edilecekler

source: Holds
hr: Zadr¾ano
ro: Blocate
tr: Bekletilecekler

source: Rejects
hr: Odbijeno
ro: Rejectate
tr: Reddedilecekler

source: Ban <b>%(esender)s</b> from ever subscribing to this mailing list
hr: Zabrani pristup <b>%(esender)s</b> da se vi¹e ikad pretplati na ovu mailing listu
ro: Activeazã interdicþia definitivã de abonare pe aceastã listã a <strong>(esender)s</strong>
tr: <b>%(esender)s</b> adresinin bu mesaj listesine üye olmasýný yasakla

source: Click on the message number to view the individual message, or you can
hr: Kliknite na broj poruke da biste vidjeli pojedinu poruku, ili mo¾ete
ro: Apãsaþi pe numãrul mesajului pentru a-l afiºa individual, sau puteþi
tr: Bir mesajý görüntülemek için mesaj numarasýna týklayabilir, veya

source: view all messages from %(esender)s
hr: pogledajte sve poruke od %(esender)s
ro: afiºa toate mesajele de la %(esender)s
tr: %(esender)s adresinden gelen tüm mesajlarý görebilirsiniz

source: Subject:
hr: Naslov:
ro: Subiect:
tr: Konu:

source: bytes
ro: octeþi
tr: bayt

source: Size:
hr: Velièina:
ro: Mãrime:
tr: Boyut:

source: not available
hr: nije dostupno
ro: indisponibil(ã)
tr: kullanýlamýyor

source: Reason:
hr: Razlog:
ro: Motivul:
tr: Neden:

source: Received:
hr: Primljeno:
ro: Recepþionat:
tr: Alýndý:

source: Posting Held for Approval
hr: Poruka Zadr¾ana za Odobrenje
ro: Mesajul este reþinut pentru aprobare
tr: Mesaj Onay Ýçin Bekletiliyor

source: (%(count)d of %(total)d)
hr: (%(count)d od %(total)d)
ro: (%(count)d din %(total)d)
tr: (%(count)d, toplam %(total)d)

source: <em>Message with id #%(id)d was lost.
hr: <em>Poruka sa id-om #%(id)d je izgubljena.
ro: <em>Mesajul cu id-ul #%(id)d s-a pierdut.
tr: <em>#%(id)d kimlikli mesaj kayýp.

source: <em>Message with id #%(id)d is corrupted.
hr: <em>Poruka sa id-om #%(id)d je nepravilna.
ro: <em>Mesajul cu id-ul #%(id)d este corupt.
tr: <em>#%(id)d kimlikli mesaj bozuk.

source: Preserve message for site administrator
hr: Saèuvaj poruku za site administratora
ro: Pãstreazã mesajul pentru administratorul site-ului
tr: Mesajý site yöneticisi için sakla

source: Additionally, forward this message to:
hr: Dodatno, preusmjeri ovu poruku na:
ro: ÃŽn plus, mai trimite (forward) acest mesaj ºi la:
tr: Ek olarak, bu mesajý ilet:

source: [No explanation given]
hr: [Nije dato obja¹njenje]
ro: [Nu are explicaþie]
tr: [Açýklama yapýlmadý]

source: If you reject this post,<br>please explain (optional):
hr: Ako odbijete ovu poruku,<br>molim objasnite (opcionalno):
ro: Dacã respingeþi acest mesaj,<br>daþi o explicaþie (opþional):
tr: Eðer bu mesajý reddedecekseniz,<br>lütfen açýklayýn (isteðe baðlý):

source: Message Headers:
hr: Zaglavlja Poruke
ro: Headerele mesajului:
tr: Mesaj Baþlýklarý:

source: Message Excerpt:
hr: Izvadak Poruke
ro: Extras din mesaj:
tr: Mesaj Alýntýsý:

source: Database Updated...
hr: Baza Podataka je Osvje¾ena....
ro: Baza de date a fost actualizatã...
tr: Veritabaný Güncellendi...

source: is already a member
hr: je veæ èlan
ro: este deja membru
tr: zaten üye

source: Confirmation string was empty.
hr: Potvrdni tekst je bio prazan.
ro: Codul de confirmare a fost nul.
tr: Onay dizgisi boþtu.

source: <b>Invalid confirmation string:</b> %(safecookie)s. <p>Note that confirmation strings expire approximately %(days)s days after the initial subscription request. If your confirmation has expired, please try to re-submit your subscription. Otherwise, <a href="%(confirmurl)s">re-enter</a> your confirmation string.
hr: <b>Pogre¹an potvrdni tekst:</b> %(safecookie)s. <p>Imajte na umu da potvrdni tekstovi istièu u pravilu %(days)s dana nakon poèetnog zahtjeva za pretplatom. Ako je va¹a potvrda istekla, molim poku¹ajte ponovno poslati va¹ zahtjev za pretplatom. Inaèe, <a href="%(confirmurl)s">ponovno unesite</a> va¹ potvrdni tekst.
ro: <b>Cod de confirmare invalid:</b> %(safecookie)s. <p>Codurile de confirmare expirã dupã aproximativ %(days)s zile de la cererea iniþialã de abonare. Dacã acest cod de confirmare a expirat, vã rugãm sã re-trimiteþi cererea de abonare. Altfel, <a href="%(confirmurl)s">re-introduceþi</a> codul de confirmare.
tr: <b>Geçersiz onay dizgisi:</b> %(safecookie)s. <p>Onay dizgisi süreleri ilk üyelik isteðinden yaklaþýk %(days)s gün sonra dolar. Eðer onay süreniz dolduysa, lütfen üyeliðinizi tekrar yapmayý deneyiniz. Eðer sürenin dolmadýðýndan eminseniz onayýnýzý <a href="%(confirmurl)s">tekrar giriniz</a>.

source: The address requesting unsubscription is not a member of the mailing list. Perhaps you have already been unsubscribed, e.g. by the list administrator?
hr: Adresa sa koje je zatra¾ena odjava nije èlan mailing liste. Mo¾da ste veæ odjavljeni, npr. od strane administratora liste?
ro: Adresa de la care vine cererea de dezabonare nu este înregistratã ca abonatã pe listã. Este posibil sã fiþi deja dezabonat(ã), de ex. de cãtre administratorul listei?
tr: Listeden çýkmak isteyen adres zaten listenin bir üyesi deðil. Belki þimdiye kadar listeden çýkarýlmýþtýnýz, örneðin liste yöneticisi tarafýndan çýkarýlmýþ olabilirsiniz.

source: The address requesting to be changed has been subsequently unsubscribed. This request has been cancelled.
hr: Adresa za koju se tra¾i promjena je veæ vi¹e puta odjavljena. Ovaj zahtjev je odbaèen.
ro: Adresa pentru care a fost cerutã modificarea a fost între timp dezabonatã de le listã. Aceastã cerere a fost anulatã.
tr: Deðiþtirilmek istenen adres sonradan listeden çýkarýlmýþ. Bu istek iptal edildi.

source: System error, bad content: %(content)s
hr: Sistemska gre¹ka, krivi sadr¾aj: %(content)s
ro: Eroare de sistem, conþinut eronat: %(content)s
tr: Sistem hatasý, hatalý içerik: %(content)s

source: Bad confirmation string
hr: Krivi potvrdni tekst
ro: Cod de confirmare eronat
tr: Hatalý onay dizgisi

source: Enter confirmation cookie
hr: Unesite potvrdni kolaèiæ (cookie)
ro: Introduceþi codul de confirmare
tr: Onay tanýmlama bilgisini (cookie) girin

source: Please enter the confirmation string (i.e. <em>cookie</em>) that you received in your email message, in the box below. Then hit the <em>Submit</em> button to proceed to the next confirmation step.
hr: Molim unesite potvrdni tekst (npr. <em>kolaèiæ (cookie)</em>) koji ste primili u mailu, u donje polje. Zatim kliknite na gumb <em>Po¹alji</em> da biste pre¹li na sljedeæi korak potvrde.
ro: Vã rugãm sã introduceþi în câmpul de mai jos codul de confirmare (sau <em>cookie</em>) pe care l-aþi primit în mesajul e-mail. Apoi apãsaþi butonul <em>Trimite</em>pentru a putea trece la urmãtorul pas al confirmãrii.
tr: Lütfen e-posta mesajýnýzda aldýðýnýz onay dizgisini (yani <em>tanýmlama bilgisi (cookie)</em>) aþaðýdaki kutuya girin. Bundan sonra <em>Gönder</em> düðmesine týklayarak bir sonraki onay adýmýna geçin.

source: Confirmation string:
hr: Potvrdni tekst
ro: Cod de confirmare:
tr: Onay dizgisi:

source: Submit
hr: Po¹alji
ro: Trimite
tr: Gönder

source: Confirm subscription request
hr: Potvrdi zahtjev za pretplatom
ro: Cerere de confirmare a abonãrii
tr: Üyelik isteðini onaylayýn
