Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Leave the initial password (and confirmation) fields blank if you want Mailman to autogenerate the list passwords.
hr: Ostavite inicijalnu lozinku (i potvrdno) polje prazno ako ¾elite da Mailman sam generira lozinke za listu.
ro: Lãsaþi câmpurile de parolã iniþialã (ºi confirmare) necompletate dacã doriþi ca Mailman sã genereze automat parolele pentru listã.
tr: Mailman'in liste þifrelerini otomatik olarak oluþturmasýný istiyorsanýz baþlangýç þifresi (ve onay) alanlarýný boþ býrakýnýz.

source: Initial list passwords do not match
hr: Inicijalne lozinke liste se ne podudaraju
ro: Parolele iniþiale ale listei nu se potrivesc
tr: Baþlangýç liste þifreleri birbiriyle uyuþmuyor

source: The list password cannot be empty<!-- ignore -->
hr: Lozinka liste ne smije biti prazna<!-- ignore -->
ro: Parola listei nu poate fi goalã<!-- ignorã -->
tr: Liste þifresi boþ olamaz!<!-- ignore -->

source: You are not authorized to create new mailing lists
hr: Vi niste ovla¹teni da biste kreirali nove mailing liste
ro: Nu aveþi autorizarea necesarã pentru a crea noi liste de discuþii
tr: Yeni mesaj listesi oluþturmak için yetkili deðilsiniz

source: Unknown virtual host: %(safehostname)s
hr: Nepoznati virtualni host: %(safehostname)s
ro: Listã necunoscutã: %(listname)s
tr: Bilinmeyen sanal host: %(safehostname)s

source: Bad owner email address: %(s)s
hr: Kriva e-mail adresa vlasnika: %(s)s
ro: Adresã eronatã a proprietarului listei: %(s)s
tr: Kötü sahip e-posta adresi: %(s)s

source: List already exists: %(listname)s
hr: Lista veæ postoji: %(listname)s
ro: Lista %(listname)s existã deja!
tr: Liste zaten var: %(listname)s

source: Illegal list name: %(s)s
hr: Krivi naziv liste: %(s)s
ro: Nume de listã ilegal: %(s)s
tr: Geçersiz liste ismi: %(s)s

source: Some unknown error occurred while creating the list. Please contact the site administrator for assistance.
hr: Prilikom kreiranja liste dogodila se neka nepoznata gre¹ka. Molim kontaktirajte administratora sitea za pomoæ.
ro: A apãrut o eroare necunoscutã în timpul creãrii listei. Contactaþi administratorul site-ului pentru asistenþã tehnicã.
tr: Liste oluþturulurken bilinmeyen bir hata oluþtu. Yardým için yöneticinize baþvurun.

source: Your new mailing list: %(listname)s
hr: Va¹a nova mailing lista: %(listname)s
ro: Noua dumneavoastrã listã: %(listname)s
tr: Yeni mesaj listeniz: %(listname)s

source: Mailing list creation results
hr: Rezultati kreiranja mailing liste
ro: Rezultatele creãrii listei de discuþie
tr: Mesaj listesi oluþturma sonuçlarý

source: You have successfully created the mailing list <b>%(listname)s</b> and notification has been sent to the list owner <b>%(owner)s</b>. You can now:
hr: Uspje¹no ste kreirali mailing listu <b>%(listname)s</b> i obavijest je poslana vlasniku liste <b>%(owner)s</b>. Sada mo¾ete:
ro: Aþi creat cu succes lista de discuþii <b>%(listname)s</b>; a fost trimisã o notificare cãtre proprietarul listei <b>%(owner)s</b>. Acum puteþi:
tr: <strong>%(listname)s</strong> mesaj listesini baþarýyla oluþturdunuz ve liste sahibi <b>%(owner)s</b> adresine bildirim gönderildi. Þimdi:

source: Visit the list's info page
hr: Posjetite info stranicu liste
ro: Vizitaþi pagina de informaþii generale a listei
tr: Listenin bilgi sayfasýna gidebilirsiniz

source: Visit the list's admin page
hr: Posjetite administratorsku stranicu liste
ro: Vizitaþi pagina de administrare a listei
tr: Listenin yönetim sayfasýna gidebilirsiniz

source: Create another list
hr: Kreiraj drugu listu
ro: Creazã o altã listã
tr: Baþka bir liste oluþturabilirsiniz

source: Create a %(hostname)s Mailing List
hr: Kreiraj %(hostname)s Mailing Listu
ro: Creazã o listã de discuþii Mailnam la %(hostname)s
tr: Bir %(hostname)s Mesaj Listesi Oluþtur

source: Error:
hr: Gre¹ka:
ro: Eroare:
tr: Hata:

source: You can create a new mailing list by entering the relevant information into the form below. The name of the mailing list will be used as the primary address for posting messages to the list, so it should be lowercased. You will not be able to change this once the list is created. <p>You also need to enter the email address of the initial list owner. Once the list is created, the list owner will be given notification, along with the initial list password. The list owner will then be able to modify the password and add or remove additional list owners. <p>If you want Mailman to automatically generate the initial list admin password, click on `Yes' in the autogenerate field below, and leave the initial list password fields empty. <p>You must have the proper authorization to create new mailing lists. Each site should have a <em>list creator's</em> password, which you can enter in the field at the bottom. Note that the site administrator's password can also be used for authentication.
hr: Novu listu mo¾ete kreirati uno¹enjem potrebnih informacija u donju formu. Naziv mailing liste bit æe kori¹ten kao primarna adresa za slanje poruka na listu, pa bi trebao biti napisan malim slovima. Navedeno neæete moæi promjeniti kada kreirate listu. <p>Takoðer trebate unijeti e-mail adresu poèetnog vlasnika liste. Jednom kada je lista kreirana, vlasnik liste æe biti obavje¹ten, zajedno sa inicijalnom lozinkom liste. Vlasnik liste æe tada biti u moguænosti promjeniti lozinku i dodati ili obrisati dodatne vlasnike liste. <p>Ako ¾elite da Mailman automatski generira poèetnu lozinku liste, kliknite na `Da' u donje autogeneriraj polje, i ostavite polje sa poèetnom lozinkom prazno. <p>Da biste kreirali nove mailing liste morate imati odgovarajuæa prava. Svaki site treba imati lozinku <em>kreatora liste</em>, koju mo¾ete unijeti u polje na dnu. Primjetite da administratorska lozinka takoðer mo¾e biti kori¹tena za autentikaciju.
ro: Puteþi crea o nouã listã de discuþii introducând informaþiile relevante în formularul de mai jos. Numele listei de email va fi folosit ca ºi adresã primarã pentru publicarea mesajelor pe listã, deci ar trebui sã fie scris cu minuscule. Nu veþi mai putea modifica acest nume de îndatã ce lista este creatã. <p>Va trebui, de asemenea, sã furnizaþi adresa de e-mail a proprietarului iniþial al listei. De îndatã ce lista este creatã, proprietarul acesteia va primi o notificare, împreunã cu parola de administrare a listei. Proprietarul listei va putea apoi modifica parola ºi adãga sau ºterge ºi alþi proprietari de listã. <p>Dacã doriþi ca Mailman sã genereze automat parola iniþialã de administrare a listei, alegeþi 'Da' în câmpul de autogenerare de mai jos ºi nu completaþi câmpurile parolei iniþiale. <p>Trebuie sã aveþi autorizarea necesarã pentru a puteacrea noi liste de discuþie. Fiecare site trebuie sã aibã o parolã a <em>creatorului de liste</em>, ce trebuie introdusã în ultimul câmp al formularului. Notaþi cã ºi parola de administrator de site poate fi folositã pentru autentificare.
tr: Ýlgili bilgileri aþaðýdaki forma girerek yeni bir mesaj listesi oluþturabilirsiniz. Mesaj listesinin ismi, bu listeye mesaj göndermek için asýl adres olarak kullanýlacaðýndan küçük harfle yazýlmalýdýr. Liste oluþturulduktan sonra bunu tekrar deðiþtirme imkanýnýz olmayacaktýr. <p>Ayrýca baþlangýçta liste sahibi olacak kiþinin e-posta adresini de girmeniz gerekir. Liste oluþturulduðunda liste sahibine baþlangýç þifresini de içeren bir bildirim gönderilecektir. Liste sahibi bundan sonra þifreyi deðiþtirebilecek ve ek liste sahipleri ekleyip çýkarabilecektir. <p>Eðer Mailman'in baþlangýç liste yönetim þifresini otomatik olarak oluþturmasýný isterseniz, Aþaðýda otomatik oluþtur alanýnda 'Evet'e týklayýn ve baþlangýç þifre alanlarýný boþ býrakýn. <p>Yeni mesaj listeleri oluþturmak için uygun yetkiye sahip olmalýsýnýz. Her site bir <em>liste oluþturucu</em> þifresine sahiptir, bu þifreyi en alttaki alana girebilirsiniz. Kimlik doðrulamasý için site yönetici þifresi de kullanýlabilir.

source: List Identity
hr: Identitet Liste
ro: Date de identitate
tr: Liste Kimliði:

source: Name of list:
hr: Naziv liste
ro: Numele listei:
tr: Liste ismi:

source: Initial list owner address:
hr: Poèetna adresa vlasnika liste:
ro: Adresa iniþialã a proprietarului listei:
tr: Baþlangýç liste sahibi adresi:

source: Auto-generate initial list password?
hr: Automatski generiraj inicijalnu lozinku liste?
ro: Auto-generez parola iniþialã a listei?
tr: Baþlangýç liste þifresi otomatik oluþturulsun mu?

source: Initial list password:
hr: Inicijalna lozinka liste:
ro: Parola iniþialã a listei:
tr: Baþlangýç liste þifresi:

source: Confirm initial password:
hr: Potvrdi inicijalnu lozinku:
ro: Confirmaþi parola iniþialã:
tr: Baþlangýç þifresini onaylayýn:

source: List Characteristics
hr: Karakteristike Liste
ro: Caracteristicile listei
tr: Liste Özellikleri

source: Should new members be quarantined before they are allowed to post unmoderated to this list? Answer <em>Yes</em> to hold new member postings for moderator approval by default.
hr: Da li bi novi èlanovi trebali prièekati prije nego im bude dozvoljeno slanje nemoderiranih poruka na ovu listu? Odgovorite <em>Da</em> da biste ostavili èlanske poruke dok ih moderator ne odobri.
ro: Trebuie noii membrii sã fie carantinaþi înainte de a avea dreptul sã publice mesaje nemoderate pe aceastã listã? Rãspundeþi <em>Da</em> pentru a reþine din oficiu mesajele noilor membrii pentru aprobare.
tr: Yeni üyeler bu listeye mesaj göndermelerine izin verilmeden önce karantinaya alýnsýn mý? Varsayýlan olarak yeni üyelerin mesajlarýnýn moderatör onayý gerektirmesi için <em>Evet</em> seçin.

source: Initial list of supported languages. <p>Note that if you do not select at least one initial language, the list will use the server default language of %(deflang)s
hr: Poèetna lista podr¾anih jezika. <p>Primjetite da ako ne izaberete najmanje jedan inicijalni jezik, lista æe koristiti serverski postavljen jezik i to %(deflang)s
ro: Lista iniþialã de limbi suportate. <p>Dacã nu alegeþi cel puþin o limbã iniþialã, lista de discuþii va folosi limba predefinitã a serverului: %(deflang)s
tr: Desteklenen diller listesi. <p>Eðer en az bir baþlangýç dili seçmezseniz liste, sunucu varsayýlaný olan %(deflang)s dilini kullanacaktýr

source: Send "list created" email to list owner?
hr: Po¹alji "lista je kreirana" e-mail vlasniku liste?
ro: Trimit un mesaj "Lista a fost creatã" cãtre proprietarul listei?
tr: Liste sahibine "liste oluþturuldu" e-postasý gönderilsin mi?

source: List creator's (authentication) password:
hr: Lozinka (autentikacija) kreatora liste:
ro: Parola creatorului de liste:
tr: Liste oluþturucu (doðrulama) þifresi:

source: Create List
hr: Kreiraj Listu
ro: Creazã lista
tr: Listeyi Oluþtur

source: Clear Form
hr: Obri¹i Formu
ro: Curãþã formularul
tr: Formu Temizle

source: General list information page
hr: Stranica s opæenitim informacijama o listi
ro: Pagina de informaþii generale a listei
tr: Genel liste bilgi sayfasý

source: Subscribe results page
hr: Stranica s rezultatima pretplate
ro: Abonamente - pagina de rezultate
tr: Üyelik sonuçlarý sayfasý

source: User specific options page
hr: Stranica s korisnièki specifiènim postavkama
ro: Opþiuni specifice utilizatorilor
tr: Kullanýcýya özel seçenekler sayfasý

source: Welcome email text file
ro: Fiºierul text al mesajului email de întâmpinare

source: List name is required.
hr: Potreban je naziv liste.
ro: Numele listei este obligatoriu.
tr: Liste ismi gerekiyor.

source: %(realname)s -- Edit html for %(template_info)s
hr: %(realname)s -- Uredi html za %(template_info)s
ro: %(realname)s -- Editeazã codul HTML pentru %(template_info)s
tr: %(realname)s -- %(template_info)s için html düzenle

source: Edit HTML : Error
hr: Uredi HTML : Gre¹ka
ro: Modificare HTML : Eroare
tr: HTML düzenle: Hata

source: %(safetemplatename)s: Invalid template
hr: %(safetemplatename)s: Pogre¹an predlo¾ak
ro: %(safetemplatename)s: Åžablon (template) invalid
tr: %(safetemplatename)s: Geçersiz þablon

source: %(realname)s -- HTML Page Editing
hr: %(realname)s -- Ureðivanje HTML Stranice
ro: %(realname)s -- Editare paginã HTML
tr: %(realname)s -- HTML Sayfa Düzenleme

source: Select page to edit:
hr: Izaberite stranicu koju æete ureðivati:
ro: Alegeþi pagina de editat:
tr: Düzenlenecek sayfayý seçin:

source: View or edit the list configuration information.
hr: Pogledajte ili uredite konfiguracijske informacije liste.
ro: Afiºeazã sau modificã informaþiile de configurare ale listei.
tr: Liste yapýlandýrma bilgisini görüntüle veya düzenle

source: When you are done making changes...
hr: Kada ste gotovi sa promjenama...
ro: Când terminaþi de fãcut modificãrile...
tr: Deðiþikliklerinizi tamamladýðýnýzda...

source: Submit Changes
hr: Po¹alji Promjene
ro: Salveazã modificãrile
tr: Deðiþiklikleri Kaydet

source: Can't have empty html page.
hr: Ne mogu imati praznu html stranicu.
ro: Nu puteþi avea pagini HTML goale.
tr: Boþ html sayfasý olamaz.

source: HTML Unchanged.
hr: HTML Nepromjenjen.
ro: Codul HTML este neschimbat.
tr: HTML Deðiþtirilmedi.

source: HTML successfully updated.
hr: HTML je uspje¹no osvje¾en.
ro: Codul HTML a fost actualizat cu succes.
tr: HTML baþarýyla güncellendi.

source: %(hostname)s Mailing Lists
hr: %(hostname)s Mailing Liste
ro: Listele de discuþii de la %(hostname)s
tr: %(hostname)s Mesaj Listeleri

source: <p>There currently are no publicly-advertised %(mailmanlink)s mailing lists on %(hostname)s.
hr: <p>Trenutno nema javno ogla¹enih %(mailmanlink)s mailing lista na %(hostname)s.
ro: <p>Nu sunt disponibile liste de discuþii %(mailmanlink)s publice la %(hostname)s.
tr: <p>Þu anda %(hostname)s üzerinde genel kullaným için ilan edilmiþ %(mailmanlink)s mesaj listesi yok.

source: <p>Below is a listing of all the public mailing lists on %(hostname)s. Click on a list name to get more information about the list, or to subscribe, unsubscribe, and change the preferences on your subscription.
hr: <p>Dolje je lista svih javnih mailing lista na %(hostname)s. Kliknite na naziv liste da biste dobili vi¹e informacija o listi, zatim da biste se pretplatili, odjavili, ili promjenili postavke va¹e pretplate.
ro: <p>Mai jos aveþi o listã cu toate listele publice de discuþii de la %(hostname)s. Faceþi click pe nume pentru a obþine mai multe informaþii despre acea listã, pentru a vã abona/dezabona, sau pentru a vã modifica opþiunile personale de abonament.
tr: <p>Aþaðýda %(hostname)s üzerinde genel kullaným için ilan edilmiþ %(mailmanlink)s mesaj listeleri gösteriliyor. Bir listenin üzerine týklayarak o listeye üye olabilir, çýkabilir veya üyelik tercihlerinizi deðiþtirebilirsiniz.

source: right
hr: u redu
ro: dreapta
tr: sað

source: To visit the general information page for an unadvertised list, open a URL similar to this one, but with a '/' and the %(adj)s list name appended. <p>List administrators, you can visit
hr: Da biste posjetili stranicu sa opæenitim informacijama o nereklamiranoj listi, otvorite URL slièan ovom, ali sa '/' i %(adj)s dodanim nazivom liste. <p>Administratori liste, mo¾ete posjetiti
ro: Pentru a vizita pagina de informaþii generale a unei liste nepublicate, deschideþi un URL similar cu acesta, dar cu un '/'ºi numele %(adj)s al listei adãugat. <p>Administratorii listei, puteþi vizita
tr: Ýlan edilmemiþ bir listenin genel bilgi sayfalarýna gitmek için þu andakine benzer bir URL açýn ve arkasýna '/' ve %(adj)s liste ismini ekleyin. <p>Liste yöneticileri, listenizin yönetim arayüzüne ulaþmak için

source: the list admin overview page
hr: administratorska stranica za opæi pregled
ro: pagina generalã de administrare a listei
tr: liste yönetim tanýtým sayfasýna

source: to find the management interface for your list. <p>If you are having trouble using the lists, please contact
hr: da biste prona¹li upravljaèko suèelje za va¹u listu. <p>Po¹aljite pitanja i komentare na
ro: pentru a gãsi intaerfaþa de administrare a listei dumneavoastrã. <p>Dacã aveþi probleme la folosirea listelor, vã rugãm sã contactaþi
tr: gidebilirsiniz. <p>Listeleri kullanýrken problem yaþýyorsanýz, lütfen baðlantý kurunuz:

source: Edit Options
hr: Uredi Opcije
ro: Opþiuni de editare
tr: Seçenekleri Düzenle

source: View this page in
hr: Pogledaj ovu stranicu koristeæi
ro: Afiºeazã aceastã paginã în
tr: Bu sayfayý þu dilde göster

source: CGI script error
hr: Gre¹ka u CGI skripti
ro: Eroare CGI
tr: CGI dil hatasý

source: Invalid options to CGI script.
hr: Pogre¹ne opcije dane CGI skripti
ro: Opþiuni invalide pentru scriptul CGI.
tr: CGI betiði için geçersiz seçenek

source: No address given
hr: Adresa nije dana
ro: Nu aþi introdus nici o adresã
tr: Adres verilmedi

source: Illegal Email Address: %(safeuser)s
hr: Pogre¹na Email Adresa: %(safeuser)s
ro: Adresã de email ilegalã: (safeuser)s
tr: Geçersiz e-posta adresi: %(safeuser)s

source: No such member: %(safeuser)s.
hr: Nema takvog èlana: %(safeuser)s.
ro: Nu existã un astfel de membru: %(safeuser)s.
tr: Böyle bir üye yok: %(safeuser)s.

source: Your unsubscription request has been forwarded to the list administrator for approval.
hr: Va¹ zahtjev za odjavom je prosljeðen administratoru liste na odobrenje.
ro: Cererea dumneavoastrã de dezabonare a fost înaintatã administratorului listei pentru aprobare.
tr: Listeden çýkma isteðiniz onay için liste yöneticisine iletildi.

source: The confirmation email has been sent.
hr: Potvrdni e-mail je poslan.
ro: A fost trimis un mesaj de confirmare.
tr: Onay e-postasý gönderildi.

source: A reminder of your password has been emailed to you.
hr: Podsjetnik va¹e lozinke poslan vam je mailom.
ro: Un mesaj de reamintire a parolei v-a fost trimis prin email.
tr: Þifreniz için bir hatýrlatýcý e-posta adresinize gönderildi

source: Authentication failed.
hr: Autentikacija nije uspjela.
ro: Autentificarea a eºuat.
tr: Kimlik doðrulamasý baþarýsýz oldu.

source: List subscriptions for %(safeuser)s on %(hostname)s
hr: Pretplata na listu za %(safeuser)s na %(hostname)s
ro: Abonamentele pentru %(safeuser)s la %(hostname)s
tr: %(safeuser)s için %(hostname)s üzerindeki liste üyelikleri

source: Click on a link to visit your options page for the requested mailing list.
hr: Kliknite na link da biste posjetili svoju stranicu sa opcijama za tra¾enu mailing listu.
ro: Apãsaþi pe un link pentru a vizita pagina de opþiuni personale a listei alese.
tr: Ýstediðiniz mesaj listesi için seçenekler sayfanýzý ziyaret etmek için bir linke týklayýn.

source: Addresses did not match!
hr: Adrese se ne podudaraju!
ro: Adresele nu se potrivesc!
tr: Adresler birbirine eþleþmedi!

source: You are already using that email address
hr: Veæ koristite tu e-mail adresu
ro: Folosiþi deja aceastã adresã de email
tr: Zaten o e-posta adresini kullanýyorsunuz

source: The new address you requested %(newaddr)s is already a member of the %(listname)s mailing list, however you have also requested a global change of address. Upon confirmation, any other mailing list containing the address %(safeuser)s will be changed.
hr: Nova adresa koju ste zatra¾ili %(newaddr)s je veæ èlan %(listname)s mailing liste, ali ste ujedno zatra¾ili globalnu promjenu adrese. Nakon potvrde, bilo koja druga lista koja sadr¾i adresu %(safeuser)s bit æe promjenjena.
ro: Noua adresã %(newaddr)s pe care aþi cerut-o este deja abonatã la lista de discuþii %(listname)s; totuºi, aþi solicitat o modificare globalã a adresei. Pânã la confirmare, toate celelalte liste de discuþii conþinând adresa %(safeuser)s vor fi modificate.
tr: Ýstediðiniz yeni adres %(newaddr)s, zaten %(listname)s mesaj listesinin bir üyesi, ancak ayrýca global bir adres deðiþikliði istediniz. Onay sonrasýnda %(safeuser)s adresini içeren tüm diðer mesaj listeleri deðiþtirilecek.

source: The new address is already a member: %(newaddr)s
hr: Nova adresa je veæ èlan: %(newaddr)s
ro: Noua adresã este deja abonatã: %(newaddr)s
tr: Yeni adres zaten bir üye: %(newaddr)s

source: Addresses may not be blank
hr: Adrese ne smiju biti prazne
ro: Adresele nu pot fi nule
tr: Adresler boþ olamaz

source: A confirmation message has been sent to %(newaddr)s.
hr: Potvrdna purka je poslana na %(newaddr)s.
ro: Un mesaj de confirmare a fost trimis la %(newaddr)s.
tr: %(newaddr)s adresine bir onay mesajý gönderildi.

source: Bad email address provided
hr: Dana je kriva e-mail adresa
ro: Adresã de email eronatã
tr: Kötü e-posta adresi verildi

source: Illegal email address provided
hr: Dana je pogre¹na e-mail adresa
ro: Adresã de email ilegalã
tr: Geçersiz e-posta adresi verildi

source: %(newaddr)s is already a member of the list.
hr: %(newaddr)s je veæ èlan liste.
ro: %(newaddr)s este deja abonatã pe listã.
tr: %(newaddr)s zaten listenin bir üyesi.

source: Member name successfully changed.
hr: Èlansko ime je uspje¹no promjenjeno.
ro: Numele abonatului a fost modificat cu succes.
tr: Üye ismi baþarýyla deðiþtirildi.

source: Passwords may not be blank
hr: Lozinke ne smiju biti prazne
ro: Parolele nu pot fi nule
tr: Þifreler boþ olamaz

source: Passwords did not match!
hr: Lozinke se ne podudaraju!
ro: Parolele nu se potrivesc!
tr: Þifreler birbiriyle eþleþmedi!

source: Password successfully changed.
hr: Lozinka je uspje¹no promjenjena.
ro: Parola a fost modificatã cu succes.
tr: Þifre baþarýyla deðiþtirildi.

source: You must confirm your unsubscription request by turning on the checkbox below the <em>Unsubscribe</em> button. You have not been unsubscribed!
hr: Va¹ zahtjev za odjavom morate potvrditi ukljuèivanjem polja ispod <em>Odjava</em> gumba. Niste odjavljeni!
ro: Trebuie sã confirmaþi cererea dumneavoastrã de pãrãsire a listei prin bifarea cãsuþei de sub butonul <em>Dezabonare</em>. Nu aþi fost scos de pe listã!
tr: Üyelikten çýkma isteðinizi onaylamak için <em>Üyelikten Çýk</em> düðmesinin altýndaki onay kutusunu seçmeniz gerekir. Listeden çýkarýlmadýnýz!

source: Unsubscription results
hr: Rezultati odjave
ro: Rezultatele dezabonãrii
tr: Listeden çýkma sonuçlarý

source: Your unsubscription request has been received and forwarded on to the list moderators for approval. You will receive notification once the list moderators have made their decision.
hr: Va¹ zahtjev za odjavom je primljen, te je prosljeðen moderatoru liste na odobrenje. Kada moderator liste napravi odluku primit æete obavijest.
ro: Cererea dumneavoastrã de pãrãsire a listei a fost primitã ºi înaintatã moderatorilor listei pentru aprobare. Veþi primi o notificare de îndatã ce aceºtia vor lua o decizie.
tr: Üyelikten çýkma isteðiniz alýndý ve onay için liste moderatörlerine iletildi. Liste moderatörleri karar verdiði zaman bir bildirim alacaksýnýz.

source: You have been successfully unsubscribed from the mailing list %(fqdn_listname)s. If you were receiving digest deliveries you may get one more digest. If you have any questions about your unsubscription, please contact the list owners at %(owneraddr)s.
hr: Uspje¹no ste odjavljeni sa mailing liste %(fqdn_listname)s. Ako ste primali digest poruke mo¾e se dogoditi da primite jo¹ jednu takvu poruku. Ako imate bilo kakvih pitanja u vezi va¹e odjave, kontaktirajte vlasnike liste na %(owneraddr)s.
ro: Aþi pãrãsit cu succes lista de %(fqdn_listname)s. Dacã aþi fost abonat la varianta unui singur rezumat zilnic, s-ar putea sã mai primiþi un ultim mesaj. Dacã aveþi orice întrebãri despre dezabonarea dumneavoastrã, vã rugãm sã contactaþi proprietarii listei la adresa %(owneraddr)s.
tr: %(fqdn_listname)s mesaj listesinden baþarýyla çýktýnýz. Eðer toplu gönderim ile mesaj alýyor idiyseniz son bir mesaj alabilirsiniz. Listeden çýkmanýzla ilgili herhangi bir sorunuz varsa %(owneraddr)s adresinden liste sahipleri ile baðlantýya geçebilirsiniz.
