Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: digest header
hr: zaglavlje digesta
ro: introducere rezumat
tr: toplu mesaj baþlýðý

source: Digest Header
hr: Zaglavlje Digesta
ro: Prefaþã la rezumat
tr: Toplu Mesaj Baþlýðý

source: Today's Topics:
hr: Dana¹nje Teme:
ro: Topicile de azi:
tr: Günün Konularý:

source: Today's Topics (%(msgcount)d messages)
hr: Dana¹nje Teme (%(msgcount)d poruka)
ro: Topicile de azi: (%(msgcount)d mesaje)
tr: Günün Konularý (%(msgcount)d mesaj)

source: [Message discarded by content filter]
ro: [Mesaj ignorat de filtrul de conþinut]s

source: digest footer
hr: podno¾je digesta
ro: text de încheiere al ediþiei
tr: toplu mesaj altbilgisi

source: Digest Footer
hr: Podno¾je Digesta
ro: Textul de încheiere al ediþiei
tr: Toplu Mesaj Altbilgisi

source: End of
hr: Kraj
ro: Sfârºitul
tr: Son:

source: Posting of your message titled "%(subject)s"
hr: Slanje poruke naslovljene "%(subject)s"
ro: Public mesajul dumneavoastrã intitulat: "%(subject)s"
tr: "%(subject)s" baþlýklý mesajýnýzýn gönderimi

source: [No reason given]
hr: [Razlog nije dat]
ro: [Fãrã motiv]
tr: [Neden belirtilmedi]

source: Forward of moderated message
hr: Prosljeðivanje moderirane poruke
ro: Forwardez mesajul moderat
tr: Moderasyon onaylý mesajýn iletimi

source: New subscription request to list %(realname)s from %(addr)s
hr: Novi zahtjev za pretplatom na listu %(realname)s sa %(addr)s
ro: Cerere nouã de abonare la lista %(realname)s de la %(addr)s
tr: %(addr)s adresinden, %(realname)s listesine yeni üyelik isteði

source: Subscription request
hr: Zahtjev za pretplatom
ro: Cerere de abonare
tr: Üyelik isteði

source: New unsubscription request from %(realname)s by %(addr)s
hr: Novi zahtjev za odjavom od %(realname)s sa %(addr)s
ro: Cerere nouã de pãrãsire a listei %(realname)s de cãtre %(addr)s
tr: %(addr)s adresinden, %(realname)s listesinden çýkma isteði

source: Unsubscription request
hr: Zahtjev za odjavom
ro: Cerere de pãrãsire
tr: Üyelikten çýkma isteði

source: Original Message
hr: Izvorna Poruka
ro: Mesaj original
tr: Özgün Mesaj

source: Request to mailing list %(realname)s rejected
hr: Zahtjev na mailing listi %(realname)s je odbijen
ro: Cerera cãtre lista %(realname)s a fost respinsã
tr: %(realname)s mesaj listesine istek reddedildi

source: The mailing list `%(listname)s' has been created via the through-the-web interface. In order to complete the activation of this mailing list, the proper /etc/aliases (or equivalent) file must be updated. The program `newaliases' may also have to be run. Here are the entries for the /etc/aliases file:
hr: Mailing lista `%(listname)s' je kreirana preko web suèelja. Da biste zavr¹ili sa aktivacijom ove mailing liste, odgovarajuæa /etc/aliases (ili ista) datoteka moraju biti uploadani. Takoðer, program `newaliases' mo¾da treba biti pokrenut. Ovdje su stavke za /etc/aliases datoteku:
ro: Lista de discuþii '%(listname)s' a fost creatã prin intermediul interfeþei web. Pentru a completa activarea acestei liste, fiºierul corespunzãtor /etc/aliases (sau echivalent) trebuie actualizat. S-ar putea, de asemenea, sã fiþi nevoit sã rulaþi programul 'newaliases'. Acestea sunt datele din fiºierul /etc/aliases:
tr: `%(listname)s' mesaj listesi, web arayüzü kullanýlarak yaratýldý. Listenin etkinleþtirmesinin tamamlanmasý için uygun /etc/aliases (veya eþdeðeri) dosyasýnýn güncellenmesi gerekiyor. Ayrýca `newaliases' programýnýn da çalýþtýrýlmasý gerekebilir. /etc/aliases dosyasýna eklenmesi gereken satýrlar:

source: To finish creating your mailing list, you must edit your /etc/aliases (or equivalent) file by adding the following lines, and possibly running the `newaliases' program:
hr: Da biste zavr¹ili sa kreiranjem svoje mailing liste, morate urediti /etc/aliases (ili odgovarajuæu) datoteku dodavanjem sljedeæih linija i po potrebi pokretanjem `newaliases' programa:
ro: Pentru a încheia crearea listei dumneavoastrã de discuþii, trebuie sã modificaþi fiºierul /etc/aliases (sau echivalentul acestuia) prin adãugarea urmãtoarelor linii, ºi probabil prin rularea programului 'newaliases':
tr: Mesaj listenizini etkinleþtirilmesini tamamlamanýz için /etc/aliases (veya eþdeðeri) dosyanýzý düzenleyerek aþaðýdaki satýrlarý eklemeniz ve olasýlýkla `newaliases' programýný çalýþtýrmanýz gerekir:

source: ## %(listname)s mailing list
hr: ## %(listname)s mailing lista
ro: ## Lista de discuþii %(listname)s
tr: ## %(listname)s mesaj listesi

source: Mailing list creation request for list %(listname)s
hr: Zahtjev za kreiranjem mailing liste za listu %(listname)s
ro: Cerere de creare de listã nouã pentru %(listname)s
tr: %(listname)s listesi için liste oluþturma isteði

source: The mailing list `%(listname)s' has been removed via the through-the-web interface. In order to complete the de-activation of this mailing list, the appropriate /etc/aliases (or equivalent) file must be updated. The program `newaliases' may also have to be run. Here are the entries in the /etc/aliases file that should be removed:
hr: Mailing lista `%(listname)s' je uklonjena preko web suèelja. Da biste zavr¹ili sa deaktivacijom ove mailing liste, odgovarajuæa /etc/aliases (ili ista) datoteka moraju biti uploadani. Takoðer, program `newaliases' mo¾da treba biti pokrenut. Ovdje su stavke za /etc/aliases datoteku koje trebaju biti uklonjene:
ro: ista de discuþii '%(listname)s' a fost ºtearsã prin intermediul interfeþei web. Pentru a încheia dezactivarea acestei liste de discuþii, fiºierele corespunzãtoare /etc/aliases (sau echivalente) trebuie actualizate. De asemenea, s-ar putea sã trebuiascã sã rulaþi programul 'newaliases'. Iatã liniile din fiºierul /etc/aliases ce trebuie ºterse:
tr: `%(listname)s' mesaj listesi, web arayüzü kullanýlarak silindi. Listenin siliminin tamamlanmasý için uygun /etc/aliases (veya eþdeðeri) dosyasýnýn güncellenmesi gerekiyor. Ayrýca `newaliases' programýnýn da çalýþtýrýlmasý gerekebilir. /etc/aliases dosyasýndan silinmesi gereken satýrlar:

source: To finish removing your mailing list, you must edit your /etc/aliases (or equivalent) file by removing the following lines, and possibly running the `newaliases' program: ## %(listname)s mailing list
hr: Da biste zavr¹ili sa uklanjanjem svoje mailing liste, morate urediti /etc/aliases (ili odgovarajuæu) datoteku uklanjanjem sljedeæih linija, i po potrebi pokretanjem `newaliases' programa: ## %(listname)s mailing lista
ro: Pentru a încheia ºtergerea listei dumneavoastrã, trebuie sã modificaþi fiºierul /etc/aliases (sau echivalentul acestuia), pentru a ºterge urmãtoarele linii, ºi eventual sã rulaþi programul 'newaliases': ## %(listname)s mailing list
tr: Mesaj listenizini silimini tamamlamanýz için /etc/aliases (veya eþdeðeri) dosyanýzý düzenleyerek aþaðýdaki satýrlarý silmeniz ve olasýlýkla `newaliases' programýný çalýþtýrmanýz gerekir: ## %(listname)s mesaj listesi

source: Mailing list removal request for list %(listname)s
hr: Zahtjev za uklanjanjem mailing liste za listu %(listname)s
ro: Cerere de ºtergere a listei de discuþii %(listname)s
tr: %(listname)s mesaj listesi için silme isteði

source: checking permissions on %(file)s
hr: provjeravam dozvole za %(file)s
ro: verific permisiunile pentru %(file)s
tr: %(file)s dosyasý üzerindeki haklar denetleniyor

source: %(file)s permissions must be 066x (got %(octmode)s)
hr: %(file)s dozvole moraju biti 066x (imam %(octmode)s)
ro: Permisiunile %(file)s trebuie sã fie 066x (sunt octmode)s)
tr: %(file)s haklarý 066x olmalý (%(octmode)s görüldü)

source: (fixing)
hr: (popravljam)
ro: (rezolv)
tr: (düzeltiliyor)

source: checking ownership of %(dbfile)s
hr: provjeravam vlasni¹tvo %(dbfile)s
ro: verific posesorul fiºierelor %(dbfile)s
tr: %(dbfile)s dosyasýnýn sahipliði denetleniyor

source: %(dbfile)s owned by %(owner)s (must be owned by %(user)s
hr: %(dbfile)s vlasni¹tvo %(owner)s (mora biti u vlasni¹tvu %(user)s
ro: %(dbfile)s este deþinut de %(owner)s (trebuie sã fie deþinut de %(user)s
tr: %(dbfile)s sahibi %(owner)s (%(user)s olmalý

source: Your confirmation is required to join the %(listname)s mailing list
ro: Este necesarã confirmarea dumneavoastrã pentru abonarea la lista de discuþii %(listname)s

source: Your confirmation is required to leave the %(listname)s mailing list
ro: Este necesarã confirmarea dumneavoastrã pentru pãrãsirea listei de discuþii %(listname)s

source: from %(remote)s
hr: od %(remote)s
ro: de %(remote)s
tr: %(remote)s adresinden

source: subscriptions to %(realname)s require moderator approval
hr: prtplate na %(realname)s zahtjevaju odobrenje moderatora
ro: abonamentele la %(realname)s necesitã aprobarea moderatorului
tr: %(realname)s listesine üyelikler moderatör onayý gerektirir

source: %(realname)s subscription notification
hr: %(realname)s obavijest o pretplati
ro: notificare de abonare la %(realname)s
tr: %(realname)s üyelik bildirimi

source: unsubscriptions require moderator approval
hr: odjava treba odobrenje moderatora
ro: pãrãsirea listei necesitã aprobarea moderatorului
tr: üyelikten çýkmak moderatör onayý gerektirir

source: %(realname)s unsubscribe notification
hr: %(realname)s obavijest o odjavi
ro: notificare de pãrãsire a listei %(realname)s
tr: %(realname)s üyelikten çýkma bildirimi

source: subscriptions to %(name)s require administrator approval
hr: pretplata na %(name)s treba odobrenje administratora
ro: abonarea la %(name)s necesitã aprobarea administratorului
tr: %(name)s listesine üyelikler moderatör onayý gerektirir

source: Last autoresponse notification for today
hr: Posljednja obavijest o automatskom odgovoru za danas
ro: Ultima notificare de rãspuns automat de azi
tr: Bugün için son otomatik yanýt bildirimi

source: The attached message was received as a bounce, but either the bounce format was not recognized, or no member addresses could be extracted from it. This mailing list has been configured to send all unrecognized bounce messages to the list administrator(s). For more information see: %(adminurl)s
hr: Poruka u privitku je primljena kao odbijena poruka, meðutim ili odbijeni format nije prepoznat, ili nikakva èlanska adresa nije mogla biti izvuèena iz iste. Ova mailing lista je konfiguriran da ¹alje sve neprepoznate odbijene poruke administrator(ima) liste. Za vi¹e informacija pogledajte: %(adminurl)s
ro: Mesajul ataºat a fost recepþionat ca un eºec, însã formatul de notificare de eºec nu este recunoscut, sau nu am putut extrage nici o adresã de abonat din sursã. Aceastã listã de discuþii a fost configuratã sã trimitã toate mesajele de eºec nerecunoscute cãtre administratorii listei. Pentru mai multe detalii, urmãriþi: %(adminurl)s
tr: Ekteki mesaj bir geri dönüþ olarak alýndý, fakat ya geri dönüþ biçimi algýlanamadý, ya da mesajda bir üye adresi bulunamadý. Bu mesaj listesi algýlanamayan tüm geri dönüþ mesajlarýný liste yöneticilerine gönderecek þekilde ayarlanmýþ. Daha fazla bilgi için þu sayfaya gidin: %(adminurl)s

source: Uncaught bounce notification
hr: Neuhvaæena obavijest o odbijanju
ro: Notificare de eºec neînregistratã
tr: Algýlanamamýþ geri dönüþ bildirimi

source: Ignoring non-text/plain MIME parts
hr: Ignoriram ne-tekst/obiène MIME djelove
ro: Ignor pãrþile non-text/MIME
tr: text/plain olmayan MIME bölümler gözardý ediliyor

source: The results of your email command are provided below. Attached is your original message.
hr: Rezultati va¹e e-mail komande su dolje prikazani. U privitku je va¹a izvorna poruka.
ro: Rezultatele mesajului dumneavoastrã de comandã sunt prezentate mai jos. Ataºat aveþi mesajul original.
tr: E-posta komutunuzun sonuçlarý aþaðýda verildi. Özgün mesajýnýz ektedir.

source: - Results:
hr: - Rezultati:
ro: - Rezultate:
tr: - Sonuçlarý:

source: - Unprocessed:
hr: - Neobraðeno:
ro: - Neprocesat:
tr: - Ýþlenmedi:

source: No commands were found in this message. To obtain instructions, send a message containing just the word "help".
hr: Komande nisu pronaðene u ovoj poruci. Da biste dobili upute, po¹aljite poruku koja sadr¾i samo rijeè "help".
ro: Nu au fost gãsite comenzi în acest mesaj. Pentru a obþine instrucþiuni, trimiteþi un mesaj conþinând doar cuvântul "help".
tr: Bu mesajda herhangi bir komut bulunamadý. Bilgileri almak için, sadece "help" sözcüðünü içeren bir mesaj gönderin.

source: - Ignored:
hr: - Ignorirano:
ro: - Ignorat:
tr: - Gözardý edildi:

source: - Done.
hr: - Gotovo.
ro: - Gata.
tr: - Yapýldý.

source: The results of your email commands
hr: Rezultati va¹ih e-mail komandi
ro: Rezultatele mesajului dumneavoastrã de comandã
tr: E-posta komutlarýnýzýn sonuçlarý

source: Delivered by Mailman<br>version %(version)s
hr: Dostavljeno od strane Mailmana<br>verzija %(version)s
ro: Livrat de Mailman<br>versiunea %(version)s
tr: Mailman ile gönderildi<br>sürüm %(version)s

source: Python Powered
ro: Motorizat de Python
tr: Python ile Güçlendirilmiþ

source: Gnu's Not Unix
ro: GNU nu este UNIX
tr: Gnu Unix Deðildir

source: Mon
hr: Pon
ro: Lun
tr: Pzt

source: Thu
hr: Èet
ro: Joi
tr: Per

source: Tue
hr: Uto
ro: Mar
tr: Sal

source: Wed
hr: Sri
ro: Mie
tr: Çar

source: Fri
hr: Pet
ro: Vin
tr: Cum

source: Sat
hr: Sub
ro: Sâm
tr: Cmt

source: Sun
hr: Ned
ro: Dum
tr: Paz

source: Jan
hr: Sij
ro: Ian
tr: Oca

source: Jun
hr: Lip
ro: Iun
tr: Haz

source: Jul
hr: Srp
ro: Iul
tr: Tem

source: Nov
hr: Stu
ro: Noi
tr: Kas

source: Server Local Time
hr: Lokalno Vrijeme Servera
ro: Ora localã pe server
tr: Sunucu Yerel Zamaný

source: Already a member: %(member)s
ro: Este deja membru: %(member)s

source: Bad/Invalid email address: blank line
ro: Adresã eronatã/invalidã: rând gol

source: Bad/Invalid email address: %(member)s
ro: Adresã eronatã/invalidã: %(member)s

source: Hostile address (illegal characters): %(member)s
ro: Adresã ostilã (caractere ilegale): %(member)s

source: Subscribed: %(member)s
ro: A fost abonat: %(member)s

source: Bad argument to -w/--welcome-msg: %(arg)s
ro: Argument eronat pentru -w/--welcome-msg: %(arg)s

source: Bad argument to -a/--admin-notify: %(arg)s
ro: Argument eronat pentru -a/--admin-notify: %(arg)s

source: Cannot read both digest and normal members from standard input.
ro: Nu pot citi nici membrii abonaþi normal ºi nici membrii abonaþi la rezumatul zilnic din datele standard de intrare.

source: No such list: %(listname)s
ro: Nu ecistã o astfel de listã: %(listname)s

source: Nothing to do.
ro: Nimic de fãcut.

source: Rebuild a list's archive. Use this command to rebuild the archives for a mailing list. You may want to do this if you edit some messages in an archive, or remove some messages from an archive. Usage: %(PROGRAM)s [options] <listname> [<mbox>] Where options are: -h / --help Print this help message and exit. -q / --quiet Make the archiver output less verbose. --wipe First wipe out the original archive before regenerating. You usually want to specify this argument unless you're generating the archive in chunks. -s N --start=N Start indexing at article N, where article 0 is the first in the mbox. Defaults to 0. -e M --end=M End indexing at article M. This script is not very efficient with respect to memory management, and for large archives, it may not be possible to index the mbox entirely. For that reason, you can specify the start and end article numbers. Where <mbox> is the path to a list's complete mbox archive. Usually this will be some path in the archives/private directory. For example: %% bin/arch mylist archives/private/mylist.mbox/mylist.mbox <mbox> is optional. If it is missing, it is calculated.
ro: Reconstruieºte arhiva unei liste. Folosiþi aceastã comandã pentru a reconstrui arhiva unei liste de discuþii. S-ar putea sã doriþi acest lucru în urma editãrii sau ºtergerii unor mesaje din arhivã. Folosire: %(PROGRAM)s [opþiuni] <numelistã> [<mbox>] Unde opþiunile sunt: -h / --help Afiºeazã acest mesaj de ajutor ºi terminã execuþia programului -q / --quiet Afiºeazã mai puþine detalii la procesare. --wipe ªterge mai întâi arhiva originalã înainte de regenerare. De obicei veþi dori sã folosiþi aceastã facilitate, excepþie fãcând cazurile în care regeneraþi arhiva pe bucãþi. -s N --start=N Începe indexarea la articolul N, unde 0 este primul articol din mbox. Valoarea predefinitã este 0. -e M --end=M Terminã indexarea la articolul M. Acest script nu este foarte eficient în privinþa memoriei utilizate, ºi în cazul unor arhive mari, este posibil sã nu puteþi indexa întregul mbox. Din acest motiv, puteþi specifica articolele de start ºi de sfârºit pentru indexare. Unde <mbox> este calea cãtre arhiva completã mbox a listei. De obicei, aceasta va fi o cale spre directorul archives/private. De exemplu %% bin/arch mylist archives/private/mylist.mbox/mylist.mbox <mbox> este opþional. Dacã lipseºte, va fi calculat.

source: listname is required
ro: numele listei este necesar

source: No such list "%(listname)s" %(e)s
ro: Nu existã o astfel de listã: "%(listname)s" %(e)s

source: Cannot open mbox file %(mbox)s: %(msg)s
ro: Nu pot deschide fiºierul mbox %(mbox)s: %(msg)s

source: Fix the MM2.1b4 archives. Usage: %(PROGRAM)s [options] file ... Where options are: -h / --help Print this help message and exit. Only use this to `fix' some archive database files that may have gotten written in Mailman 2.1b4 with some bogus data. Use like this from your $PREFIX directory %% %(PROGRAM)s `grep -l _mlist archives/private/*/database/*-article` (note the backquotes are required) You will need to run `bin/check_perms -f' after running this script.
ro: Corecteazã arhivele MM2.1b4. Folosire: %(PROGRAM)s [opþiuni] fiºier ... Unde opþiunile sunt: -h / --help Afiºeazã acest mesaj de ajutor ºi terminã execuþia programului Folosiþi aceastã comandã numai pentru repararea unor baze de date ce ar fi putut fi scrise în Mailman 2.1b4 ºi care pot conþine date eronate. Folosiþi scriptul de mai jos în directorul $PREFIX : %% %(PROGRAM)s `grep -l _mlist archives/private/*/database/*-article` (luaþi aminte, ghilimelele inverse sunt obligatorii) Va trebui sã rulaþi `bin/check_perms -f' dupã rularea acestui script.

source: Bad arguments: %(strargs)s
ro: Argumente eronate: %(strargs)s

source: Empty list passwords are not allowed
ro: Nu sunt permise parole nule pentru listã

source: New %(listname)s password: %(notifypassword)s
ro: Noua parolã a listei %(listname)s: %(notifypassword)s

source: Your new %(listname)s list password
ro: Noua parolã pentru lista %(listname)s

source: The site administrator at %(hostname)s has changed the password for your mailing list %(listname)s. It is now %(notifypassword)s Please be sure to use this for all future list administration. You may want to log in now to your list and change the password to something more to your liking. Visit your list admin page at %(adminurl)s
ro: Administratorul site-ului de la adresa %(hostname)s v-a modificat parola de acces la lista de discuþii %(listname)s. Aceasta este acum %(notifypassword)s Asiguraþi-vã cã o veþi folosi pentru administrarea ulterioarã a listei. Puteþi intra acum în secþiunea de administrare a listei dumneavoastrã, pentru a schimba parola cu una mai convenabilã. Pagina de administrare a listei dumneavoastrã este %(adminurl)s

source: No list named:
ro: Nu existã lista cu numele:

source: List:
ro: Lista:

source: %(file)s: okay
ro: %(file)s: OK

source: checking gid and mode for %(path)s
ro: verific gid ºi mode pentru %(path)s

source: %(path)s bad group (has: %(groupname)s, expected %(MAILMAN_GROUP)s)
ro: grup eronat %(path)s (are %(groupname)s, trebuie sã aibã %(MAILMAN_GROUP)s)

source: directory permissions must be %(octperms)s: %(path)s
ro: permisiunile de director trebuie sã fie %(octperms)s: %(path)s

source: source perms must be %(octperms)s: %(path)s
ro: permisiunile pe surse trebuie sã fie %(octperms)s: %(path)s

source: article db files must be %(octperms)s: %(path)s
ro: fiºierele articol db trebuie sã fie %(octperms)s: %(path)s

source: checking mode for %(prefix)s
ro: verific permisiunile pentru %(prefix)s

source: WARNING: directory does not exist: %(d)s
ro: ATENÞIE: nu existã directorul: %(d)s

source: directory must be at least 02775: %(d)s
ro: directorul trebuie sã aibã cel puþin 02775: %(d)s

source: checking perms on %(private)s
ro: verific permisiunile la %(private)s

source: %(private)s must not be other-readable
ro: %(private)s nu trebuie sã poatã fi citit de alþii

source: mbox file must be at least 0660:
ro: Permisiunile fiºierului mbox trebuie sã fie mãcar 0660

source: %(dbdir)s "other" perms must be 000
ro: "restul" permisiunilor %(dbdir)s trebuie sã fie 000

source: checking cgi-bin permissions
ro: verific permisiunile cgi-bin

source: checking set-gid for %(path)s
ro: verific set-gid pentru %(path)s

source: %(path)s must be set-gid
ro: %(path)s trebuie sã aibã set-gid

source: checking set-gid for %(wrapper)s
ro: verific set-gid pentru %(wrapper)s

source: %(wrapper)s must be set-gid
ro: %(wrapper)s trebuie sã aibã set-gid

source: checking permissions on %(pwfile)s
ro: verific permisiunile pentru %(pwfile)s

source: %(pwfile)s permissions must be exactly 0640 (got %(octmode)s)
ro: permisiunile pentru %(pwfile)s trebuie sã fie exact 0640 (am detectat %(octmode)s)

source: checking permissions on list data
ro: verific permisiunile pe datele listei

source: checking permissions on: %(path)s
ro: verific permisiunile la: %(path)s

source: file permissions must be at least 660: %(path)s
ro: permisiunile de fiºier trebuie sã fie cel puþin 660: %(path)s

source: No problems found
ro: Nu sunt probleme

source: Problems found:
ro: Probleme gãsite:

source: Re-run as %(MAILMAN_USER)s (or root) with -f flag to fix
ro: Re-rulaþi ca ºi %(MAILMAN_USER)s (sau root) cu opþiunea -f pentru a repara

source: Clean up an .mbox archive file. The archiver looks for Unix-From lines separating messages in an mbox archive file. For compatibility, it specifically looks for lines that start with "From " -- i.e. the letters capital-F, lowercase-r, o, m, space, ignoring everything else on the line. Normally, any lines that start "From " in the body of a message should be escaped such that a > character is actually the first on a line. It is possible though that body lines are not actually escaped. This script attempts to fix these by doing a stricter test of the Unix-From lines. Any lines that start "From " but do not pass this stricter test are escaped with a > character. Usage: cleanarch [options] < inputfile > outputfile Options: -s n --status=n Print a # character every n lines processed -q / --quiet Don't print changed line information to standard error. -n / --dry-run Don't actually output anything. -h / --help Print this message and exit
ro: Curãþã un fiºier arhivã .mbox. Agentul de arhivare cautã linii de tipul Unix-From de separare a mesajelor dintr-o arhivã mbox. Pentru compatibilitate, cautã exact liniile care încep cu "From" -- (litera mare F,literele mici r, o, m ºi un spaþiu), ignorând orice alt text din linie. În mod normal, liniile ce încep cu "From" în corpul unui mesaj ar trebui mascate (escaped), astfel încât primul caracter pe o linie sã fie >. Este posibil totuºi ca aceste linii sã nu fie mascate (escaped). Acest script încearcã sã rezolve problemele, efectuînd un test mai strict pe liniile de tipul Unix-From. Orice linii care încep cu "From" dar nu trec acest test strict sunt mascate (escaped) cu un caracter >. Folosire: cleanarch [opþiuni] < fiºierintrare > fiºierieºire Opþiuni: -s n --status=n Pune un caracter # la fiecare n linii procesate -q / --quiet Nu tipãreºte informaþii despre liniile modificate -n / --dry-run Nu afiºeazã nimic. -h / --help Afiºeazã acest mesaj de ajutor ºi terminã execuþia

source: Unix-From line changed: %(lineno)d
ro: Linia Unix-From a fost modificatã: %(lineno)d

source: Bad status number: %(arg)s
ro: Numãr de stare eronat: %(arg)s

source: %(messages)d messages found
ro: %(messages)d mesaje gãsite
