Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: If your mailing list's default language uses a non-ASCII character set and the prefix contains non-ASCII characters, the prefix will always be encoded according to the relevant standards. However, if your prefix contains only ASCII characters, you may want to set this option to <em>Never</em> to disable prefix encoding. This can make the subject headers slightly more readable for users with mail readers that don't properly handle non-ASCII encodings. <p>Note however, that if your mailing list receives both encoded and unencoded subject headers, you might want to choose <em>As needed</em>. Using this setting, Mailman will not encode ASCII prefixes when the rest of the header contains only ASCII characters, but if the original header contains non-ASCII characters, it will encode the prefix. This avoids an ambiguity in the standards which could cause some mail readers to display extra, or missing spaces between the prefix and the original header.
hr: Ako va¹ poèetni jezik mailing liste koristi znakove koji nisu u ASCII skupu znakova, a prefiks sadr¾ava takoðer znakove koji nisu ASCII, tada æe prefiks uvijek biti kodiran prema va¾eæim standardima. Ipak, ako va¹ prefiks sadr¾i samo ASCII znakove, mo¾da biste ¾eljeli postaviti ovu opciju na <em>Nikada</em> da biste onemoguæili kodiranje prefiksa. Navedeno mo¾e zaglavlja naslova uèiniti ne¹to vi¹e preglednijima, za korisnike sa mail preglednicima koji nemaju dobru podr¹ku za rad sa znakovima koji ne pripadaju ASCII-u. <p>Primijetite, ipak, da ukoliko va¹a mailing lista prima i enkodirana i nekodirana zaglavlja naslova, mo¾ete izabrati <em>Prema potrebi</em>. Kori¹tenjem ove postavke, Mailman neæe kodirati ASCII prefikse kada ostatak zaglavlja sadr¾i samo ASCII znakove, ali ako izvorno zaglavlje sadr¾i znakove koji ne pripadaju ASCII-u, tada æe ga kodirati. Na ovaj naèin se izbjegava nejasnoæa u standardima, koja mo¾e uzrokovati to da neki mail preglednici prika¾u dodatne ili nepostojeæe razmake izmeðu prefiksa i izvornoga zaglavlja.
ro: Dacã limba implicitã a listei dumneavoastrã foloseºte un set de caractere non-ASCII ºi prefixul conþine caractere non-ASCII, atunci prefixul va fi totdeauna encodat folosind cele mai apropiate standarde. Totuºi, dacã prefixul dumneavoastrã conþine doar caractere ASCII puteþi seta aceastã opþiune la valoarea <em>Niciodatã</em> pentru a dezactiva encodarea prefixului. Acest fapt poate duce la headere de subiect ceva mai inteligibile pentru clienþii de e-mail ce nu suportã corect encodãrile non-ASCII. <p>Notaþi faptul cã totuºi, dacã lista dumneavoastrã primeºte atât headere de subiect encodate, cât ºi ne-encodate, va trebui sã alegeþi <em>Dupã caz</em>. Folosind aceastã opþiune, Mailman nu va encoda prefixele ASCII atunci când restul headerului conþine doar caractere ASCII, dar va encoda prefixul dacã headerul conþine ºi caractere non-ASCII. Astfel se eliminã o ambiguitate în standarde, ce ar putea determina unii clienþi de e-mail sã afiºeze spaþii în plus sau lipsã între prefix ºi headerul original.
tr: Eðer mesaj listenizin varsayýlan dili ASCII olmayan bir karakter seti kullanýyorsa ve önek ASCII olmayan karakterler içeriyorsa, önek her zaman ilgili standartlara göre kodlanacaktýr. Ancak önekinizde sadece ASCII karakterler varsa, bu seçeneði <em>Hiçbir zaman</em> olarak ayarlayýp önek kodlamasýný devre dýþý býrakabilirsiniz. Bu sayede ASCII olmayan kodlamalarý düzgün þekilde iþleyemeyen mesaj okuma programlarý kullanan kullanýcýlar için konu baþlýklarýnýn biraz daha okunabilir olmasýný saðlayabilirsiniz. <p>Ancak, mesaj listeniz hem kodlanmýþ hem kodlanmamýþ konu baþlýklarý alýyorsa, <em>Gerektiðinde</em> seçeneðini seçebilirsiniz. Bu sayede Mailman özgün baþlýðýn devamý sadece ASCII karakterler içeriyorsa ASCII önekleri kodlamaz, fakat özgün baþlýkta ASCII olmayan karakterler varsa önek kodlanýr. Bu, standartlardaki bir belirsizliði engeller ve bazý mesaj okuyucularýn önek ve özgün baþlýk arasýnda fazladan veya eksik boþluklar oluþmasýný önler.

source: Membership&nbsp;Management...
hr: Upravljanje&nbsp;èlanstvom...
ro: Abonamente
tr: Üyelik&nbsp;Yönetimi...

source: Membership&nbsp;List
hr: Lista&nbsp;èlanstva
ro: Abonaþi
tr: Üyelik&nbsp;Listesi

source: Mass&nbsp;Subscription
hr: Masovna&nbsp;pretplata
ro: Abonare în masã
tr: Yýðýn&nbsp;Üye&nbsp;Ekleme

source: Mass&nbsp;Removal
hr: Masovna&nbsp;odjava
ro: Dezabonare în masã
tr: Yýðýn&nbsp;Üye&nbsp;Çýkarma

source: Non-digest&nbsp;options
hr: Ne-digest&nbsp;opcije
ro: Opþiuni pentru mesajele individuale
tr: Toplu&nbsp;Olmayan&nbsp;Gönderim&nbsp;Seçenekleri

source: Policies concerning immediately delivered list traffic.
hr: Pravila koja se odnose na hitnu dostavu prometa liste.
ro: Politici de gestionare a mesajelor livrate imediat listei.
tr: Anýnda gönderilen liste trafiði ile ilgili ilkeler

source: Can subscribers choose to receive mail immediately, rather than in batched digests?
hr: Mogu li pretplatnici izabrati primanje normalnog maila, umjesto da isti primaju u digestima?
ro: Pot alege utilizatorii sã primeascã mesajele imediat, în loc de volume de rezumat?
tr: Üyeler toplu gönderim yerine mesajlarý anýnda almayý seçebilir mi?

source: Full Personalization
hr: Cjelokupna personalizacija
ro: Personalizare totalã
tr: Tam Kiþiselleþtirme

source: Should Mailman personalize each non-digest delivery? This is often useful for announce-only lists, but <a href="?VARHELP=nondigest/personalize">read the details</a> section for a discussion of important performance issues.
hr: Treba li Mailman personalizirati svaku ne-digest dostavu? Ovo je obièno korisno za samo-objava liste, ali za diskusiju o performansama <a href="?VARHELP=nondigest/personalize">proèitajte detalje</a>
ro: Sã personalizeze Mailman fiecare livrare individualã (non-digest)?. Acest fapt este deseori util în cazul listelor de anunþuri, dar citiþi <a href="?VARHELP=nondigest/personalize">secþiunea de detalii</a> pentru a vedea implicaþiile în performanþã.

source: When <a href="?VARHELP=nondigest/personalize">personalization</a> is enabled for this list, additional substitution variables are allowed in your headers and footers: <ul><li><b>user_address</b> - The address of the user, coerced to lower case. <li><b>user_delivered_to</b> - The case-preserved address that the user is subscribed with. <li><b>user_password</b> - The user's password. <li><b>user_name</b> - The user's full name. <li><b>user_optionsurl</b> - The url to the user's option page. </ul>
hr: Kada je <a href="?VARHELP=nondigest/personalize">personalizacija</a> omoguæena za ovu listu, dodatne zamjenske varijable su dozvoljene u va¹im zaglavljima i podno¾jima: <ul><li><b>korisnièka_adresa</b> - Adresa korisnika, zbijena u mala slova. <li><b>dostava_za_korisnika</b> - Adresa u kojoj su saèuvana velika i mala slova, preko koje je korisnik pretplaæen. <li><b>korisnièka_lozinka</b> - Lozinka korisnika. <li><b>korisnièko_ime</b> - Puno ime korisnika. <li><b>korisnièki_opcijeurl</b> - URL za stranicu sa korisnièkim opcijama. </ul>
ro: Când esse activatã <a href="?VARHELP=nodigest/personalize">personalizarea</a> pentru aceastã listã, sunt permise variabile de substituþie suplimentare în header ºi footer: <ul> <li><b>user_address</b> - adresa utilizatorului, forþatã la caractere minuscule;</li> <li><b>user_delivered_to</b> - adresa de abonare, cu caracterele iniþiale folosite la abonare;</li> <li><b>user_password</b> - parola utilizatorului;</li> <li><b>user_name</b> - numele întreg al utilizatorului;</li> <li><b>user_optionsurl</b> - adresa url cãtre pagina de opþiuni a utilizatorului;</li> </ul>

source: Header added to mail sent to regular list members
hr: Zaglavlje dodano na mail koji je poslan regularnim èlanovima liste
ro: Introducerea adãugatã mesajelor individuale trimise membrilor
tr: Ayrý ayrý mesaj alan liste üyelerine gönderilecek mesaja eklenecek baþlýk

source: Text prepended to the top of every immediately-delivery message.
hr: Tekst dodan na vrh svake poruke koja je spremna za hitnu dostavu.
ro: Textul introductiv adãugat înaintea oricãrui mesaj livrat imediat.
tr: Anýnda gönderilecek her mesajýn baþýna eklenecek yazý.

source: Footer added to mail sent to regular list members
hr: Podno¾je dodano mailu koji se ¹alje regularnim èlanovima liste
ro: Textul de încheiere adãugat mesajelor individuale trimise membrilor listei
tr: Ayrý ayrý mesaj alan liste üyelerine gönderilecek mesaja eklenecek altbilgi

source: Text appended to the bottom of every immediately-delivery message.
hr: Tekst dodan na dno svake poruke koja je spremna za hitnu dostavu.
ro: Textul de încheiere adãugat la sfârºitul fiecãrui mesaj livrat imediat.
tr: Anýnda gönderilecek her mesajýn sonuna eklenecek yazý.

source: Passwords
hr: Lozinke
ro: Parole
tr: Þifreler

source: Privacy options...
hr: Opcije privatnosti...
ro: Opþiuni de intimitate...
tr: Gizlilik Seçenekleri...

source: Subscription&nbsp;rules
hr: Pravila&nbsp;pretplate
ro: Reguli de abonare
tr: Üyelik&nbsp;kurallarý

source: Sender&nbsp;filters
hr: Po¹iljateljevi&nbsp;filteri
ro: Filtre expeditori
tr: Gönderici&nbsp;filtreleri

source: Recipient&nbsp;filters
hr: Primateljevi&nbsp;filteri
ro: Filtre recepþie
tr: Alýcý&nbsp;filtreleri

source: Spam&nbsp;filters
hr: Spam&nbsp;filteri
ro: Filtre SPAM
tr: Spam&nbsp;filtreleri

source: None
hr: Nijedan
ro: Nimic
tr: Yok

source: Require approval
hr: Treba odobrenje
ro: Necesitã aprobare
tr: Moderatör onayý

source: Confirm and approve
hr: Potvrdi i odobri
ro: Confirmare ºi aprobare
tr: Onay ve moderatör onayý

source: What steps are required for subscription?<br>
hr: Koji su koraci potrebni za pretplatu?
ro: Ce paºi sunt necesari pentru abonare?<br>
tr: Üyelik için hangi adýmlar gerekli?<br>

source: Confirm (*) - email confirmation required <br> Require approval - require list administrator approval for subscriptions <br> Confirm and approve - both confirm and approve <p>(*) when someone requests a subscription, Mailman sends them a notice with a unique subscription request number that they must reply to in order to subscribe.<br> This prevents mischievous (or malicious) people from creating subscriptions for others without their consent.
hr: Potvrdi (*) - potrebna je potvrda e-maila. <br> Treba odobrenje - potrebno je odobrenje administratora liste za pretplatu. <br> Potvrdi i odobri - potvrdi i odobri oboje. <p>(*) kada netko ¹alje zahtjev za pretplatu, Mailman mu ¹alje obavijest s jedinstvenim brojem pretplatnièkog zahtjeva na koji on mora odgovoriti da bi se pretplatio. Ovo sprjeèava zlonamjerne osobe od kreiranja pretplata za druge, bez njihovog pristanka.
ro: Confirnare (*) - confirmarea e-mailului este necesarã <br> Aprobarea este necesarã - necesitã aprobarea abonãrii de cãtre administratorul listei <br> Confirmare ºi aprobare - atât confirmarea e-mailului, cât ºi aprobarea administratorului listei sunt necesare.<br> <p>(*) când cineva solicitã o abonare, Mailman îi trimite o notã de confirmare, conþinând un cod unic de confirmare; pentru a se abona, utilizatorul trebuie sã rãspundã la aceastã notã de confirmare.<br /> Astfel se previne abonarea abuzivã, fãrã acordul utilizatorului.
tr: Onay (*) - e-posta onayý gerekir <br> Moderatör onayý - üyelik için liste yöneticisinin onayý gerekir <br> Onay ve moderatör onayý - hem onay, hem yönetici onayý <p> (*) bir kiþi üyelik istediði zaman Mailman ona, üye olmak için yanýtlamasý gereken, eþi olmayan bir üyelik istek numarasý gönderir.<br>Bu, zararlý (veya kötü niyetli) kiþilerin, baþkalarý adýna, onlarýn izni olmadan üyelikler yaratmasýný engeller.

source: This section allows you to configure subscription and membership exposure policy. You can also control whether this list is public or not. See also the <a href="%(admin)s/archive">Archival Options</a> section for separate archive-related privacy settings.
hr: Ovaj dio vam omoguæava da konfigurirate pretplatu i pravila privatnosti za èlanove. Takoðer mo¾ete kontrolirati da li je ova lista javna ili nije. Pogledajte dio <a href="%(admin)s/archive">Opcije arhive</a> za odvojene postavke koje se tièu arhive.
ro: Aceastã secþiune vã permite configurarea politicii de afiºare a datelor de abonare. De asemenea, puteþi decide dacã aceasta este o listã publicã sau nu. Vezi ºi secþiunea <a href="%(admin)s/archive">Opþiuni de arhivare</a> pentru setãri separate ale confidenþialitãþii arhivelor.
tr: Bu bölüm, üyelik ilkelerini yapýlandýrmanýzý saðlar. Ayrýca bu listenin herkese açýk olup olmayacaðýný da kontrol edebilirsiniz. Ayrýca <a href="%(admin)s/archive">Arþivleme Seçenekleri</a> bölümünde arþivle ilgili gizlilik ayarlarýný yapabilirsiniz.

source: Subscribing
hr: Pretplaæujem se
ro: Abonarea
tr: Üyelik

source: Advertise this list when people ask what lists are on this machine?
hr: Oglasi ovu listu kada ljudi pitaju koje sve liste postoje na ovoj ma¹ini?
ro: Afiºez aceastã listã atunci când vizitatorii întreabã ce liste sunt disponibile pe acest server?
tr: Kiþiler bu sunucudaki listeleri sorguladýðýnda bu liste ilan edilsin mi?

source: Is the list moderator's approval required for unsubscription requests? (<em>No</em> is recommended)
hr: Jeli za odjavne zahtjeve potrebno odobrenje moderatora liste? (Preporuèuje se <em>Ne</em>)
ro: Este necesarã aprobarea moderatorului pentru cererile de pãrãsire a listei? (Recomandat: <em>Nu</em>)
tr: Listeden çýkma istekleri için liste moderatörünün onayý gerekiyor mu? (<em>Hayýr</em> önerilir)

source: When members want to leave a list, they will make an unsubscription request, either via the web or via email. Normally it is best for you to allow open unsubscriptions so that users can easily remove themselves from mailing lists (they get really upset if they can't get off lists!). <p>For some lists though, you may want to impose moderator approval before an unsubscription request is processed. Examples of such lists include a corporate mailing list that all employees are required to be members of.
hr: Kada èlanovi ¾ele napustiti listu, oni æe napraviti zahtjev za odjavom, ili preko web suèelja ili preko e-maila. Inaèe, za vas je najbolje da dozvolite otvorene odjave tako da se korisnici mogu lako ukloniti s mailing lista (Oni se stvarno znaju naljutiti ako ne mogu otiæi sa liste!). <p>Za neke liste, meðutim, mo¾da ¾elite omoguæiti odobrenje moderatora prije nego li je zahtjev za odjavom obraðen. Primjeri takvih lista ukljuèuju korporativne mailing liste na koje svi zaposlenici moraju biti pretplaæeni.
ro: Când abonaþii vor sã pãrãseascã lista, vor face o cerere de dezabonare, fie prin e-mail, fie pe web. În mod normal, cel mai bine e sã permiteþi pãrãsirea liberã a listei, astfel încât abonaþii sã se poatã dezabona cu uºurinþã (uneori devii foarte iritat dacã nu poþi pãrãsi o listã de discuþii!). <p>În cazul anumitor liste, totuºi, puteþi impune aprobarea moderatorului înainte ca cererea de pãrãsire a listei sã fie procesatã. Exemple de astfel de liste sunt cele impuse de marile companii, la care toþi angajaþii sunt obligaþi sã subscrie.
tr: Üyeler bir listeden çýkmak istediðinde, web veya e-posta yoluyla bir çýkma isteði yaparlar. Normalde sizin için en iyisi listeden çýkmalarýnýn onlara baðlý olmasýný saðlamaktýr, böylece kullanýcýlar kolayca mesaj listelerinden çýkabilirler (listelerden çýkamadýklarýnda gerçekten sinirlenebilirler!). <p>Ancak bazý listeler için, üyelikten çýkma isteklerine bir moderatör onayý koymak isteyebilirsiniz. Bu listelere örnek olarak tüm çalýþanlarýn üyesi olmak zorunda olduklarý kurum listeleri gösterilebilir.

source: Ban list
hr: Crna lista
ro: Lista neagrã
tr: Yasak listesi

source: List of addresses which are banned from membership in this mailing list.
hr: Lista adresa kojima je zabranjeno èlanstvo na ovoj mailing listi.
ro: Lista adreselor care au interdicþie de abonare la aceastã listã de discuþii.
tr: Bu mesaj listesine üye olmalarý yasak olan adreslerin listesi.

source: Addresses in this list are banned outright from subscribing to this mailing list, with no further moderation required. Add addresses one per line; start the line with a ^ character to designate a regular expression match.
hr: Adresama na ovoj listi je zauvijek zabranjeno pretplaæivanje, bez daljnje potrebe za moderiranjem. Dodajte adrese jednu po liniji; zapoènite liniju sa znakom ^ da biste ostvarili regular expression podudaranje.
ro: Adresele din aceastã listã
tr: Bu listedeki adreslerin baþka bir onay olmasý gerekmeksizin bu mesaj listesine üye olmasý yasaklanmýþtýr. Her satýra bir adres olacak þekilde ekleyin, bir ^ karakteri ile baþlayarak bir regular expression eþleþmesi belirleyebilirsiniz.

source: Membership exposure
hr: Èlanska izlo¾enost
ro: Afiºarea membrilor
tr: Üyelik gösterimi

source: Anyone
hr: Bilo tko
ro: Oricine
tr: Herkes

source: List admin only
hr: Samo admin liste
ro: Numai administratorii listei
tr: Sadece liste yöneticisi

source: List members
hr: Èlanovi liste
ro: Membrii listei
tr: Liste üyeleri

source: Who can view subscription list?
hr: Tko mo¾e gledati pretplatnièku listu?
ro: Cine poate afiºa lista abonaþilor?
tr: Üyelik listesini kim görebilir?

source: When set, the list of subscribers is protected by member or admin password authentication.
hr: Kada je ova opcija postavljena, lista pretplatnika je za¹tiæena autentikacijom koristeæi èlansku ili administratorsku lozinku.
ro: Odatã setat acest parametru, lista abonaþilor este protejatã prin acces cu parolã de abonat sau de administrator.
tr: Seçildiðinde, üye listesi bir üye veya yönetici þifre doðrulamasý ile korunur.

source: Show member addresses so they're not directly recognizable as email addresses?
hr: Prika¾i èlanske adrese tako da nisu izravno prepoznate kao e-mail adrese?
ro: Afiºez adresele membrilor astfel încât sã nu fie direct recunoscute ca fiind adrese de email?
tr: Üye adresleri doðrudan e-posta adresi olarak tanýnmayacak þekilde gösterilsin mi?

source: Setting this option causes member email addresses to be transformed when they are presented on list web pages (both in text and as links), so they're not trivially recognizable as email addresses. The intention is to prevent the addresses from being snarfed up by automated web scanners for use by spammers.
hr: Postavljanje ove opcije uzrokuje transformaciju èlanskih e-mail adresa kada su prikazane na web stranicama liste (kao tekst i kao linkovi), tako da nisu jednostavno prepoznate kao e-mail adrese. Namjera ovoga je da se sprijeèi potraga spammera za adresama.
ro: Setarea acestei opþiuni determinã transformarea adreselor membrilor afiºate pe listele web (atât ca ºi text, cât ºi ca link) astfel încât sã nu fie recunoscute imediat ca ºi adrese de email. Intenþia este de a preveni colectarea acestor adrese de scannerele automate folosite de spammeri.
tr: Bu seçeneði ayarlamak, web sayfalarýnda gösterildiðinde (hem yazý hem link olarak) üye e-posta adreslerinin ilk bakýþta e-posta adresi þeklinde görünmemesine neden olur. Bunun kullanýlmasýnýn nedeni adreslerin spam atan kiþilerin otomatik web tarayýcýlarý ile e-posta adreslerini web sayfalarýndan çalmalarýna engel olmaktýr.

source: When a message is posted to the list, a series of moderation steps are taken to decide whether a moderator must first approve the message or not. This section contains the controls for moderation of both member and non-member postings. <p>Member postings are held for moderation if their <b>moderation flag</b> is turned on. You can control whether member postings are moderated by default or not. <p>Non-member postings can be automatically <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >accepted</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">held for moderation</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >rejected</a> (bounced), or <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >discarded</a>, either individually or as a group. Any posting from a non-member who is not explicitly accepted, rejected, or discarded, will have their posting filtered by the <a href="?VARHELP=privacy/sender/generic_nonmember_action">general non-member rules</a>. <p>In the text boxes below, add one address per line; start the line with a ^ character to designate a <a href= "http://docs.python.org/library/re.html" >Python regular expression</a>. When entering backslashes, do so as if you were using Python raw strings (i.e. you generally just use a single backslash). <p>Note that non-regexp matches are always done first.
hr: Kada je poruka poslana na listu, poduzima se nekoliko moderacijskih koraka kako bi se odluèilo treba li moderator prvo odobriti istu ili ne. Ovaj dio sadr¾i kontrole za moderaciju poruka koje su poslali èlanovi, ali i onih koji to nisu. <p>Èlanske poruke su zadr¾ane na moderiranju ako je njihova <b>moderacijska zastavica</b> ukljuèena. Vi mo¾ete kontrolirati da li æe èlanske poruke odmah na poèetku biti moderirane ili neæe. <p>Poruke od osoba koje nisu èlanovi mogu biti automatski <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >odobrene</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">zadr¾ane za moderaciju</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >odbijene</a> ili <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >odbaèene</a> pojedinaèno ili grupno. Svaka poruka koju je poslala osoba koja nije èlan liste i koja nije eksplicitno prihvaæena, odbijena, ili odbaèena biti æe filtrirana po <a href="?VARHELP=privacy/sender/generic_nonmember_action">opæim pravilima za one koji nisu èlanovi liste</a>. <p>U donjim tekst poljima, dodajte jednu adresu po liniji; zapoènite liniju sa ^ znakom da biste konstruirali <a href= "http://docs.python.org/library/re.html" >Python regular expression</a>. Kada koristite kosu crtu, unesite je kao da unosite obièan Python tekst (npr. samo jednu kosu crtu) <p>Primijetite da su ne-regexp podudaranja uvijek prvo napravljena.
ro: Când un mesaj este publicat

source: Member filters
hr: Èlanski filteri
ro: Filtre membri
tr: Üye filtreleri

source: By default, should new list member postings be moderated?
hr: Trebaju li poruke novih èlanova liste biti moderirane?
ro: În mod implicit, mesajele noilor membri sunt moderate?
tr: Varsayýlan olarak yeni üyelerin mesajlarý moderatör onayý gerektirsin mi?
