Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: size not available
hr: velièina nije dostupna
ro: mãrimea nu este disponibilã
tr: boyut belli deðil

source: %(size)i bytes
ro: %(size)i octeþi
tr: %(size)i bayt

source: at
ro: la

source: Previous message:
hr: Prethodna poruka
ro: Mesajul anterior:
tr: Önceki mesaj:

source: Next message:
hr: Sljedeca poruka
ro: Mesajul urmãtor:
tr: Sonraki mesaj:

source: subject
hr: naslov
ro: subiect
tr: konu

source: author
hr: autor
ro: autor
tr: yazar

source: date
hr: datum
ro: data
tr: tarih

source: <P>Currently, there are no archives. </P>
hr: <P>Trenutno nema arhive. </P>
ro: <P>Nu sunt arhive în acest moment </P>
tr: <p>Þu anda herhangi bir arþiv yok. </p>

source: Gzip'd Text%(sz)s
hr: Gzipovani Tekst%(sz)s
ro: Text%(sz)s comprimat%(sz)s (gzip)
tr: Gzip'li Yazý%(sz)s

source: figuring article archives
hr: prouèavam arhivu èlanaka
ro: pregãtesc arhivele
tr: makale arþivleri biçimlendiriliyor

source: April
hr: Travanj
ro: Aprilie
tr: Nisan

source: February
hr: Veljaèa
ro: Februarie
tr: Þubat

source: January
hr: Sijeèanj
ro: Ianuarie
tr: Ocak

source: March
hr: O¾ujak
ro: Martie
tr: Mart

source: July
hr: Srpanj
ro: Iulie
tr: Temmuz

source: June
hr: Lipanj
ro: Iunie
tr: Haziran

source: May
hr: Svibanj
ro: Mai
tr: Mayýs

source: December
hr: Prosinac
ro: Decembrie
tr: Aralýk

source: November
hr: Studeni
ro: Noiembrie
tr: Kasým

source: October
hr: Listopad
ro: Octombrie
tr: Ekim

source: September
hr: Rujan
ro: Septembrie
tr: Eylül

source: First
hr: Prvi
ro: I
tr: Ýlk

source: Fourth
hr: Èetvrti
ro: IV
tr: Dördüncü

source: Second
hr: Drugi
ro: II
tr: Ýkinci

source: Third
hr: Treæi
ro: III
tr: Üçüncü

source: %(ord)s quarter %(year)i
hr: %(ord)s kvartal %(year)i
ro: Trimestrul %(ord)s, %(year)i
tr: %(ord)s çeyrek %(year)i

source: The Week Of Monday %(day)i %(month)s %(year)i
hr: Tjedan Ponedjeljka %(day)i %(month)s %(year)i
ro: Sãptãmâna ce începe Luni, %(day)i %(month)s %(year)i
tr: Pazartesi %(day)i %(month)s %(year)i Haftasý

source: Computing threaded index
hr: Izraèunavam indekse diskusija
ro: Calculez indexul firului de discuþie (threaded index)
tr: Thread'li indeks hesaplanýyor

source: Updating HTML for article %(seq)s
hr: Osvje¾avam HTML za èlanak %(seq)s
ro: Actualizez codul HTML pentru articolul %(seq)s
tr: %(seq)s makalesi için HTML güncelleniyor

source: article file %(filename)s is missing!
hr: datoteka èlanka %(filename)s nedostaje!
ro: lipseºte fiºierul %(filename)s al articolului!
tr: makale dosyasý (%filename)s yok!

source: No subject
hr: Nema naslova
ro: Fãrã subiect
tr: Konu yok

source: Creating archive directory
hr: Kreiram direktorij arhive
ro: Creez directorul arhivei
tr: Arþiv dizini oluþturuluyor

source: Reloading pickled archive state
hr: Uèitavam zapakirano stanje arhive
ro: Reîncarc starea arhivei
tr: Pickled arþiv durumu yeniden yükleniyor

source: Pickling archive state into
hr: Pakiram stanje arhive u
ro: Conserv informaþiile de stare ale arhivei
tr: Arþiv durumu dönüþtürülüyor:

source: Updating index files for archive [%(archive)s]
hr: Osvje¾avam indeksne datoteke za arhivu [%(archive)s]
ro: Actualizez fiºierele de index pentru arhiva [%(archive)s]
tr: [%(archive)s] arþivi için indeks dosyalarý güncelleniyor

source: due to excessive bounces
hr: zbog prekomjernog odbijanja
ro: datoritã eºecurilor de livrare (bounces) excesive
tr: çok fazla geri dönme sebebiyle

source: by yourself
hr: od mene
ro: de cãtre dumneavoastrã
tr: sizin tarafýnýzdan

source: by the list administrator
hr: od strane administratora liste
ro: de cãtre administratorul listei
tr: liste yöneticisi tarafýndan

source: for unknown reasons
hr: zbog nepoznatih razloga
ro: din motive necunoscute
tr: bilinmeyen nedenlerle

source: disabled
hr: onemogucen
ro: dezactivat
tr: etkin deðil

source: Bounce action notification
hr: Obavijest o akciji odbijanja
ro: Notificare de eºec la livrare (bounce)
tr: Geri dönme eylem bildirimi

source: The last bounce received from you was dated %(date)s
hr: Datum va¹eg posljednjeg odbijanja %(date)s
ro: Ultimul eºec la livrarea mesajelor cãtre adresa dumneavoastrã este datat %(date)s
tr: Sizden gelen son geri dönüþ %(date)s tarihindeydi

source: (no subject)
hr: (nema naslova)
ro: (fãrã subiect)
tr: (konu yok)

source: [No bounce details are available]
hr: [Detalji o odbijanju nisu dostupni]
ro: [Nu sunt disponibile detalii despre eºec]
tr: [Geri dönme ayrýntýlarý yok]

source: No such list <em>%(safelistname)s</em>
hr: Takva lista ne postoji <em>%(safelistname)s</em>
ro: Nu existã lista <em>%(safelistname)s</em>
tr: <em>%(safelistname)s</em> adýnda bir liste yok

source: Authorization failed.
hr: Autorizacija nije uspjela.
ro: Autorizarea a eºuat.
tr: Yetkilendirme baþarýsýz.

source: You have turned off delivery of both digest and non-digest messages. This is an incompatible state of affairs. You must turn on either digest delivery or non-digest delivery or your mailing list will basically be unusable.
hr: Iskljucili ste dostavu i digest i obicnih poruka. Ovo nije normalno stanje ove postavke Trebate ukljuciti ili digest dostavu ili normalnu dostavu za vasu mailing listu, inace ce ona biti neupotrebljiva.
ro: Aþi dezactivat atât livrarea pe volume, cât ºi a mesajelor normale. Aceasta este o stare inacceptabilã. Trebuie sã activaþi mãcar una din metodele de livrare (volume de mesaje sau mesaje normale), altfel lista dumneavoastrã devine practic inutilizabilã.
tr: Hem toplu hem toplu olmayan mesaj gönderimini kapattýnýz. Bu birbirine uymayan iki durumu çakýþtýrýyor. Ya toplu ya da toplu olmayan gönderimi etkinleþtirin, yoksa mesaj listeniz kullanýlamaz hale gelecektir.

source: Warning:
hr: Upozorenje:
ro: Atenþie:
tr: Uyarý:

source: You have digest members, but digests are turned off. Those people will not receive mail.
hr: Imate digest clanove, a digest mailovi su iskljuceni. Ti ljudi nece primiti mail.
ro: Aveþi abonaþi ce doresc doar volume zilnice ale mesajelor, dar livrarea de volume este anulatã. Aceºti membri nu vor putea primi mesaje.
tr: Toplu gönderim isteyen üyeleriniz var, fakat toplu gönderim kapalý. Bu kiþiler e-posta almayacak.

source: You have regular list members but non-digestified mail is turned off. They will receive mail until you fix this problem.
hr: Imate regularne clanove liste, ali niti jedan digest mail nije iskljucen. Oni ce primiti mail kada popravite ovaj problem.
ro: Aveþi abonaþi ce doresc livrarea de mesaje individuale, dar acestea sunt dezactivate. Ei nu vor primi mesaje pânã la rezolvarea acestei probleme.
tr: Toplu olmayan mesaj almak isteyen üyeleriniz var, fakat bu tür mesaj gönderimi kapalý. Bu sorunu gidermediðiniz sürece e-posta alamayacaklar.

source: %(hostname)s mailing lists - Admin Links
hr: %(hostname)s mailing liste - Admin Linkovi
ro: Listele de discuþii de la %(hostname)s - Linkuri administrative
tr: %(hostname)s mesaj listeleri - Yönetici Linkleri

source: Welcome!
hr: Dobrodo¹li!
ro: Bun venit!
tr: Hoþgeldiniz!

source: <p>There currently are no publicly-advertised %(mailmanlink)s mailing lists on %(hostname)s.
hr: <p>Trenutno nema javno oglasenih %(mailmanlink)s mailing lista na %(hostname)s.
ro: <p>Nu sunt liste de discuþii %(mailmanlink)s publice la adresa %(hostname)s.</p>
tr: <p>Þu anda %(hostname)s üzerinde genel kullaným için ilan edilmiþ %(mailmanlink)s mesaj listesi yok.

source: <p>Below is the collection of publicly-advertised %(mailmanlink)s mailing lists on %(hostname)s. Click on a list name to visit the configuration pages for that list.
hr: <p>Ispod je skup javno ogla¹enih %(mailmanlink)s mailing lista na %(hostname)s. Kliknite na ime liste da biste posjetili konfiguracijsku stranicu za tu listu.
ro: <p>Mai jos sunt toate listele de discuþii %(mailmanlink)s publice la %(hostname)s. Clic pe numele listei pentru a-i accesa pagina de configurare.</p>
tr: <p>Aþaðýda %(hostname)s üzerinde genel kullaným için ilan edilmiþ %(mailmanlink)s mesaj listeleri gösteriliyor. Bir listenin üzerine týklayarak o listenin yapýlandýrma sayfalarýna gidebilirsiniz.

source: right
hr: u redu
ro: dreapta
tr: sað

source: To visit the administrators configuration page for an unadvertised list, open a URL similar to this one, but with a '/' and the %(extra)slist name appended. If you have the proper authority, you can also <a href="%(creatorurl)s">create a new mailing list</a>. <p>General list information can be found at
hr: Da biste posjetili konfiguracijsku stranicu za administratore za neogla¹enu listu, otvorite URL slièan ovome, ali sa '/' i %(extra)slist dodanim imenom. Ako imate ispravne dozvole, takoðer mo¾ete <a href="%(creatorurl)s">kreirati novu mailing listu</a>. <p>Opæe informacije o listi nalaze se na
ro: Pentru a accesa paginile de configurare administrative în cazul unei liste nepublicate, deschideþi un URL similar cu acesta, dar având un '/' ºi numele %(extra)s al listei adãugate. Dacã aveþi autoritatea necesarã, puteþi de asemenea, <a href="%(creatorurl)s">crea o nouã listã de discuþii</a>. <p>Puteþi gãsi informaþii generale despre listã la
tr: Ýlan edilmemiþ bir listenin yönetim yapýlandýrma sayfalarýna gitmek için þu andakine benzer bir URL açýn ve arkasýna '/' ve %(extra)sliste ismini ekleyin. Eðer uygun yetkilere sahipseniz, <a href="%(creatorurl)s">yeni bir mesaj listesi de oluþturabilirsiniz</a>. <p>Genel liste bilgisine þuradan ulaþabilirsiniz:

source: the mailing list overview page
hr: stranica za pregled mailing liste
ro: pagina de informaþii generale a listei
tr: mesaj listesi tanýtým sayfasý

source: <p>(Send questions and comments to
hr: <p>(Pitanja i komentare po¹aljite na
ro: <p>(Trimiteþi întrebãrile ºi comentariile la
tr: <p>(Soru ve önerilerinizi þu adrese gönderebilirsiniz:

source: List
hr: Lista
ro: Lista de discuþii
tr: Liste

source: Description
hr: Opis
ro: Descriere
tr: Taným

source: [no description available]
hr: [opis nije dostupan]
ro: [nu are descriere]
tr: [herhangi bir taným yok]

source: No valid variable name found.
hr: Ispravno ime varijable nije pronaðeno.
ro: Nu am gãsit un nume valid de variabilã.
tr: Geçerli bir deðiþken ismi bulunamadý.

source: %(realname)s Mailing list Configuration Help <br><em>%(varname)s</em> Option
hr: %(realname)s Pomoæ za konfiguraciju mailing liste <br><em>%(varname)s</em> Opcija
ro: Ajutor la configurarea listei de discuþii %(realname)s Opþiunea<br><em>%(varname)s</em>
tr: %(realname)s Mesaj Listesi Yapýlandýrma Yardýmý <br><em>%(varname)s</em> Seçeneði

source: Mailman %(varname)s List Option Help
hr: Mailmanova pomoæ za opcije liste %(varname)s
ro: Mailman - Lista %(varname)s - Opþiuni Ajutor
tr: Mailman%(varname)s Liste Seçenek Yardýmý

source: <em><strong>Warning:</strong> changing this option here could cause other screens to be out-of-sync. Be sure to reload any other pages that are displaying this option for this mailing list. You can also
hr: <em><strong>Upozorenje:</strong> promjena ove opcije mo¾e izazvati probleme sa sinkronizacijom. Budite sigurni da ste ponovno uèitali stranice koje prikazuju gornju opciju za ovu mailing listu. Takoðer mo¾ete
ro: <em><strong>Atenþie:</strong> modificarea acestei opþiuni aici poate cauza desincronizarea celorlalte ecrane. Asiguraþi-vã de reîncãrcarea tuturor celorlalte pagini care afiºeazã aceastã opþiune pentru aceastã listã. De asemenea, mai puteþi
tr: <em><strong>Uyarý:</strong> Bu seçeneði burada deðiþtirmek, diðer ekranlarýn senkronizasyonunu bozabilir. Bu seçeneði gösteren diðer sayfalarý tekrar yüklediðinizden emin olun. Ayrýca

source: return to the %(categoryname)s options page.
hr: vratite se na %(categoryname)s stranicu sa opcijama.
ro: înapoi la pagina de opþiuni %(categoryname)s.
tr: %(categoryname)s seçenek sayfasýna da dönebilirsiniz.

source: %(realname)s Administration (%(label)s)
hr: %(realname)s Administracija (%(label)s)
ro: Administrare %(realname)s - (%(label)s)
tr: %(realname)s Yönetimi (%(label)s)

source: %(realname)s mailing list administration<br>%(label)s Section
hr: Administracija mailing liste %(realname)s<br>Sekcija %(label)s
ro: Administrarea listei de discuþii %(realname)s<br>Secþiunea %(label)s
tr: %(realname)s mesaj listesi yönetimi<br>%(label)s Bölümü

source: Configuration Categories
hr: Konfiguracija kategorija
ro: Configurarea categoriilor
tr: Yapýlandýrma Kategorileri

source: Other Administrative Activities
hr: Druge administratorske aktivnosti
ro: Alte activitãþi administrative
tr: Diðer Yönetimsel Aktiviteler

source: Tend to pending moderator requests
hr: Nastojim obraditi zahtjeve moderatora na èekanju
ro: Cereri în aºteptarea moderãrii
tr: Bekleyen moderatör isteklerine bak

source: Go to the general list information page
hr: Idi na opæenitu informacijsku stranicu liste
ro: Spre pagina de informaþii generale a listei
tr: Genel liste bilgi sayfasýna git

source: Edit the public HTML pages and text files
ro: Editeazã codul HTML al paginilor publice

source: Go to list archives
hr: Idi u arhivu liste
ro: Spre arhivele listei
tr: Liste arþivlerine git

source: Delete this mailing list
hr: Obri¹i ovu mailing listu
ro: Åžterge aceastã listã
tr: Bu mesaj listesini sil

source: (requires confirmation)<br>&nbsp;<br>
hr: (zahtjeva potvrdu)<br>&nbsp;<br>
ro: (necesitã confirmare)<br>&nbsp;<br>
tr: (onay gerektirir)<br>&nbsp;<br>

source: Logout
hr: Izlaz
ro: Ieºire
tr: Çýkýþ

source: Emergency moderation of all list traffic is enabled
hr: Ukljuèeno je hitno moderiranje cjelokupnog prometa na listi
ro: Moderarea excepþionalã de urgenþã a traficului întregii liste este activatã
tr: Tüm liste trafiði için acil moderatör onayý etkin

source: Make your changes in the following section, then submit them using the <em>Submit Your Changes</em> button below.
hr: Napravite promjene u sljedeæim sekcijama a zatim ih po¹aljite koristeæi gumb <em>Po¹aljite promjene</em>.
ro: Faceþi modificãrile necesare în secþiunea ce urmeazã, apoi salvaþi-le folosind butonul <em>Salvaþi datele</em> de mai jos.
tr: Aþaðýdaki bölümde deðiþikliklerinizi yapýn ve bu deðiþiklikleri <em>Deðiþiklikleri Kaydet</em> düðmesine basarak kaydedin.

source: Additional Member Tasks
hr: Dodatni Èlanski Zadaci
ro: Sarcini suplimentare pentru membrii
tr: Ek Üye Görevleri

source: <li>Set everyone's moderation bit, including those members not currently visible
hr: <li>Postavi svima moderacijski bit, ukljuèujuæi i one èlanove koji trenutno nisu vidljivi.
ro: <li>Activaþi moderarea tuturor membrilor, incluzând membrii care acum nu sunt afiºaþi
tr: <li>Þu anda görüntülenmeyen üyeler de dahil olmak üzere herkesin moderatör onayý ayarýný etkinleþtir

source: Off
hr: Iskljuèeno
ro: Oprit
tr: Kapalý

source: On
hr: Ukljuèeno
ro: Pornit
tr: Açýk

source: Set
hr: Postavi
ro: Activeazã
tr: Ayarla

source: Value
hr: Vrijednost
ro: Valoare
tr: Deðer

source: Badly formed options entry: %(record)s
hr: Lo¹e formiran unos opcije: %(record)s
ro: Opþiuni eronate: %(record)s
tr: Kötü oluþturulmuþ seçenek giriþi: %(record)s

source: <em>Enter the text below, or...</em><br>
hr: <em>Unesite tekst ispod, ili...</em><br>
ro: <em>Introduceþi textul mai jos, sau...</em><br>
tr: <em>Aþaðýya yazý ekleyin, veya...</em><br>

source: <br><em>...specify a file to upload</em><br>
hr: <br><em>...specificirajte datoteku koju æete uploadati</em><br>
ro: <br><em>...specificaþi un fiºier de încãrcat</em><br>
tr: <br><em>...yüklemek için bir dosya seçin</em><br>

source: Topic %(i)d
hr: Naslov %(i)d
ro: Topica %(i)d
tr: Konu %(i)d

source: Delete
hr: Obri¹i
ro: Åžterge
tr: Sil

source: Topic name:
hr: Naziv naslova
ro: Numele topicii:
tr: Konu ismi:

source: Description:
hr: Opis
ro: Descriere:
tr: Taným:

source: Add new item...
hr: Dodaj novu stavku...
ro: Adaugã o înregistrare nouã...
tr: Yeni madde ekle...

source: ...before this one.
hr: ...prije ove.
ro: ...înainte de aceasta.
tr: ...bundan önce.

source: ...after this one.
hr: ....poslije ove.
ro: ...dupã aceasta.
tr: ...bundan sonra.

source: Spam Filter Rule %(i)d
hr: Pravilo Spam Filtera %(i)d
ro: Regula de filtrare a spam-ului: %(i)d
tr: Spam Filtre Kuralý %(i)d

source: Spam Filter Regexp:
hr: Regexp Spam Filtera
ro: Filtru Regexp Spam:
tr: Spam Filtre Regexp:

source: Defer
hr: Odgodi
ro: Amânã
tr: Ertele

source: Reject
hr: Odbij
ro: Respinge
tr: Reddet

source: Hold
hr: Zadr¾i
ro: Reþine
tr: Beklet

source: Discard
hr: Odbaci
ro: Ignorã
tr: Gözardý Et

source: Action:
hr: Akcija
ro: Acþiune:
tr: Eylem:

source: Move rule up
hr: Pomakni pravilo prema gore
ro: Mutã regula mai sus
tr: Kuralý yukarý al

source: Move rule down
hr: Pomakni pravilo prema dole
ro: Mutã regula mai jos
tr: Kuralý aþaðý al

source: <br>(Edit <b>%(varname)s</b>)
hr: <br>(Uredi <b>%(varname)s</b>)
ro: <br>(Modificã <b>%(varname)s</b>)
tr: <br>(Düzenle: <strong>%(varname)s</strong>)

source: <br>(Details for <b>%(varname)s</b>)
hr: <br>(Detalji za <b>%(varname)s</b>)
ro: <br>(Detalii pentru <b>%(varname)s</b>)
tr: <br>(<strong>%(varname)s</strong> için Ayrýntýlar)

source: Mass Subscriptions
hr: Masovna pretplata
ro: Abonare în masã
tr: Yýðýn Üye Eklemeler

source: Mass Removals
hr: Masovno uklanjanje
ro: Dezabonare în masã
tr: Yýðýn Üye Çýkarmalar

source: Membership List
hr: Èlanska lista
ro: Lista membrilor
tr: Üyelik Listesi

source: (help)
hr: (pomoæ)
ro: (ajutor)
tr: (yardým)

source: Find member %(link)s:
hr: Pronaði èlana %(link)s:
ro: Cautã membrul %(link)s:
tr: Üye bul %(link)s:

source: Search...
hr: Tra¾i...
ro: Cautã...
tr: Ara...

source: Bad regular expression:
hr: Pogre¹an regular expression:
ro: Expresie regularã eronatã:
tr: Hatalý regular expression:

source: %(allcnt)s members total, %(membercnt)s shown
hr: %(allcnt)s èlanova ukupno, %(membercnt)s prikazano
ro: %(allcnt)s membri în total, %(membercnt)s afiºaþi
tr: toplam %(allcnt)s üye, %(membercnt)s üye görüntüleniyor

source: %(allcnt)s members total
hr: %(allcnt)s èlanova ukupno
ro: %(allcnt)s membri în total
tr: toplam %(allcnt)s üye

source: unsub
hr: odjavi
ro: dezab
tr: çýkar

source: member address<br>member name
hr: èlanska adresa<br>ime èlana
ro: adresa<br>numele
tr: üye adresi<br>üye ismi

source: hide
hr: sakrij
ro: ascuns
tr: gizle

source: nomail<br>[reason]
hr: nema maila<br>[razlog]
ro: fãrã mail<br>[motiv]
tr: mesaj yok<br>[neden]

source: ack
ro: conf
tr: bilgi

source: not metoo
hr: ne metoo
ro: eu nu
tr: mesajýmý bana<br>gönderme

source: nodupes
ro: fãrã dubluri
tr: kopya<br>gönderme

source: digest
ro: rezumat
tr: toplu

source: plain
hr: obièan
ro: simplu
tr: düz yazý

source: language
hr: jezik
ro: limba
tr: dil

source: <b>unsub</b> -- Click on this to unsubscribe the member.
hr: <b>odjava</b> -- Kliknite ovdje da biste odjavili èlana.
ro: <b>unsub</b> -- Apãsaþi aici pentru dezabonare
tr: <strong>çýkar</strong> -- Üyeyi listeden çýkarmak için buna týklayýn.

source: <b>mod</b> -- The user's personal moderation flag. If this is set, postings from them will be moderated, otherwise they will be approved.
hr: <b>mod</b> -- Korisnièka moderacijska zastavica. Ako je ovo ukljuèeno, njihove poruke æe biti moderirane, inaèe one neæe biti odobrene.
ro: <b>mod</b> -- Flag-ul de moderare personalã. Dacã este setat mesajele acestuia vor fi moderate; în caz contrar, mesajele vor fi aprobate.
tr: <strong>onay</strong> -- Kullanýcýnýn kiþisel moderatör onay ayarý. Eðer bu seçili ise bu kullanýcýnýn mesajlarý onay gerektirecek, yoksa otomatik olarak kabul edilecektir.

source: <b>hide</b> -- Is the member's address concealed on the list of subscribers?
hr: <b>sakrij</b> -- Da li je èlanska adresa sakrivena na listi pretplatnika?
ro: <b>ascuns</b> -- Este adresa utilizatorului ascunsã pe lista abonaþilor?
tr: <strong>gizle</strong> -- Liste üyesinin adresi diðer üyelerden gizlenecek mi?

source: <b>nomail</b> -- Is delivery to the member disabled? If so, an abbreviation will be given describing the reason for the disabled delivery: <ul><li><b>U</b> -- Delivery was disabled by the user via their personal options page. <li><b>A</b> -- Delivery was disabled by the list administrators. <li><b>B</b> -- Delivery was disabled by the system due to excessive bouncing from the member's address. <li><b>?</b> -- The reason for disabled delivery isn't known. This is the case for all memberships which were disabled in older versions of Mailman. </ul>
hr: <b>nema maila</b> -- Da li je dostava èlanovima iskljuèena? Ako je, biti æe dana skraæenica razloga zbog kojeg je onemoguæena dostava: <ul><li><b>U</b> -- Dostava je onemoguæena od strane korisnika preko osobne stranice sa postavkama. <li><b>A</b> -- Dostava je onemoguæena od strane administratora liste. <li><b>B</b> -- Dostava je onemoguæena od strane sistema zbog prekomjernog odbijanja sa èlanske adrese. <li><b>?</b> -- Razlog zbog kojega je dostava onemoguæena nije poznat. Ovo je sluèaj za sve èlanove koji su onemoguæeni u starjim verzijama Mailmana. </ul>
ro: <b>fãrã mail</b> -- Este livrarea mesajelor anulatã cãtre acest membru? Dacã da, va fi prezentatã o abreviere care descrie motivul anulãrii livrãrii mesajelor: <ul><li><b>U</b> -- Livrarea a fost dezactivatã de cãtre utilizator prin intermediul paginii de opþiuni personale. <li><b>A</b> -- Livrarea a fost dezactivatã de cãtre administratorii listei. <li><b>B</b> -- Livrarea a fost dezactivatã de cãtre sistem datoritã eºecurilor excesive de livrare la adresa utilizatorului. <li><b>?</b> -- Motivul dezactivãrii livrãrii nu este cunoscut. Acesta este cazul tuturor abonamentelor care au fost dezactivate în versiuni anterioare ale programului Mailman. </ul>
tr: <strong>mesaj yok</strong> -- Üyeye gönderim devre dýþý mý? Eðer öyleyse bunun sebebi bir kýsaltma ile açýklanacaktýr: <ul><li><strong>K</strong> -- Gönderim üye tarafýndan kendi kiþisel seçenek sayfasýnda devre dýþý býrakýlmýþtýr. <li><strong>Y</strong> -- Gönderim liste yöneticileri tarafýndan devre dýþý býrakýlmýþtýr. <li><strong>G</strong> -- Gönderim sistem tarafýndan, kullanýcýnýn adresinden aþýrý geri dönüþ olduðu için devre dýþý býrakýlmýþtýr. <li><strong>?</strong> -- Gönderimin devre dýþý býrakýlmasýnýn sebebi bilinmiyor. Bu, eski Mailman sürümlerinde devre dýþý býrakýlan üyelikler için geçerlidir. </ul>

source: <b>ack</b> -- Does the member get acknowledgements of their posts?
hr: <b>ack</b> -- Da li èlan dobija potrdu poslanih poruka?
ro: <b>conf</b> -- Acest membru primeºte confirmãri ale publicãrii mesajelor ?
tr: <strong>bilgi</strong> -- Üye gönderdiði mesajlarýn ek bilgilerini alýr mý?

source: <b>not metoo</b> -- Does the member want to avoid copies of their own postings?
hr: <b>ne metoo</b> -- Da li èlan ¾eli izbjeæi kopije njegovih vlastitih poslanih poruka?
ro: <b>eu nu</b> -- Doreºte utilizatorul sã evite primirea duplicatelor mesajelor proprii?
tr: <strong>mesajýmý bana gönderme</strong> -- Üye kendi mesajlarýnýn kopyalarýndan sakýnmak istiyor mu?

source: <b>nodupes</b> -- Does the member want to avoid duplicates of the same message?
hr: <b>nodupes</b> -- Da li èlan ¾eli izbjeæi duplikate iste poruke?
ro: <b>fãrã dubluri</b> -- Doreºte acest membru sã evite duplicatele aceluiaºi mesaj?
tr: <strong>kopya gönderme</strong> -- Üye ayný mesajýn kopyalarýndan sakýnmak istiyor mu?

source: <b>digest</b> -- Does the member get messages in digests? (otherwise, individual messages)
hr: <b>digest</b> -- Da li èlan prima poruke u obliku digesta? (inaèe, individualne poruke)
ro: <b>rezumat</b> -- Doreºte acest membru sã primeascã mesajele într-un singur rezumat zilnic? (în caz contrar, primeºte mesaje individuale)
tr: <strong>toplu</strong> -- Üye mesajlarý toplu halde mi alýyor? (aksi halde mesajlar ayrý ayrý gönderilir)
