Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Use this option to prohibit posts according to specific header values. The target value is a regular-expression for matching against the specified header. The match is done disregarding letter case. Lines beginning with '#' are ignored as comments. <p>For example:<pre>to: .*@public.com </pre> says to hold all postings with a <em>To:</em> mail header containing '@public.com' anywhere among the addresses. <p>Note that leading whitespace is trimmed from the regexp. This can be circumvented in a number of ways, e.g. by escaping or bracketing it.
hr: Ovu opciju koristite da biste zabranili poruke koje sadr¾e specifiène vrijednosti u zaglavlju. Ciljana vrijednost je regular-expression koji se usporeðuje sa specifiènim zaglavljem. Usporedba se vr¹i bez obzira na velika i mala slova. Linije koje poèinju sa '#' se ignoriraju kao komentari. <p>Npr.:<pre>to: .*@public.com </pre> ka¾e da se zadr¾e sve poruke sa <em>To:</em> mail zaglavljem koje sadr¾i '@public.com' bilo gdje meðu adresama. <p>Primijetite da su vodeæi razmaci odrezani iz regexp izraza. Ovo mo¾e biti izbjegnuto u velikom broju sluèajeva, npr. stavljanjem u zagrade itd.
ro: Folosiþi aceastã opþiune pentru a interzice publicarea mesajelor, pe baza unor valori specifice ale headerelor. Valoarea þintã este o expresie regulatã ce va fi comparatã cu headerul specificat. Comparaþia se face neþinând cont de tipul literelor (majuscule sau minuscule). Liniile care încep cu # sunt ignorate, fiind considerate comentarii. <p>De exemplu: <pre>to: .*@public.com </pre> spune sã reþin toate mesajele cu un header e-mail care conþine '@public.com' orinude printre adrese. </p> <p>Notaþi cã spaþiile goale de la începutul regexp-ului sunt eliminate. Acest fapt poate fi evitat prin mai multe moduri, de exemplu punându-l în paranteze sau prin escape.</p>
tr: Bu seçeneði belirli baþlýk deðerleri içeren mesajlarý engellemek için kullanýn. Hedef deðer, belirli bir baþlýk ile karþýlaþtýrýlacak bir regular-expression'dýr. Karþýlaþtýrma büyük-küçük harf ayrýmý gözetilmeksizin yapýlýr. '#' karakteri ile baþlayan satýrlar açýklama sayýlýr ve gözardý edilir. <p>Örneðin:<pre>to: .*@public.com </pre> <em>Alýcý:</em> baþlýðýndaki adreslerden birinde '@public.com' içeren tüm mesajlarýn bekletilmesini söyler. <p>Bir regexp baþýnda boþluk varsa, bu boþluk silinecektir. Bu durumu önlemek için parantez için almak veya baþýna bir kaçýþ iþareti koymak mümkündür.

source: Header filter rules require a pattern. Incomplete filter rules will be ignored.
hr: Pravila filtera zaglavlja trebaju uzorak. Nepotpuna pravila filtera æe biti ignorirana.
ro: Regulile de filtrare la headere necesitã un ºablon. Regulile de filtrare incomplete vor fi ignorate.
tr: Baþluk filtre kurallarý vi desen gerektirir. Eksik filtre kurallarý gözardý edilecektir.

source: The header filter rule pattern '%(safepattern)s' is not a legal regular expression. This rule will be ignored.
hr: Uzorak pravila filtera zaglavlja `%(safepattern)s' nije legalan regular expression. Isti æe biti odbaèen.
ro: ªablonul filtrului pentru header '%(safepattern)s' nu este o expresie regularã legalã. Aceastã regulã va fi ignoratã.
tr: '%(safepattern)s' baþlýk filtre kural deseni geçerli bir regular expression deðil. Bu kural gözardý edilecek.

source: Topics
hr: Naslovi
ro: Topici
tr: Konular

source: List topic keywords
hr: Lista kljuènih rijeèi naslova
ro: Cuvinte cheie pentru topicile listai
tr: Liste konu anahtar sözcükleri

source: Disabled
hr: Onemoguæeno
ro: Dezactivat
tr: Devre Dýþý

source: Enabled
hr: Omoguæeno
ro: Activat
tr: Etkin

source: Should the topic filter be enabled or disabled?
hr: Treba li filter naslova biti omoguæen ili onemoguæen?
ro: Este filtrul de topici activat sau dezactivat?
tr: Konu filtresi etkin mi yoksa devre dýþý mý?

source: The topic filter categorizes each incoming email message according to <a href="http://docs.python.org/library/re.html">regular expression filters</a> you specify below. If the message's <code>Subject:</code> or <code>Keywords:</code> header contains a match against a topic filter, the message is logically placed into a topic <em>bucket</em>. Each user can then choose to only receive messages from the mailing list for a particular topic bucket (or buckets). Any message not categorized in a topic bucket registered with the user is not delivered to the list. <p>Note that this feature only works with regular delivery, not digest delivery. <p>The body of the message can also be optionally scanned for <code>Subject:</code> and <code>Keywords:</code> headers, as specified by the <a href="?VARHELP=topics/topics_bodylines_limit">topics_bodylines_limit</a> configuration variable.
hr: Filter naslova kategorizira svaku dolaznu e-mail poruku sukladno <a href="http://docs.python.org/library/re.html">regular expression filterima</a> koje navodite dolje. Ako <code>Subject:</code> ili <code>Keywords:</code> zaglavlja poruke sadr¾e usporedbu s filterom naslova, poruka se logièki postavlja u <em>popis</em> naslova. Svaki korisnik tada mo¾e odluèiti da li ¾eli primati poruke s mailing liste za neki popis naslova. Bilo koja poruka koja nije kategorizirana u popisu naslova koji je registriran od strane korisnika, nije dostavljena na listu. <p>Primijetite da ova specifiènost radi samo s normalnom dostavom, ali ne i s digest dostavom. <p>Tijelo poruke mo¾e takoðer biti opcionalno skenirano u potrazi za <code>Subject:</code> i <code>Keywords:</code> zaglavljima, kao ¹to je specificirano <a href="?VARHELP=topics/topics_bodylines_limit">topics_bodylines_limit</a> konfiguracijskom varijablom.
ro: Filtrul de topici categorizeazã fiecare e-mail sosit pe baza <a href="http://docs.python.org/library/re.html">expresiilor regulate de filtrare</a> pe care le specificaþi mai jos. Dacã unul din headerele <code>Subject:</code>sau <code>Keywords:</code> conþine cuvinte ce se potrivesc cu filtrul de topici, mesajul este amplasat în mod logic într-o <em>ramurã</em> de topicã. Fiecare utilizator poate alege sã primeascã doar mesajele dintr-o anumitã ramurã (sau ramuri) ale listei de discuþii. Orice mesaj ce nu este categorizat într-o ramurã la care abonatul este înregistrat nu va fi livrat acestuia. <p>Notaþi cã aceastã facilitate funcþioneazã doar la livrarea individualã a mesajelor, ºi nu la livrarea volumelor (digest delivery).</p> <p>De asemenea, corpul mesajului poate fi opþional scanat pentru headere de tipul <code>Subject:</code> ºi <code>Keyword:</code>, dupã cum este specificat în variabila de configurare <a href="?VARHELP=topics/topics_bodylines_limit">topics_bodylines_limit</a>.

source: How many body lines should the topic matcher scan?
hr: Koliko bi linija u tijelu poruke trebala skenirati funkcija usporedbe naslova?
ro: Câte linii din corpul mesajului trebuie scanate pentru aflarea topicii?
tr: Konu eþleþtirici kaç gövde satýrýný tarasýn?

source: The topic matcher will scan this many lines of the message body looking for topic keyword matches. Body scanning stops when either this many lines have been looked at, or a non-header-like body line is encountered. By setting this value to zero, no body lines will be scanned (i.e. only the <code>Keywords:</code> and <code>Subject:</code> headers will be scanned). By setting this value to a negative number, then all body lines will be scanned until a non-header-like line is encountered.
hr: Funkcija usporedbe naslova æe skenirati sve linije u tijelu poruke tra¾eæi kljuène rijeèi naslova koje se podudaraju. Skeniranje tijela se zaustavlja onda kada su sve linije pretra¾ene ili kada je otkrivena linija s neèim ¹to ne slièi zaglavlju. Postavljanjem ove vrijednosti na nulu, neæe biti skenirana niti jedna linija (npr. bit æe skenirana samo <code>Keywords:</code> and <code>Subject:</code> zaglavlja). Postavljanjem na negativan broj, sve æe linije tijela biti skenirane dok ne bude otkrivena linija s neèim ¹to ne slièi zaglavlju.
ro: Comparatorul de topici va scana acest numãr de linii din mesaj, cãutând cuvinte cheie care sã se potriveascã. Scanarea corpului mesajului se terminã la atingerea numãrului de linii specificat, sau la întâlnirea unei linii de tip non-header. Setând aceastã valoare la zero, nici o linie din corpul mesajului nu va fi scanatã (adicã doar headerele <code>Keywords:</code> ºi <code>Subject:</code> vor fi scanate. Setând valoarea la un numãr negativ, atunci toate liniile mesajului vor fi scanate, pânã la întâlnirea unei linii non-header.
tr: Konu eþleþtirici mesaj gövdesinde, konu anahtar sözcüklerini burada belirtilen satýr sayýsýnda karþýlaþtýrýr. Burada belirtilen sayý kadar satýr tarandýðýnda veya baþlýða benzemeyen bir satýra rastlandýðýnda gövde taramasý durur. Bu deðeri sýfýr olarak ayarlayarak, hiçbir gövde satýrýnýn taranmamasýný saðlayabilirsiniz (yani sadece <code>Konu:</code> ve <code>Keywords:</code> baþlýklarý taranacaktýr). Bu deðeri negatif bir sayýya ayarlarsanýz, gövde, baþlýða benzemeyen bir satýra rastlayana kadar taranýr.

source: Topic keywords, one per line, to match against each message.
hr: Kljuène rijeèi naslova, jedna po liniji, koja se usporeðuje sa svakom porukom.
ro: Cuvintele cheie ale topicii, câte unul pe linie, care trebuie cãutate în fiecare mesaj.
tr: Her bir mesajla eþleþtirilecek konu anahtar sözcükleri, her satýra bir tane.

source: Each topic keyword is actually a regular expression, which is matched against certain parts of a mail message, specifically the <code>Keywords:</code> and <code>Subject:</code> message headers. Note that the first few lines of the body of the message can also contain a <code>Keywords:</code> and <code>Subject:</code> "header" on which matching is also performed.
hr: Svaka kljuèna rijeè naslova je u biti regular expression koji se usporeðuje s odreðenim dijelovima e-maila, posebno s <code>Keywords:</code> and <code>Subject:</code> zaglavljima poruke. Primijetite da nekoliko prvih linija tijela poruke mo¾e takoðer sadr¾avati <code>Keywords:</code> i <code>Subject:</code> "zaglavlje" prema kojemu se vr¹i usporedba.
ro: Fiecare cuvânt cheie de topicã este de fapt o expresie regulatã, ºi care este comparatã cu anumite pãrþi ale unui mesaj e-mail, cel puþin headerele <code>Keywords:</code> ºi <code>Subject:</code>. Notaþi cã primele câteva linii ale copului mesajului pot conþine, de asemenea, un "header" <code>Keywords:</code> ºi <code>Subject:</code>, care va fi de asemenea parcurs pentru comparare.
tr: Her konu anahtar sözcüðü aslýnda bir regular expression'dýr ve özellikle <code>Konu:</code> ve <code>Keywords:</code> baþlýklarý olmak üzere mesajýn belirli bölümleriyle karþýlaþtýrýlýr. Mesaj gövdesinin ilk birkaç satýrý da <code>Konu:</code> ve <code>Keywords:</code> "baþlýðý" içerebilir ve bu satýrlarda da karþýlaþtýrma yapýlabilir.

source: Topic specifications require both a name and a pattern. Incomplete topics will be ignored.
hr: Specifikacija naslova zahtjeva naziv i uzorak. Nepotpuni uzorci æe biti ignorirani.
ro: Specificaþiile de topicã necesitã atât un nume, cât ºi un ºablon. Topicile incomplete vor fi ignorate.
tr: Konu belirlemeleri hem bir isim hem de bir desen gerektirir. Eksik konular gözardý edilecek.

source: The topic pattern '%(safepattern)s' is not a legal regular expression. It will be discarded.
hr: Uzorak naslova `%(safepattern)s' nije legalan regular expression. Isti æe biti odbaèen.
ro: Formatul '%(safepattern)s al topicii nu este o expresie regularã legalã. Va fi ignorat.
tr: '%(safepattern)s' konu deseni geçerli bir regular expression deðil. Gözardý edilecek.

source: Mail&lt;-&gt;News&nbsp;gateways
hr: Mail&lt;-&gt;News&nbsp;suèelja
ro: Porþi (gateways) Mail&lt;-&gt;News
tr: E-posta&lt;-&gt;Haber&nbsp;Geçitleri

source: Mail-to-News and News-to-Mail gateway services.
hr: Mail-prema-News i News-prema-Mail gateway servisi.
ro: Servicii de interconectare Mail-to-News ºi News-to-Mail.
tr: E-posta -> Haber ve Haber -> E-posta geçit servisleri.

source: News server settings
hr: Postavke news servera
ro: Setãrile serverului NNTP
tr: Haber sunucusu ayarlarý

source: The hostname of the machine your news server is running on.
hr: Internetska adresa ma¹ine na kojoj se vrti va¹ News server.
ro: Numele maºinii pe care ruleazã serverul dumneavoastrã de ºtiri.
tr: Haber sunucunuzun bulunduðu ana bilgisayar adý.

source: This value may be either the name of your news server, or optionally of the format name:port, where port is a port number. The news server is not part of Mailman proper. You have to already have access to an NNTP server, and that NNTP server must recognize the machine this mailing list runs on as a machine capable of reading and posting news.
hr: News server nije u sklopu Mailmana. Trebate veæ imati pristup NNTP serveru, a taj NNTP server mora prepoznati ma¹inu na kojoj se vrti ova mailing lista kao ma¹inu sposobnu za èitanje i slanje poruka na News-e.
ro: Aceastã valoare poate fi ori numele serverului dumneavoastrã de ºtiri, ori formatul opþional nume:port, unde port este un numãr valid de port de acces. Serverul de ºtiri nu face parte din specificaþiile Mailman. Trebuie sã aveþi acces la serverul NNTP, ºi acest server sã recunoascã maºina pe care ruleazã Mailman ca o fiind capabilã sã citeascã ºi sã publice ºtiri.
tr: Bu deðer ya haber sunucunuzun adý, ya da isteðe baðlý olarak isim:baðlantý noktasý (name:port) biçiminde olabilir, baðlantý noktasý, baðlantý noktasý numarasýdýr. Haber sunucusu Mailman'in normalde bir parçasý deðildir. Halen bir NNTP sunucusuna eriþiminiz olmalý ve o NNTP sunucusunun, bu mesaj listesinin üzerinde çalýþtýðý bilgisayarý haber okuyup gönderebilen bir bilgisayar olarak farkedebilmesi gereklidir.

source: The name of the Usenet group to gateway to and/or from.
hr: Naziv Usenet grupe prema gatewayu i/ili s njega.
ro: Numele grupului Usenet pentru care se face translatarea.
tr: Usenet grubundan geçiþ için kullanýlacak haber grubu ismi

source: Should new posts to the mailing list be sent to the newsgroup?
hr: Trebaju li nove poruke upuæene na mailing listu biti poslane i na news grupu?
ro: Sã fie trimise noile mesaje ale listei ºi cãtre newsgroup?
tr: Listeye gönderilecek yeni mesajlar haber grubuna da gönderilsin mi?

source: Should new posts to the newsgroup be sent to the mailing list?
hr: Trebaju li nove poruke upuæene na news grupu biti poslane i na mailing listu?
ro: Sã fie noile mesaje ale newsgroup-ului trimise ºi cãtre listã?
tr: Haber grubuna gönderilen yeni mesajlar listeye de gönderilsin mi?

source: Forwarding options
hr: Opcije prosljeðivanja
ro: Opþiuni de forward
tr: Ýletim seçenekleri

source: Moderated
hr: Moderirano
ro: Moderatã
tr: Moderatör onaylý

source: Open list, moderated group
hr: Otvorena lista, moderirana grupa
ro: Listã deschisã, grup moderat
tr: Açýk liste, moderatör onaylý grup

source: The moderation policy of the newsgroup.
hr: Moderacijska pravila news grupe.
ro: Politica de moderare a newsgroup-ului.
tr: Haber grubunun moderatör onay ilkesi.

source: Prefix <tt>Subject:</tt> headers on postings gated to news?
hr: Postavi prefiks <tt>Subject:</tt> zaglavljima poruka koje idu na newse?
ro: Adaug un prefix headerului <tt>Subiect</tt> pentru mesajele trimise spre newsgroup?
tr: Haber grubuna geçirilen mesajlara <tt>Konu:</tt> baþlýðý öneki eklensin mi?

source: Mailman prefixes <tt>Subject:</tt> headers with <a href="?VARHELP=general/subject_prefix">text you can customize</a> and normally, this prefix shows up in messages gatewayed to Usenet. You can set this option to <em>No</em> to disable the prefix on gated messages. Of course, if you turn off normal <tt>Subject:</tt> prefixes, they won't be prefixed for gated messages either.
hr: Mailman postavlja prefiks <tt>Subject:</tt> zaglavljima s <a href="?VARHELP=general/subject_prefix">tekstom koji mo¾ete prilagoditi</a>, te se ovaj prefiks prikazuje u porukama koje su proslijeðene na Usenet. Ovu opciju mo¾ete postaviti na <em>Ne</em> da biste onemoguæili prefiks na proslijeðenim porukama. Naravno, ako iskljuèite normalne <tt>Subject:</tt> prefikse, oni takoðer neæe imati prefikse za proslijeðene poruke.
ro: Mailman prefixeazã headerele <tt>Subject:</tt> cu un <a href="?VARHELP=general/subject_prefix">text configurabil</a> ºi în mod normal, acest mesaj apare în mesajele dirijate cãtre Usenet. Puteþi seta aceastã opþiune pe <em>Nu</em> pentru a dezactiva prefixarea mesajelor dirijate. Bineînþeles, dacã dezactivaþi prefixarea headerelor <tt>Subject:</tt>, acestea nu vor fi modificate nici pentru mesajele dirijate.
tr: Mailman <tt>Konu:</tt> baþlýklarýna <a href="?VARHELP=general/subject_prefix">özelleþtirebileceðiniz bir yazýyý</a> önek olarak ekler ve normalde bu önek, Usenet'e geçirilen mesajlarda görünür. Bu seçeneði <em>Hayýr</em> olarak seçerek, geçirilen mesajlara önek eklenmesini devre dýþý býrakabilirsiniz. Tabii ki normal <tt>Konu:</tt> öneklerini kapattýysanýz, onlar da geçirilen mesajlara eklenmeyecektir.

source: Mass catch up
hr: Masovno dohvaæanje
ro: Capturare în masã
tr: Toplu yakalama

source: Should Mailman perform a <em>catchup</em> on the newsgroup?
hr: Treba li Mailman obaviti <em>hvatanje</em> na news grupi?
ro: Sã efectueze Mailman o capturare (<em>catchup</em>) din newsgroup?
tr: Mailman haber grubunda bir <em>yakalama</em> gerçekleþtirsin mi?

source: When you tell Mailman to perform a catchup on the newsgroup, this means that you want to start gating messages to the mailing list with the next new message found. All earlier messages on the newsgroup will be ignored. This is as if you were reading the newsgroup yourself, and you marked all current messages as <em>read</em>. By catching up, your mailing list members will not see any of the earlier messages.
hr: Kada ka¾ete Mailmanu da obavi dohvat preko news grupe, to znaèi da ¾elite zapoèeti prosljeðivati poruke mailing listi sa sljedeæom novom porukom koja je naðena. Sve ranije poruke na news grupi æe biti ignorirane. Ovo je slièno kao kad sami èitate news grupu i oznaèujete sve trenutne poruke kao <em>proèitane</em>. Dohvatom, èlanovi va¹e mailing liste neæe vidjeti niti jednu raniju poruku.
ro: Când spuneþi agentului Mailman sã facã o preluare (catchup) de pe un newsgroup, asta înseamnã cã doriþi sã începeþi direcþionarea mesajelor cãtre lista de discuþii, de la primul mesaj nou gãsit. Toate mesajele anterioare de pe newsgroup vor fi ignorate. Asta e ca ºi cum aþi fi citit singur newsgroup-ul ºi aþi fi marcat toate mesajele curente ca fiind <em>citite</em>. Prin preluare, membrii listei dumneavoastrã nu vor putea vedea nici unul din mesajele anterioare.
tr: Mailman'e haber grubunda bir yakalama gerçekleþtirmesini söylediðinizde, bu mesaj listesine, bulunan ilk yeni mesajla beraber mesajlarýn geçirilmesini istediðiniz anlamýna gelir. Haber grubunda daha önceden bulunan tüm mesajlar gözardý edilecektir. Bu, sanki haber grubunu kendiniz okuyormuþsunuz ve þu andaki tüm mesajlarý <em>okunmuþ</em> olarak iþaretlemiþsiniz gibidir. Yakalama ile mesaj listesi üyeleriniz, daha önceki haber grubu mesajlarýnýn hiçbirini görmeyecektir.

source: Mass catchup completed
hr: Masovno hvatanje je zavr¹eno
ro: Capturarea în masã s-a încheiat
tr: Toplu yakalama tamamlandý

source: You cannot enable gatewaying unless both the <a href="?VARHELP=gateway/nntp_host">news server field</a> and the <a href="?VARHELP=gateway/linked_newsgroup">linked newsgroup</a> fields are filled in.
hr: Ne mo¾ete omoguæiti prosljeðivanje ukoliko <a href="?VARHELP=gateway/nntp_host">news server polje</a> i <a href="?VARHELP=gateway/linked_newsgroup">linkana news grupa</a> polja nisu popunjena.
ro: Nu puteþi activa interconectarea pânã când atât câmpul <a href="?VARHELP=gateway/nntp_host">news server</a> cât ºi câmpul <a href="?VARHELP=gateway/linked_newsgroup">linked newsgroup</a> sunt completate.
tr: Hem <a href="?VARHELP=gateway/nntp_host">haber sunucusu alaný</a> hem de <a href="?VARHELP=gateway/linked_newsgroup">baðlanýlan haber grubu</a> alanlarýný doldurmadan geçitlemeyi etkinleþtiremezsiniz.

source: %(listinfo_link)s list run by %(owner_link)s
hr: %(listinfo_link)s listu vrti %(owner_link)s
ro: Lista %(listinfo_link)s este deþinutã de %(owner_link)s
tr: %(owner_link)s yönetimindeki %(listinfo_link)s listesi

source: %(realname)s administrative interface
hr: %(realname)s administrativno suèelje
ro: Interfaþa administrativã a %(realname)s
tr: %(realname)s yönetimsel arayüzü

source: (requires authorization)
hr: (zahtijeva autorizaciju)
ro: (necesitã autorizare)
tr: (yetki gerektirir)

source: Overview of all %(hostname)s mailing lists
hr: Pregled svih %(hostname)s mailing listi
ro: Toate listele de discuþii de pe %(hostname)s
tr: Tüm %(hostname)s mesaj listelerinin genel tanýtýmý

source: <em>(1 private member not shown)</em>
hr: <em>(1 privatni èlan nije prikazan)</em>
ro: <em>(1 abonat ascuns nu este afiºat)</em>
tr: <em>(1 özel üye görüntülenmiyor)</em>

source: <em>(%(num_concealed)d private members not shown)</em>
hr: <em>(%(num_concealed)d privatni èlanovi nisu prikazani)</em>
ro: <em>(%(num_concealed)d abonaþi ascunºi nu sunt afiºaþi)</em>
tr: <em>(%(num_concealed)d özel üye görüntülenmiyor)</em>

source: ; it was disabled by you
hr: ; onemoguæeno je sa va¹e strane
ro: ; a fost dezactivatã de cãtre dumneavoastrã
tr: ; sizin tarafýndan devre dýþý býrakýlmýþ

source: ; it was disabled by the list administrator
hr: ; onemoguæeno je od strane administratora liste
ro: ; a fost dezactivatã de cãtre administratorul listei
tr: ; liste yöneticisi tarafýndan devre dýþý býrakýlmýþ

source: ; it was disabled due to excessive bounces. The last bounce was received on %(date)s
hr: ; onemoguæeno je zbog pretjeranog odbijanja. Posljednje odbijanje je primljeno %(date)s
ro: ; a fost dezactivatã datoritã eºecurilor excesive. Ultima notiifcare de eºec a fost primitã în %(date)s
tr: ; çok fazla geri dönüþ sonucunda devre dýþý býrakýlmýþ. Son geri dönüþ %(date)s tarihinde alýnmýþ.

source: ; it was disabled for unknown reasons
hr: ; onemoguæeno je zbog nepoznatih razloga
ro: ; a fost dezactivatã din motive necunoscute
tr: ; bilinmeyen nedenlerle devre dýþý býrakýlmýþ

source: Note: your list delivery is currently disabled%(reason)s.
hr: Primjetite: dostava sa va¹e liste je trenutno onemoguæena%(reason)s.
ro: Notã: livrarea mesajelor listei este în acest moment dezactivatã%(reason)s.
tr: Not: size mesaj gönderimi þu anda devre dýþý%(reason)s.

source: Mail delivery
hr: Mail dostava
ro: Livrare mesaje
tr: Mesaj gönderimi

source: the list administrator
hr: administrator liste
ro: administratorul listei
tr: liste yöneticisi

source: <p>%(note)s <p>You may have disabled list delivery intentionally, or it may have been triggered by bounces from your email address. In either case, to re-enable delivery, change the %(link)s option below. Contact %(mailto)s if you have any questions or need assistance.
hr: <p>%(note)s <p>Mo¾da ste namjerno onemoguæili dostavu sa liste, ili ili je pokrenuto od strane odbijene poruke koja je poslana sa va¹e e-mail adrese. U bilo kojem sluèaju, da biste ponovno omoguæili dostavu, promjenite donje %(link)s opcije. Kontaktirajte %(mailto)s ako imate bilo kakvih pitanja ili trebate pomoæ.
ro: <p>%(note)s <p>Poate cã aþi dezactivat livrarea mesajelor listei în mod intenþionat, sau poate cã aceasta a fost declanºatã de eºcurile de livrare la adresa dumneavoastrã de email. În orice caz, pentru a re-activa livrarea modificaþi opþiunea %(link)s de mai jos. Contactaþi %(mailto)s dacã aveþi orice întrebãri sau aveþi nevoie de ajutor.
tr: <p>%(note)s <p>Bu listeden size mesaj gönderimini kendiniz devre dýþý býrakmýþ olabilirsiniz, veya e-posta adresinizden geri dönüþler nedeniyle tetiklenmiþ olabilir. Ýki durumda da aþaðýda %(link)s seçeneðini deðiþtirerek gönderimi etkinleþtirebilirsiniz. Herhangi bir sorunuz veya yardýma ihtiyacýnýz varsa %(mailto)s ile baðlantý kurun.
