Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: <p>We have received some recent bounces from your address. Your current <em>bounce score</em> is %(score)s out of a maximum of %(total)s. Please double check that your subscribed address is correct and that there are no problems with delivery to this address. Your bounce score will be automatically reset if the problems are corrected soon.
hr: <p>Dobili smo neke odbijene poruke sa va¹e e-mail adrese Va¹ trenutni <em>brojaè odbijanja</em> je na %(score)s od maksimalno %(total)s. Molim obavezno provjerite da li je va¹a pretplatièka adresa toèna i da nema problema sa dostavom na tu adresu Va¹ brojaè odbijanja æe automatski biti resetiran ako se problemi brzo isprave.
ro: <p>Recent am primit câteva notificãri de eºec în cazul livrãrii mesajelor la adresa dumneavoastrã. <em>Scorul de eºec</em> în cazul dumneavoastrã este de %(score)s faþã de maximul admis %(total)s. Vã rugãm sã verificaþi corectitudinea adresei dumneavoastrã de abonare, precum ºi faptul cã nu sunt probleme de livrare la aceastã adresã. Scorul dumneavoastrã de eºec va fi resetat automat dacã problemele se rezolvã în timp scurt.</p>
tr: <p>Adresinizden son zamanlarda bazý geri dönüþler aldýk. Þu andaki geri <em>dönüþ puanýnýz</em> toplam %(total)s üzerinden %(score)s. Lütfen üye olduðunuz adresin doðru olduðundan ve bu adrese gönderimlerde sorun olmadýðýndan emin olun. Eðer sorunlar düzelirse, geri dönüþ puanýnýz otomatik olarak sýfýrlanacaktýr.

source: (Note - you are subscribing to a list of mailing lists, so the %(type)s notice will be sent to the admin address for your membership, %(addr)s.)<p>
hr: (Primjetite - Vi ste pretplaæeni na listu mailing listi, tako da %(type)s obavijest æe biti poslana na administartorsku adresu va¹eg èlanstva, %(addr)s.)<p>
ro: (Notã - vã aonaþi la o listã de liste de discuþii, astfel încât notificarea %(type)s va fi trimisã la adresa administrativã pentru abonamentul dumneavoastrã, %(addr)s.)<p>
tr: (Not - mesaj listelerinin üye olduðu bir listeye üye oluyorsunuz, bu yüzden %(type)s bildirimi, üyeliðiniz %(addr)s adresinin yönetici adresine gönderilecek.)<p>

source: You will be sent email requesting confirmation, to prevent others from gratuitously subscribing you.
hr: Bit æe vam poslan e-mail u kojem se zahtjeva potvrda da bi se ostale sprijeèilo da vas pretplate.
ro: Veþi primi un cu o cerere de confirmare, pentru a preveni abonarea dumneavoastrã abuzivã.
tr: Baþka kiþilerin sizi isteðiniz dýþýnda üye yapmasýný engellemek için, onayýnýzý isteyen bir e-posta alacaksýnýz.

source: This is a closed list, which means your subscription will be held for approval. You will be notified of the list moderator's decision by email.
hr: Ovo je zatvorena lista, ¹to znaèi da æe va¹a pretplata biti zadr¾ana zbog odobrenja. Bit æete mailom obavje¹teni o odluci moderatora.
ro: Aceasta este o listã închisã, înseamnând cã cererea dumneavoastrã de abonare va fi reþinutã pentru aprobare. Veþi fi notificat prin email despre decizia moderatorului listei.
tr: Bu kapalý bir listedir, yani üyeliðiniz onay için bekletilecektir. Moderatörün kararýný bildiren bir e-posta alacaksýnýz.

source: also
hr: takoðer
ro: de asemenea
tr: ayrýca

source: You will be sent email requesting confirmation, to prevent others from gratuitously subscribing you. Once confirmation is received, your request will be held for approval by the list moderator. You will be notified of the moderator's decision by email.
hr: Biti æe vam poslan e-mail u kojem se zahtjeva potvrda, da bi se ostale sprijeèilo da vas pretplate. Jednom kada je potvrda primljena, va¹ zahtjev æe biti zadr¾an zbog odobrenja od strane moderatora liste. Bit æete mailom obavje¹teni o odluci moderatora.
ro: Veþi primi un mesaj prin care vi se cere confirmarea, pentru a preveni abonarea dumneavoastrã abuzivã de cãtre alte persoane. De îndatã ce confirmarea este primitã, cererea dumneavoastrã va fi reþinutã pentru aprobare de cãtre un moderator al listei. Veþi fi anunþat(ã) despre decizia moderatorului prin e-mail.
tr: Baþka kiþilerin sizi isteðiniz dýþýnda üye yapmasýný engellemek için, onayýnýzý isteyen bir e-posta alacaksýnýz. Onayýnýz alýndýðýnda, isteðiniz moderatör onayý için beklemeye alýnacaktýr. Moderatörün kararýný bildiren bir e-posta alacaksýnýz.

source: This is %(also)sa private list, which means that the list of members is not available to non-members.
hr: Ovo je %(also)s privatna lista, ¹to znaèi da lista èlanova nije dostupna onima koji nisu èlanovi.
ro: Aceasta este %(also)so listã privatã, însemnând cã lista membrilor abonaþi nu este disponibilã persoanelor externe.
tr: Bu liste %(also)s özel bir listedir, yani üye listesi üye olmayan kiþilerden gizlidir.

source: This is %(also)sa hidden list, which means that the list of members is available only to the list administrator.
hr: Ovo je %(also)s skrivena lista, ¹to znaèi da je lista èlanova dostupna samo administratorima liste.
ro: Aceasta este %(also)so listã ascunsã, însemnând cã lista membrilor abonaþi este disponibilã numai administratorilor listei.
tr: Bu liste %(also)s gizli bir listedir, yani üye listesi sadece liste yöneticilerine görünür durumdadýr.

source: This is %(also)sa public list, which means that the list of members list is available to everyone.
hr: Ovo je %(also)s javna lista, ¹to znaèi da je lista èlanova dostupna svakome.
ro: Aceasta este %(also)so listã publicã, însemnând cã lista membrilor abonaþi este disponibilã oricui.
tr: Bu liste %(also)s genel bir listedir, yani üye listesi herkese görünür durumdadýr.

source: (but we obscure the addresses so they are not easily recognizable by spammers).
hr: (ali mi za¹titimo adrese tako da one nisu jednostavno prepoznate od strane spammera).
ro: (dar ascundem puþin adresele de email, astfel încât acestea sã nu fie uºor de recunoscut de cãtre roboþii de spam).
tr: (ancak adresleri spam atan kiþiler tarafýndan kolayca anlaþýlamayacak hale gelecek þekilde deðiþtiriyoruz).

source: <p>(Note that this is an umbrella list, intended to have only other mailing lists as members. Among other things, this means that your confirmation request will be sent to the `%(sfx)s' account for your address.)
hr: <p>(Primjetite da je ovo za¹titna lista, namjenjena tome da sadr¾i samo druge mailing liste kao èlanove. Izmeðu ostalog, ovo znaèi da æe va¹ zahtjev za potvrdom biti poslan na `%(sfx)s' raèun za va¹u adresu.)
ro: <p>Notaþi cã aceasta este o listã-umbrelã, ce are ca ºi membrii abonaþi doar alte liste de discuþii. Printre altele, asta înseamnã cã cererea de confirmare va fi trimisã la contul '%(sfx)s' pentru adresa dumneavoastrã.)
tr: <p>(Bunun bir kapsayýcý liste olduðuna dikkat edin, yani amacý sadece baþka mesaj listelerini üyesi olarak almaktýr. Baþka durumlarla beraber, bu, size gönderilecek onay isteðinin adresinizin `%(sfx)s' hesabýna gönderileceði anlamýna gelir.)

source: <b><i>either</i></b>
hr: <b><i>ili</i></b>
ro: <strong><em>sau</em></strong>
tr: <strong><i>ya</i></strong>

source: To unsubscribe from %(realname)s, get a password reminder, or change your subscription options %(either)senter your subscription email address: <p><center>
hr: Da biste se odjavili sa %(realname)s, dobili podsjetnik lozinke, ili promjenili va¹e pretplatnièke postavke %(either)sunesite va¹u pretplatnièku e-mail adresu: <p><center>
ro: Pentru a vã dezabona de la %(realname)s, pentru a primi notificãri de reamintire a parolei de acces sau pentru a vã modifica opþiunile de abonament, %(either)s introduceþi adrea dumneavoastrã de abonare: <p><center>
tr: %(realname)s listesinden çýkmak, bir þifre hatýrlatýcý istemek, veya üyelik seçeneklerinizi deðiþtirmek için %(either)süyelik e-posta adresinizi girin: <p><center>

source: Unsubscribe or edit options
hr: Odjavite se ili uredite postavke
ro: Opþiuni de modificare sau dezabonare
tr: Listeden çýk veya seçeneklerimi düzenle

source: <p>... <b><i>or</i></b> select your entry from the subscribers list (see above).
hr: <p>... <b><i>ili</i></b> izaberite va¹u stavku iz liste pretplatnika (pogledajte dole).
ro: <p>... <b><i>sau</i></b> alegeþi valoarea corespunzãtoare din lista abonaþilor (vezi mai sus).
tr: <p>... <strong><i>veya</i></strong> üye listesinden kendi giriþinizi seçin (yukarýya bakýn).

source: If you leave the field blank, you will be prompted for your email address
hr: Ako ostavite polje prazno, bit æete upitani za svoju e-mail adresu
ro: Dacã lãsaþi acest câmp gol, vi se va cere adresa de e-mail
tr: Alaný boþ býrakýrsanýz, sizden e-posta adresiniz istenecektir.

source: (<i>%(which)s is only available to the list members.</i>)
hr: (<i>%(which)s je dostupna samo èlanovima liste.</i>)
ro: (<i>%(which)s este disponibilã numai membrilor listei.</i>)
tr: (<i>%(which)s sadece liste üyelerine görünür durumdadýr.</i>)

source: (<i>%(which)s is only available to the list administrator.</i>)
hr: (<i>%(which)s je dostupno samo administratorima liste.</i>)
ro: (<i>%(which)s este disponibil numai la administratratorul listei.</i>)
tr: (<i>%(which)s sadece liste yöneticisine görünür durumdadýr.</i>)

source: Click here for the list of
hr: Kliknite ovdje za listu
ro: Click aici pentru o listã a

source: subscribers:
hr: pretplatnika:
ro: abonaþi:
tr: listesinin üye listesi için buraya týklayýn:

source: Visit Subscriber list
hr: Posjetite listu Pretplatnika
ro: Acceseazã lista abonaþilor
tr: Üye listesine git

source: members
hr: èlanovi
ro: membrii
tr: üyeler

source: Address:
hr: Adresa:
ro: Adresa:
tr: Adres:

source: Admin address:
hr: Admin adresa:
ro: Adresa administratorului:
tr: Yönetici adresi:

source: The subscribers list
hr: Lista pretplatnika
ro: Lista abonaþilor
tr: Üye listesi

source: <p>Enter your
hr: <p>Email
ro: <p> Introduceþi
tr: <p>Üye listesini görmek için

source: and password to visit the subscribers list: <p><center>
hr: i lozinka s kojom pristupate listi pretplatnika: <p><center>
ro: ºi parola dumneavoastrã pentru a vizita lista abonaþilor: <p><center>
tr: ve þifrenizi girin: <p><center>

source: Password:
hr: Lozinka:
ro: Parola:
tr: Þifre:

source: Visit Subscriber List
hr: Posjetite Listu Pretplatnika
ro: Afiºaþi lista abobaþilor
tr: Üye Listesine Git

source: Once a month, your password will be emailed to you as a reminder.
hr: Jednom mjeseèno, va¹a æe vam lozinka biti mailana kao podsjetnik.
ro: Lunar, parola de acces vã va fi trimisã ca un mesaj de reamintire.
tr: Ayda bir, þifreniz size e-posta yoluyla hatýrlatýlacaktýr.

source: The current archive
hr: Trenutna arhiva
ro: Arhiva curentã
tr: Þu andaki arþiv

source: %(realname)s post acknowledgement
hr: %(realname)s potvrda poruke
ro: Confirmare de publicare pe %(realname)s
tr: %(realname)s gönderim bilgisi

source: Your urgent message to the %(realname)s mailing list was not authorized for delivery. The original message as received by Mailman is attached.
hr: Va¹a hitna poruka na %(realname)s mailing listu nije autorizirana za dostavu. Izvorna poruka primljena od strane Mailmana je u privitku.
ro: Mesajul dumneavoastrã urgent cãtre lista %(realname)s nu a fost autorizat pentru livrare. Ataºat aveþi mesajul original, aºa cum a fost primit de cãtre Mailman.
tr: %(realname)s mesaj listesine gönderdiðiniz acil mesaj, gönderim için yetkilendirilmedi. Mailman tarafýndan alýnan özgün mesaj ektedir.

source: Emergency hold on all list traffic is in effect
hr: U tijeku je hitno zadr¾avanje cjelokupnog prometa sa liste
ro: Reþinerea de urgenþã a întregului trafic al listei este în funcþiune
tr: Tüm liste trafiðinde acil bekletme etkin

source: Your message was deemed inappropriate by the moderator.
hr: Va¹a poruka je procjenjena kao neodgovarajuæa od strane moderatora.
ro: Mesajul dumneavoastrã a fost considerat nepotrivit de cãtre moderatorul listei.
tr: Moderatör, mesajýnýzýn uygun olmadýðýna karar verdi.

source: Sender is explicitly forbidden
hr: Po¹iljatelj je eksplicitno zabranjen
ro: Expeditorul are interdicþie explicitã
tr: Gönderici açýk þekilde yasaklanmýþ

source: You are forbidden from posting messages to this list.
hr: Zabranjeno vam je slanje poruka na ovu listu.
ro: Vã este interzisã publicarea de mesaje pe aceastã listã.
tr: Bu listeye mesaj göndermeniz yasaktýr.

source: Post to moderated list
hr: Po¹aljite poruku na moderiranu listu
ro: Publicat pe o listã suprevegheatã
tr: Moderatör onaylý listeye mesaj gönderimi

source: Post by non-member to a members-only list
hr: Poruka poslana od strane ne-èlana na samo-èlasku listu
ro: Publicat de o persoanã neabonatã pe o listã exclusivã
tr: Sadece üyelerin mesaj atabildiði listeye üye olmayan kiþi mesajý

source: Non-members are not allowed to post messages to this list.
hr: Onima koji nisu èlanovi nije dozvoljeno slanje poruka na ovu listu.
ro: Persoanele neabonate nu au permisiunea de a publica mesaje pe aceastã listã.
tr: Bu listeye, üye olmayan kiþilerin mesaj atmasý yasaktýr.

source: Posting to a restricted list by sender requires approval
hr: Poslana poruka na listu sa ogranièenjima zahtjeva odobrenje
ro: Publicarea pe o listã restricþionatã dupã expeditor necesitã aprobare
tr: Kýsýtlý bir listeye gönderim onay gerektirir.

source: This list is restricted; your message was not approved.
hr: Ova lista sadr¾i ogranièenja; va¹a poruka nije odobrena.
ro: Aceastã listã este restricþionatã; mesajul dumneavoastrã nu a fost aprobat.
tr: Bu liste kýsýtlý, mesajýnýz onaylanmadý.

source: Too many recipients to the message
hr: Previ¹e primatelja poruke
ro: Prea multe recipiente (adrese) în mesaj
tr: Mesajda çok fazla alýcý var

source: Please trim the recipient list; it is too long.
hr: Molim, skratite listu primatelja; ista je predugaèka.
ro: Vã rugãm sã micºoraþi lista destinatarilor; este prea lungã.
tr: Lütfen alýcý listesini kýsaltýn; liste çok uzun.

source: Message has implicit destination
hr: Poruka ima implicitno odredi¹te
ro: Mesajul are destinaþie implicitã
tr: Mesajýn gideceði yer örtülü

source: Blind carbon copies or other implicit destinations are not allowed. Try reposting your message by explicitly including the list address in the To: or Cc: fields.
hr: Blind carbon copies (Bcc) ili druga implicitna odredi¹ta nisu dozvoljena. Poku¹ajte ponovo poslati va¹u poruku eksplicitno ukljuèujuæi adresu u To: ili Cc: polja.
ro: Copiile oarbe (BCc) sau alte destinaþii implicite nu sunt permise. Încercaþi sã retrimiteþi mesajul, incluzând explicit adresa listei în câmpurile To sau Cc.
tr: Kör karbon kopyalar (Bcc) veya baþka örtülü alýcý adreslerine izin verilmemektedir. Mesajýnýzý, liste adresini Alýcý: veya Cc: alanlarýnda açýk þekilde yazarak, tekrar göndermeyi deneyin.

source: Message may contain administrivia
hr: Poruka mo¾e sadr¾avati administrativne zahtjeve
ro: S-ar putea ca mesajul sã conþinã comenzi administrative
tr: Mesaj yönetimsel bilgi içeriyor olabilir

source: Please do *not* post administrative requests to the mailing list. If you wish to subscribe, visit %(listurl)s or send a message with the word `help' in it to the request address, %(request)s, for further instructions.
hr: Molim *ne* ¹aljite administrativne zahtjeve na mailing listu. Ako se ¾elite pretplatiti, posjetite %(listurl)s ili po¹aljite poruku sa rijeèi `help' u istoj, na adresu %(request)s, za daljnje upute.
ro: Vã rugãm sã *nu* publicaþi cereri administrative pe lista de discuþii. Dacã doriþi sã pãrãsiþi aceastã listã, vizitaþi %(listurl)s sau trimiteþi un mesaj conþinând doar cuvântul 'help' la adresa de cereri, %(request)s, pentru a obþine informaþii suplimentare.
tr: Lütfen yönetimsel istekleri mesaj listesine *göndermeyin*. Eðer üye olmak istiyorsanýz, %(listurl)s adresine gidin, veya daha fazla bilgi için %(request)s istek adresine içinde `help' sözcüðü geçen bir mesaj gönderin.

source: Message has a suspicious header
hr: Poruka ima sumnjivo zaglavlje
ro: Mesajul are un header suspicios
tr: Mesaj þüpheli bir baþlýk içeriyor

source: Your message had a suspicious header.
hr: Va¹a poruka ima sumnjivo zaglavlje.
ro: Mesajul dumneavoastrã are un header suspicios.
tr: Mesajýnýzda þüpheli bir baþlýk vardý.

source: Message body is too big: %(size)d bytes with a limit of %(limit)d KB
hr: Tijelo poruke je previ¹e veliko: %(size)d bytes sa ogranièenjem od %(limit)d KB
ro: Corpul mesajului este prea mare: %(size)d octeþi pentru o limitã maximã de %(limit)d Ko
tr: Mesaj gövdesi çok büyük: %(limit)d KB'lýk bir sýnýr ile %(size)d bayt

source: Your message was too big; please trim it to less than %(kb)d KB in size.
hr: Va¹a poruka je prevelika; molim skratite je na manje od %(kb)d KB.
ro: Mesajul dumneavoastrã este prea mare; vã rugãm sã-l reduceþi la mai puþin de %(kb)d Ko.
tr: Mesajýnýz çok büyüktü; lütfen %(kb)d KB'tan daha küçük olacak þekilde kýsaltýn.

source: Posting to a moderated newsgroup
hr: Slanje poruke na moderiranu news grupu
ro: Publicarea la un newsgroup supravegheat
tr: Moderatör onaylý bir haber grubuna mesaj gönderimi

source: Your message to %(listname)s awaits moderator approval
hr: Va¹a poruka na %(listname)s èeka odobrenje moderatora
ro: Mesajul dumneavoastrã la %(listname)s aºteaptã aprobarea moderatorului
tr: %(listname)s listesine gönderdiðiniz mesaj moderatör onayý bekliyor

source: %(listname)s post from %(sender)s requires approval
hr: %(listname)s poruka od strane %(sender)s treba odobrenje
ro: Mesajul trimis de %(sender)s pentru %(listname)s necesitã aprobare
tr: %(sender)s tarafýndan gönderilen %(listname)s liste mesajý onay gerektiriyor

source: If you reply to this message, keeping the Subject: header intact, Mailman will discard the held message. Do this if the message is spam. If you reply to this message and include an Approved: header with the list password in it, the message will be approved for posting to the list. The Approved: header can also appear in the first line of the body of the reply.
hr: Ako odgovorite na ovu poruku, ostavljajuæi Subject: zaglavlje nedirnuto, Mailman æe odbaciti zadr¾anu poruku. Ovo napravite ako je rijeè o spam poruci. Ukoliko odgovorite na ovu poruku i ukljuèite Odobreno: zaglavlje sa lozinkom liste, poruka æe biti odobrena za slanje na listu. Odobreno: zaglavlje se mo¾e takoðer pojaviti u prvoj liniji tijela odgovora.
ro: Dacã rãspundeþi la acest mesaj, pãstrând headerul Subject: intact, Mailman va ignora mesajul reþinut. Faceþi asta dacã mesajul primit este spam. Dacã rãspundeþi la acest mesaj ºi includeþi un header Approved:, împreunã cu parola listei inclusã, mesajul va fi aprobat pentru publicare pe listã. Headerul Approved: poate apare ºi în prima linie a corpului mesajului replicã.
tr: Konu: baþlýðýný deðiþtirmeden bu mesajý yanýtlarsanýz, Mailman bekleyen mesajý gözardý edecektir. Mesaj spam ise bunu yapýn. Eðer bu mesajý yanýtlar ve içinde liste þifresi olan bir Approved: baþlýðý eklerseniz, mesaj listeye gönderim için onaylanacaktýr. Approved: baþlýðý ayrýca yanýt mesajýnýn gövdesinin ilk satýrýnda da olabilir.

source: The message's content type was explicitly disallowed
hr: Tip sadr¾aja poruke je eksplicitno nedozvoljen
ro: Tipul conþinutului acestui mesaj a fost explicit restricþionat
tr: Mesajýn içerik türüne açýk þekilde izin verilmedi

source: The message's content type was not explicitly allowed
hr: Tip sadr¾aja poruke je eksplicitno dozvoljen
ro: Tipul conþinutului acestui mesaj nu a fost explicit permis
tr: Mesajýn içerik türü açýk þekilde izin verilenler listesinde deðildi

source: The message's file extension was explicitly disallowed
ro: Tipul conþinutului acestui mesaj a fost explicit restricþionat

source: The message's file extension was not explicitly allowed
ro: Tipul conþinutului acestui mesaj nu a fost explicit permis

source: After content filtering, the message was empty
hr: Nakon filtriranja sadr¾aja, poruka je bila prazna
ro: Dupã filtrarea conþinutului, mesajul a rãmas gol
tr: Ýçerik filtreleme sonunda, mesaj boþ kaldý

source: The attached message matched the %(listname)s mailing list's content filtering rules and was prevented from being forwarded on to the list membership. You are receiving the only remaining copy of the discarded message.
hr: Poruka u privitku se podudara sa pravilima filtriranja sadr¾aja %(listname)s mailing liste, te je ista sprijeèena da bude prosljeðena èlanstvu liste. Vi primate jedinu kopiju odbaèene poruke.
ro: Mesajul ataºat se încadreazã în regulile de filtrare de conþinut ale listei %(listname)s ºi a fost blocat. Dumneavoastrã aþi primit singura copie a mesajului ignorat.
tr: Ekteki mesaj %(listname)s mesaj listesinin içerik filtreleme kurallarýyla eþleþti ve listeye iletilmesi engellendi. Gözardý edilen mesajýn kalan son kopyasýný aldýnýz.

source: Content filtered message notification
hr: Obavijest o filtriranom sadr¾aju poruke
ro: Notificare de filtrare a conþinutului mesajului
tr: Ýçeriði filtrelenmiþ mesaj bildirimi

source: You are not allowed to post to this mailing list, and your message has been automatically rejected. If you think that your messages are being rejected in error, contact the mailing list owner at %(listowner)s.
hr: Nije vam dozvoljeno slati poruke na ovu mailing listu, tako da je va¹a poruka automatski odbijena. Ako mislite da su va¹e poruke gre¹kom odbijene, kontaktirajte vlasnika mailing liste na %(listowner)s.
ro: Nu aveþi dreptul de a publica mesaje pe aceastã listã, iar mesajul dumneavoastrã a fost respins automat. Dacã credeþi cã mesajele dumneavoastrã sunt respinse in mod eronat, contactaþi proprietarul listei la %(listowner)s.s
tr: Bu listeye mesaj göndermenize izin verilmiyor ve mesajýnýz otomatik olarak reddedildi. Eðer mesajlarýnýzýn bir hata sonucu reddedildiðini düþünüyorsanýz, %(listowner)s adresinden mesaj listesi sahibiyle baðlantýya geçin.

source: Auto-discard notification
hr: Auto-odbaci obavijest
ro: Notificare de ignorare automatã
tr: Otomatik gözardý etme bildirimi

source: The attached message has been automatically discarded.
hr: Poruka u privitku je autmatski odbaèena.
ro: Mesajul ataºat a fost automat ignorat.
tr: Ekteki mesaj otomatik olarak gözardý edildi.

source: Auto-response for your message to the "%(realname)s" mailing list
hr: Auto-odgovor za va¹u poruku na "%(realname)s" mailing listu
ro: Rãrpunsul automat pentru mesajul dumneavoastrã cãtre lista de discuþii "%(realname)s"
tr: "%(realname)s" mesaj listesine gönderdiðiniz mesaj için otomatik yanýt

source: The Mailman Replybot
hr: Mailmanov Robot Odgovora
ro: Robotul de rãspunsuri automate Mailman
tr: Mailman Yanýt Robotu

source: HTML attachment scrubbed and removed
hr: HTML privitak izbaèen i uklonjen
ro: Ataºamentul HTML a fost eliminat
tr: HTML eklentisi temizlendi ve silindi

source: An HTML attachment was scrubbed... URL: %(url)s
hr: HTML privitak je izbaèen... URL: %(url)s
ro: Un ataºament HTML a fost eliminat URL: %(url)s
tr: Bir HTML eklentisi temizlendi... URL: %(url)s

source: no subject
hr: nema naslova
ro: fãrã subiect
tr: konu yok

source: no date
hr: nema datuma
ro: fãrã datã
tr: tarih yok

source: unknown sender
hr: nepoznati po¹iljatelj
ro: expeditor necunoscut
tr: bilinmeyen gönderici

source: Skipped content of type %(partctype)s
ro: Am sãrit conþinutul de tipul %(partctype)s

source: -------------- next part --------------
hr: -------------- sljedeæi dio --------------
ro: -------------- partea urmãtoare --------------
tr: -------------- sonraki bölüm --------------

source: The message headers matched a filter rule
ro: Headerele mesajului se potrivesc cu o regulã de filtrare
tr: Mesaj baþlýklarý bir filtre kuralý ile eþleþti

source: Message rejected by filter rule match
ro: Mesaj respins prin activarea unei reguli de filtrare
tr: Mesaj filtre kuralý eþleþmesi sonucu reddedildi

source: %(realname)s Digest, Vol %(volume)d, Issue %(issue)d
hr: %(realname)s Digest, Broj %(volume)d, Izdanje %(issue)d
ro: Rezumat %(realname)s, Vol %(volume)d, Nr. %(issue)d
tr: %(realname)s Toplu Mesajý, Sayý %(volume)d, Konu %(issue)d
