Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: While Mailman's bounce detector is fairly robust, it's impossible to detect every bounce format in the world. You should keep this variable set to <em>Yes</em> for two reasons: 1) If this really is a permanent bounce from one of your members, you should probably manually remove them from your list, and 2) you might want to send the message on to the Mailman developers so that this new format can be added to its known set. <p>If you really can't be bothered, then set this variable to <em>No</em> and all non-detected bounces will be discarded without further processing. <p><b>Note:</b> This setting will also affect all messages sent to your list's -admin address. This address is deprecated and should never be used, but some people may still send mail to this address. If this happens, and this variable is set to <em>No</em> those messages too will get discarded. You may want to set up an <a href="?VARHELP=autoreply/autoresponse_admin_text">autoresponse message</a> for email to the -owner and -admin address.
hr: Iako je Mailmanov detektor odbijenih poruka poprilièno robustan, nemoguæe je detektirati svaki format odbijene poruke u svijetu. Ovu varijablu bi trebali postaviti na <em>Da</em> zbog dva razloga: 1) Ukoliko je ovo stvarno poruka nekog èlana koja se trajno odbija, trebali biste ruèno istog ukloniti s liste i 2) mo¾da biste ¾eljeli poslati poruku onima koji rade na razvoju Mailmana, tako da taj novi format poruke mo¾e biti dodan u bazu veæ poznatih formata. <p>Ako se stvarno ne ¾elite zamarati s ovim, postavite vrijednost ove varijable na <em>Ne</em> i sve nedetektirane odbijene poruke bit æe odbaèene bez daljnje obrade. <p><b>Primjetite:</b> Ova postavka æe takoðer utjecati na sve poruke koje su poslane na va¹u administratorsku adresu liste. Ista adresa nije odobrena i ne bi trebala biti kori¹tena, ali æe pojedinci na nju i dalje slati mail. Ako se to dogodi, a varijabla je postavljena na <em>Ne</em> i te æe poruke biti takoðer odbaèene. Ako ¾elite, mo¾ete postaviti <a href="?VARHELP=autoreply/autoresponse_admin_text">automatski odgovor na poruku</a> za e-mail poslan na -owner i -admin adresu.
ro: Deºi detectorul Mailman al eºecurilor de livrare este destul de robust, este aproape imposibil sã detectezi toate formatele de notificãri de eºecuri. Ar trebui sã lãsaþi aceastã variabilã setatã pe valoarea <em>Da</em> din douã motive: 1) Dacã acesta este într-adevãr un eºec permanent la adresa unuia din abonaþi, cel mai probabil va trebui sã-l ºtergeþi manual din listã ºi 2) aþi putea trimite un mesaj cãtre dezvoltatorii Mailman, astfel încât noul format de notificare de eºec sã fie adãugat la setul existent. <p>Dacã doriþi neapãrat sã nu fiþi deranjat, setaþi aceastã variabilã pe <em>Nu</em> ºi toate eºecurile ne-detectate vor fi ignorate fãrã procesãri ulterioare. <p><b>Notã:</b> Aceastã setare va afecta deopotrivã ºi toate mesajele trimise pe adresa -admin a listei. Aceastã adresã este depreciatã ºi nefolositã în prezent, dar unii utilizatori s-ar putea s-o mai foloseascã. Dacã acest lucru se întâmplã, ºi variabila este setatã pe <em>Nu</em>, mesajele trimise vor fi ignorate. Poate veþi dori sã setaþi un <a href="?VARHELP=autoreply/autoresponse_admin_text">rãspuns automat</a> pentru mesajele trimise la adresele -owner ºi respectiv -admin.
tr: Mailman'in geri dönüþ algýlayýcýsýnýn yeterince saðlam olmasýna raðmen dünyadaki tüm geri dönüþ biçimlerini algýlamak imkansýzdýr. Bu deðeri <em>Evet</em> olarak ayarlamanýz için iki neden vardýr: 1) Bu, gerçekten üyelerinizden birinden kalýcý bir geri dönüþse, onu listenizden kalýcý olarak silmek isteyebilirsiniz; 2) Bu mesajý Mailman geliþtiricilerine göndererek, yeni biçimi bilinen biçimler listesine eklemelerini isteyebilirsiniz. <p>Eðer gerçekten rahatsýz edilmek istemiyorsanýz, bu deðeri <em>Hayýr</em> olarak ayarlayýn, böylece algýlanamayan tüm geri dönüþler baþka iþlem yapýlmaksýzýn gözardý edilecektir. <p><strong>Not:</strong> Bu ayar, ayrýca listenizin -admin adresine gönderilen tüm mesajlarý etkiler. Bu adresin kullanýmý artýk onaylanmasa da bazý kiþiler hala bu adrese e-posta göndermek isteyebilir. Eðer böyle bir durum varsa ve bu deðiþken <em>Hayýr</em> olarak ayarlandýysa bu mesajlar da gözardý edilecektir. Ayrýca -owner ve -admin adresleri için bir <a href="?VARHELP=autoreply/autoresponse_admin_text">otomatik yanýt mesajý</a> da oluþturmak isteyebilirsiniz.

source: Should Mailman notify you, the list owner, when bounces cause a member's subscription to be disabled?
hr: Treba li vas kao vlasnika liste Mailman obavijestiti kada odbijanje poruka uzrokuje onemoguæavanje èlanske pretplate?
ro: Sã vã atenþioneze Mailman, în calitate de proprietar al listei, cãnd eºecurile de livrare (bounces) vor duce la dezactivarea abonamentului unui utilizator?
tr: Mailman sizi, liste sahibini, geri dönüþler nedeniyle bir üyenin üyeliði devre dýþý býrakýlýrsa bilgilendirsin mi?

source: By setting this value to <em>No</em>, you turn off notification messages that are normally sent to the list owners when a member's delivery is disabled due to excessive bounces. An attempt to notify the member will always be made.
hr: Postavljanjem ove vrijednosti na <em>Ne</em>, iskljuèujete obavjesne poruke koje se obièno ¹alju vlasnicima liste kada je dostava za nekog èlana onemoguæena zbog pretjeranog odbijanja poruka. Poku¹aj da se èlan o tome obavijesti bit æe uvijek napravljen.
ro: Prin setarea acestei valori la <em>Nu</em>, veþi opri notificãrile ce sunt trimise în mod normal proprietarilor listei când abonamentul unui membru este dezactivat din cauza eºecurilor excesive de livrare (bounces). O încercare de contactare a abonatului va fi fãcutã oricum.
tr: Bu deðeri <em>Hayýr</em> olarak ayarlayarak, normalde fazla geri dönüþ yüzünden bir üyeye gönderim devre dýþý býrakýldýysa liste sahiplerine gönderilen bildirim mesajlarýný kapatýr. Üyeye bir bildirim gönderilmesi her zaman denenecektir.

source: Should Mailman notify you, the list owner, when bounces cause a member to be unsubscribed?
hr: Treba li vas kao vlasnika liste Mailman obavijestiti kada odbijanje poruka uzrokuje odjavu èlana s liste?
ro: Doriþi ca Mailman sã vã notifice, în calitate de proprietar al listei, în momentul în care un membru este dezabonat din cauza eºecurilor de transmitere (bounces) ?
tr: Mailman sizi, liste sahibini, geri dönüþler yüzünden bir üyenin üyeliði silindiði zaman bilgilendirsin mi?

source: By setting this value to <em>No</em>, you turn off notification messages that are normally sent to the list owners when a member is unsubscribed due to excessive bounces. An attempt to notify the member will always be made.
hr: Postavljanjem vrijednosti ove varijable na <em>Ne</em>, iskljuèujete obavjesne poruke, koje se obièno ¹alju vlasnicima liste kada je èlan odjavljen sa liste zbog pretjeranog odbijanja poruka. Poku¹aj da se èlan o tome obavijesti bit æe uvijek napravljen.
ro: Setând aceastã valoare pe <em>Nu</em>, veþi dezactiva mesajele de notificare ce sunt trimise în mod normal proprietarilor listei la dezabonarea unui membru din cauza eºecurilor excesive. Întotdeauna se va încesrca notificarea membrului dezabonat.
tr: Bu deðeri <em>Hayýr</em> olarak ayarlayarak, normalde fazla geri dönüþ yüzünden bir üyenin üyeliði silindiyse liste sahiplerine gönderilen bildirim mesajlarýný kapatýr. Üyeye bir bildirim gönderilmesi her zaman denenecektir.

source: Bad value for <a href="?VARHELP=bounce/%(property)s" >%(property)s</a>: %(val)s
hr: Kriva vrijednost za <a href="?VARHELP=bounce/%(property)s" >%(property)s</a>: %(val)s
ro: Valoare eronatã pentru <a href="?VARHELP=bounce/%(property)s">%(property)s</a>: %(val)s
tr: <a href="?VARHELP=bounce/%(property)s" >%(property)s</a> için kötü deðer: %(val)s

source: Content&nbsp;filtering
hr: Filter&nbsp;sadr¾aja
ro: Filtrare de conþinut
tr: Ýçerik&nbsp;Filtreleme

source: Forward to List Owner
hr: Proslijedi Vlasniku Liste
ro: Înainteazã proprietarului listei
tr: Liste Sahibine Ýlet

source: Preserve
hr: Saèuvaj
ro: Pãstreazã
tr: Koru

source: Should Mailman filter the content of list traffic according to the settings below?
hr: Treba li Mailman filtrirati sadr¾aj prometa s liste prema donjim postavkama?
ro: Sã filtreze Mailman traficul listei conform regulilor de mai jos?
tr: Mailman liste trafiði içeriðini aþaðýdaki ayarlara göre filtrelesin mi?

source: Remove message attachments that have a matching content type.
hr: Ukloni privitke poruka koji se podudaraju s tipovima sadr¾aja.
ro: ªterge ataºamentele mesajelor cu conþinutul (content-type) specificat.
tr: Eþleþen içerik türüne sahip mesaj eklentilerini sil.

source: Use this option to remove each message attachment that matches one of these content types. Each line should contain a string naming a MIME <tt>type/subtype</tt>, e.g. <tt>image/gif</tt>. Leave off the subtype to remove all parts with a matching major content type, e.g. <tt>image</tt>. <p>Blank lines are ignored. <p>See also <a href="?VARHELP=contentfilter/pass_mime_types" >pass_mime_types</a> for a content type whitelist.
hr: Koristite ovu opciju da biste uklonili svaki privitak poruke koji se podudara s jednim od ovih tipovima sadr¾aja. Svaka linija treba sadr¾avati tekst koji imenuje MIME <tt>type/subtype</tt>, npr. <tt>image/gif</tt>. Ostavite subtype da biste uklonili sve dijelove èiji se glavni sadr¾aj podudara s tipom sadr¾aja, npr. <tt>image</tt>. <p>Prazne linije se ignoriraju. <p>Pogledajte <a href="?VARHELP=contentfilter/pass_mime_types" >prolazni_mime_tipovi</a> za tip sadr¾aja na bijeloj listi.
ro: Folosiþi aceastã opþiune pentu a ºterge orice ataºament din lista prezentatã. Fiecare rând trebuie sã conþinã un string care sã denumeascã un tip MIME, dupã principiul <tt>tip/subtip</tt>. Lãsaþi subtipul necompletat pentru a ºterge toate ataºamentele din tipul major (de ex. <tt>image</tt>. Liniile goale sunt ignorate Vedeþi, de asemenea, <a href="?VARHELP=contentfilter/pass_mime_types">pass_mime_types</a> pentru lista tipurilor de conþinut acceptate.
tr: Bu seçeneði, bu içerik türleriyle eþleþen her bir mesaj eklentisini silmek için kullanýn. Her satýr bir MIME <tt>tür/alttür</tt> (örneðin <tt>image/gif</tt>) içermelidir. Ana içerik türüne eþleþen tüm parçalarý silmek için alttür kýsmýný boþ býrakýn (örneðin <tt>image</tt>). <p>Boþ satýrlar gözardý edilir. <p>Ayrýca <a href="?VARHELP=contentfilter/pass_mime_types" >pass_mime_types</a> bölümünde geçmesine izin verilecek türleri belirleyebilirsiniz.

source: Remove message attachments that don't have a matching content type. Leave this field blank to skip this filter test.
hr: Ukloni privitke poruka koji se ne podudaraju s tipovima sadr¾aja. Ostavite ovo polje prazno da biste preskoèili test filtera.
ro: Eliminã ataºamentele mesajelor care nu au un content-type corespunzãtor. Lãsaþi acest câmp gol pentru a sãri peste acest test de filtrare.
tr: Eþleþen bir içerik türüne sahip olmayan mesaj eklentilerini siler. Bu filtre testini atlamak için bu alaný boþ býrakýn.

source: Use this option to remove each message attachment that does not have a matching content type. Requirements and formats are exactly like <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_types</a>. <p><b>Note:</b> if you add entries to this list but don't add <tt>multipart</tt> to this list, any messages with attachments will be rejected by the pass filter.
hr: Koristite ovu opciju da biste uklonili svaki privitak poruke koji nema odgovarajuæi tip sadr¾aja. Potrebe i formati su isti kao <a href="?VARHELP=contentfilter/filter_mime_types" >filteri_mime_tipova</a>. <p><b>Primijetite:</b> Ukoliko na ovu listu dodate unose, a ne dodate <tt>multipart</tt>, svaka poruka s privicima biti æe odbaèena od strane prolaznog filtera.
ro: Aceastã opþiune va elimina orice ataºament al mesajului trimis care nu corespunde unui tip de conþinut definit. Cerinþele ºi formatele sunt exact ca ºi în cazul <a href="?VARHELP=contentfilter/filter_mime_types>filter_mime_types</a>. <p><b>Notã:</b> dacã adãugaþi articole în aceastã listã, dar nu aveþi ºi valoarea <tt>multipart</tt> inclusã, toate mesajele cu ataºamente vor fi blocate de filtru.
tr: Bu seçeneði eþleþen bir içerik türü olmayan tüm mesaj eklentilerini silmek için kullanýn. Gereksinimler ve biçimler aynen <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_types</a> bölümündeki gibidir. <p><strong>Not:</strong> Eðer bu listeye giriþler eklerseniz, fakat <tt>multipart</tt> eklemezseniz, eklentiye sahip tüm mesajlar filtre tarafýndan reddedilecektir.

source: Remove message attachments that have a matching filename extension.
ro: ªterge ataºamentele mesajelor cu conþinutul (content-type) specificat.

source: Should Mailman convert <tt>text/html</tt> parts to plain text? This conversion happens after MIME attachments have been stripped.
hr: Treba li Mailman konvertirati <tt>text/html</tt> dijelove u obièan tekst? Ova konverzija dogaða se nakon ¹to su MIME privici odrezani.
ro: Sã converteascã Mailman pãrþile <tt>text/html</tt> în text simplu? Aceastã conversie se realizeazã dupã ce toate ataºamentele MIME au fost eliminate.
tr: Mailman <tt>text/html</tt> bölümlerini düz yazýya çevirsin mi? Bu dönüþüm MIME eklentiler silindikten sonra gerçekleþir.

source: Action to take when a message matches the content filtering rules.
hr: Akcija koja æe se poduzeti kada se poruka podudara s pravilima filtriranja sadr¾aja.
ro: Acþiunea ce va fi executatã când un mesaj îndeplineºte condiþiile de filtrare a conþinutului.
tr: Bir mesaj, içerik filtreleme kurallarýyla eþleþtiðinde uygulanacak eylem.

source: One of these actions is taken when the message matches one of the content filtering rules, meaning, the top-level content type matches one of the <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_types</a>, or the top-level content type does <strong>not</strong> match one of the <a href="?VARHELP=contentfilter/pass_mime_types" >pass_mime_types</a>, or if after filtering the subparts of the message, the message ends up empty. <p>Note this action is not taken if after filtering the message still contains content. In that case the message is always forwarded on to the list membership. <p>When messages are discarded, a log entry is written containing the Message-ID of the discarded message. When messages are rejected or forwarded to the list owner, a reason for the rejection is included in the bounce message to the original author. When messages are preserved, they are saved in a special queue directory on disk for the site administrator to view (and possibly rescue) but otherwise discarded. This last option is only available if enabled by the site administrator.
hr: Jedna od ovih akcija se poduzima kada se poruka podudara sa jednim od pravila filtriranja sadr¾aja, ¹to znaèi da se najvi¹i tip sadr¾aja podudara sa jednim od <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_tipova</a>, ili sa najvi¹im tipom sadr¾aja koji se <strong>ne</strong>podudara sa jednim od <a href="?VARHELP=contentfilter/pass_mime_types" >prolaznih_mime_tipova</a>, ili ako nakon filtriranja djelova poruke, ista ostane prazna. <p>Primjetite da ova akcija neæe biti poduzeta ako poslije filtriranja poruka i dalje ima neki sadr¾aj. U tom sluèaju poruka se uvijek prosljeðuje èlanstvu liste. <p>Kada su poruke odbaèene, napravi se unos u log datoteku, koji sadr¾i ID-Poruke koja je odbaèena. Kada su poruke odbijene ili prosljeðene vlasniku liste, razlog odbijanja je napisan u odbijenoj poruci namjenjenoj izvornom autoru iste. Kada su poruke saèuvane, iste su pohranjene u posebni red direktorija na disku, tako da ih administrator mo¾e pogledati (i po moguænosti spasiti) a ako ne, bri¹u se. Ova zadnja opcija je moguæa samo ako je omoguæena od strane site administratora.
ro: Una din aceste acþiuni este aplicatã atunci când mesajul îndeplineºte cel puþin una din regulile de filtrare a conþinutului, însemnând cã tipul top-level este în lista <a href="?VARHELP=contentfilter/filter_mime_types">filter_mime_types</a>, sau tupil top-level <strong>nu</strong> este în lista <a href="?VARHELP=contentfilter/pass_mime_types">pass_mime_types</a>, sau în cazul în care dupã filtrarea conþinutului, mesajul devine nul. <p>Notaþi faptul cã acþiunea nu este aplicatã dacã dupã filtrare, mesajul mai are conþinut. În acest caz, mesajul este întotdeauna re-trimis listei. <p>Când mesajele sunt ignorate, este înregistrat un mesaj în jurnal (log), conþinând Message-ID-ulmesajului ignorat. Când mesajele sunt respinse sau retrimise proprietarului listei, este inclus motivul acestei acþiuni în notificarea de eºec (bounce) trimisã. Atunci când mesajele sunt reþinute, ele sunt salvate într-un director special pentru revizuirea (ºi eventuala salvare) de cãtre administrator, dar altfel sunt ignorate. Aceastã ultimã opþiune este disponibilã numai dacã este activatã de cãtre administratorul site-ului.

source: Bad MIME type ignored: %(spectype)s
hr: Krivi MIME tip koji je ignoriran: %(spectype)s
ro: Tip MIME invalid ignorat: %(spectype)s
tr: Kötü MIME türü gözardý edildi: %(spectype)s

source: Digest options
hr: Digest opcije
ro: Opþiuni rezumat
tr: Toplu Gönderim Seçenekleri

source: Batched-delivery digest characteristics.
hr: Karakteristike batched-dostava digesta
ro: Caracteristicile rezumatului trimis
tr: Toplu gönderim özellikleri.

source: Can list members choose to receive list traffic bunched in digests?
hr: Mogu li èlanovi liste odabrati primanje prometa s liste u obliku digesta?
ro: Pot membrii listei sã aleagã dacã vor primi mesajele listei în rezumate zilnice?
tr: Liste üyeleri liste trafiðini toplu þekilde almayý seçebilirler mi?

source: Digest
ro: Rezumat zilnic
tr: Toplu

source: Regular
hr: Stalan
ro: Normal
tr: Ayrý ayrý

source: Which delivery mode is the default for new users?
hr: Koji je poèetni mod dostave za nove korisnike?
ro: Care este metoda de livrare prestabilitã pentru noii membrii?
tr: Yeni kullanýcýlar için hangi gönderim tipi varsayýlan olsun?

source: Plain
hr: Obièan
ro: Text
tr: Düz

source: When receiving digests, which format is default?
hr: Koji je poèetni format prilikom primanja digesta?
ro: La primirea rezumatelor, care este formatul prestabilit?
tr: Toplu gönderimde hangi biçim varsayýlan olsun?

source: How big in Kb should a digest be before it gets sent out?
hr: Koliko bi u kb trebao biti velik digest prije slanja?
ro: Cât de mare (în Ko) sã fie un rezumat înainte de a fi trimis?
tr: Bir toplu mesaj gönderilebilmeden önce en fazla kaç KB boyutuna ulaþsýn?

source: Should a digest be dispatched daily when the size threshold isn't reached?
hr: Treba li digest biti dnevno dostavljan onda kada prag velièine nije dosegnut?
ro: Rezumatul trebuie trimis zilnic, sau când pragul limitã al mãrimii este atins?
tr: Boyut eþiðine ulaþýlmazsa günlük olarak toplu bir mesaj gönderilsin mi?

source: Header added to every digest
hr: Zaglavlje koje je dodano svakom digestu
ro: Introducerea adãugatã fiecãrui rezumat
tr: Her toplu mesaja eklenecek baþlýk

source: Text attached (as an initial message, before the table of contents) to the top of digests.
hr: Prikvaèeni tekst (kao poèetna poruka, prije sadr¾aja) na vrhu digesta.
ro: Textul ataºat (ca ºi mesaj iniþial, înainte de sumar) la începutul rezumatelor.
tr: Toplu mesajlarýn baþýna (içindekiler kýsmýndan önce baþlangýç yazýsý olarak) eklenecek yazý.

source: Footer added to every digest
hr: Podno¾je dodano na svaki digest
ro: ÃŽncheierea adãugatã fiecãrui rezumat
tr: Her toplu mesaja eklenecek altbilgi

source: Text attached (as a final message) to the bottom of digests.
hr: Prikvaèeni tekst (kao posljednja poruka) na dno digesta.
ro: Textul ataºat (ca ºi mesaj final) la sfãrºitul rezumatelor.
tr: Toplu mesajlarýn sonuna (son bir mesaj olarak) eklenecek yazý

source: How often should a new digest volume be started?
hr: Koliko èesto bi trebao biti kreiran novi digest?
ro: Cât de des trebuie început un nou volum de rezumat?
tr: Yeni bir toplu mesaj birimi ne kadar zamanda bir baþlatýlsýn?

source: When a new digest volume is started, the volume number is incremented and the issue number is reset to 1.
hr: Kada je kreiran novi digest, njegov broj je automatski uveæan, a broj skupa digesta je resetiran na 1.
ro: La generarea unui nou volum de rezumate, numãrul volumului este incrementat iar numãrul ediþiei este readus la valoarea 1.
tr: Yeni bir toplu mesaj sayýsý baþlatýldýðýnda, sayý artýrýlýr ve konu sayýsý 1'e döndürülür.

source: Should Mailman start a new digest volume?
hr: Treba li Mailman kreirati novi digest?
ro: Sã înceapã Mailman un nou volum de rezumat?
tr: Mailman yeni bir toplu mesaj sayýsý baþlatsýn mý?

source: Setting this option instructs Mailman to start a new volume with the next digest sent out.
hr: Postavljanje ove opcije ka¾e Mailmanu da kreira novi digest koji æe biti poslan.
ro: Aceastã opþiune va determina Mailman sã înceapã un nou volum la trimiterea urmãtoarei ediþii.
tr: Bu seçeneði ayarlamak Mailman'e gönderilmesi için yeni bir toplu mesaj sayýsý baþlatmasýný söyler.

source: Should Mailman send the next digest right now, if it is not empty?
hr: Treba li Mailman poslati sljedeæi digest upravo sada, iako digest nije prazan?
ro: Sã trimitã Mailman urmãtoarea ediþie chiar acum, dacã nu este goalã ?
tr: Mailman, eðer boþ deðilse, bir sonraki toplu mesajý hemen göndersin mi?

source: The next digest will be sent as volume %(volume)s, number %(number)s
hr: Sljedeæi digest æe biti poslan kao digest volume %(volume)s, broj %(number)s
ro: Urmãtoarea ediþie va fi trimisã în volumul %(volume)s, numãrul %(number)s
tr: Bir sonraki toplu mesaj, sayý %(volume)s, numara %(number)s olarak gönderilecek.

source: A digest has been sent.
hr: Digest je poslan.
ro: Ediþia a fost trimisã.
tr: Bir toplu mesaj gönderildi.

source: There was no digest to send.
hr: Nije poslan nikakav digest.
ro: Nu au fost ediþii de trimis.
tr: Gönderilecek toplu mesaj yoktu.

source: Invalid value for variable: %(property)s
hr: Pogre¹na vrijednost za varijablu: %(property)s
ro: Valoare invalidã pentru parametrul: %(property)s
tr: Deðiþken için geçersiz deðer: %(property)s

source: Bad email address for option %(property)s: %(val)s
hr: Pogre¹na e-mail adresa za opciju %(property)s: %(val)s
ro: Adresã de email eronatã pentru opþiunea %(property)s: %(val)s
tr: Seçenek %(property)s için kötü e-posta adresi: %(val)s

source: The following illegal substitution variables were found in the <code>%(property)s</code> string: <code>%(bad)s</code> <p>Your list may not operate properly until you correct this problem.
hr: Sljedeæe, pogre¹no zamjenjene varijable su pronaðene u <code>%(property)s</code> tekst: <code>%(bad)s</code> <p>Va¹a lista mo¾da neæe ispravno raditi dok ne ispravite ovaj problem.
ro: Urmãtoarele substituiri ilegale ale variabilelor au fost gãsite în ºirul de caractere <code>%(property)s</code>: <code>%(bad)s</code> <p>Este posibil ca lista dumneavoastrã sã funcþioneze defectuos pânã la remedierea problemei.
tr: <code>%(property)s</code> dizgisinde aþaðýdaki geçersiz yerine koyma deðiþkenleri bulundu: <code>%(bad)s</code> <p>Listeniz, bu sorunu gidermediðiniz sürece düzgün çalýþmayabilir.
