Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: One of these actions is take when the message matches one of the content filtering rules, meaning, the top-level content type matches one of the <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_types</a>, or the top-level content type does <strong>not</strong> match one of the <a href="?VARHELP=contentfilter/pass_mime_types" >pass_mime_types</a>, or if after filtering the subparts of the message, the message ends up empty. <p>Note this action is not taken if after filtering the message still contains content. In that case the message is always forwarded on to the list membership. <p>When messages are discarded, a log entry is written containing the Message-ID of the discarded message. When messages are rejected or forwarded to the list owner, a reason for the rejection is included in the bounce message to the original author. When messages are preserved, they are saved in a special queue directory on disk for the site administrator to view (and possibly rescue) but otherwise discarded. This last option is only available if enabled by the site administrator.
tr: Bir mesaj içerik filtreleme kurallarýyla eþleþtiðinde, yani üst seviye içerik türü <a href="?VARHELP=contentfilter/filter_mime_types" >filter_mime_types</a> ile eþleþiyorsa veya üst seviye içerik türü <a href="?VARHELP=contentfilter/pass_mime_types" >pass_mime_types</a> içinde belirtilen türlerden biri ile <strong>eþleþmezse</a>, veya filtreleme sonunda mesaj boþ kalýrsa, bu eylemlerden biri uygulanýr. <p>Mesaj, filtreleme sonunda boþ kalmazsa bu eylem uygulanmaz. Bu durumda mesaj her zaman lite üyelerine iletilir. <p>Mesajlar gözardý edildiðinde, gözardý edilen mesajýn Mesaj kimliðini (Message-ID) içeren bir kayýt oluþturulur. Mesajlar reddedildiðinde veya liste sahibine iletildiðinde, reddetmenin sebebi, asýl yazara bir geri dönüþ mesajýnda gönderilir. Mesajlar korunursa, özel bir kuyruk dizininde site yöneticisinin incelemesi (ve belki kurtarmasý) için saklanýr veya gözardý edilir. Bu son seçenek, site yöneticisi tarafýndan etkinleþtirilirse kullanýlabilir.

source: This text will be prepended to subject lines of messages posted to the list, to distinguish mailing list messages in in mailbox summaries. Brevity is premium here, it's ok to shorten long mailing list names to something more concise, as long as it still identifies the mailing list.
tr: Bu yazý listeye gönderilen mesajlarýn konu satýrlarýnýn baþýna eklenecektir. Bu sayede posta kutularýnda deðiþik listelerin mesajlarý daha kolay ayýrdedilebilir. Bu yazýnýn kýsa olmasý önemlidir, uzun liste isimleri, listeyi hala tanýmlayabilecek þekilde daha kýsa bir hale getirilebilir.

source: This option controls what Mailman does to the <tt>Reply-To:</tt> header in messages flowing through this mailing list. When set to <em>Poster</em>, no <tt>Reply-To:</tt> header is added by Mailman, although if one is present in the original message, it is not stripped. Setting this value to either <em>This list</em> or <em>Explicit address</em> causes Mailman to insert a specific <tt>Reply-To:</tt> header in all messages, overriding the header in the original message if necessary (<em>Explicit address</em> inserts the value of <a href="?VARHELP=general/reply_to_address">reply_to_address</a>). <p>There are many reasons not to introduce or override the <tt>Reply-To:</tt> header. One is that some posters depend on their own <tt>Reply-To:</tt> settings to convey their valid return address. Another is that modifying <tt>Reply-To:</tt> makes it much more difficult to send private replies. See <a href="http://www.unicom.com/pw/reply-to-harmful.html">`Reply-To' Munging Considered Harmful</a> for a general discussion of this issue. See <a href="http://www.metasystema.org/essays/reply-to-useful.mhtml">Reply-To Munging Considered Useful</a> for a dissenting opinion. <p>Some mailing lists have restricted posting privileges, with a parallel list devoted to discussions. Examples are `patches' or `checkin' lists, where software changes are posted by a revision control system, but discussion about the changes occurs on a developers mailing list. To support these types of mailing lists, select <tt>Explicit address</tt> and set the <tt>Reply-To:</tt> address below to point to the parallel list.
tr: Bu seçenek Mailman'in bu mesaj listesine gönderilen mesajlardaki <tt>Reply-To:</tt> baþlýðýna ne yapacaðýný kontrol eder. <em>Gönderici</em> olarak ayarlandýðýnda Mailman tarafýndan herhangi bir <tt>Reply-To:</tt> baþlýðý eklenmez ve özgün mesajda bir baþlýk varsa bu silinmez. Bu deðeri <em>Bu liste</em> veya <em>Farklý adres</em> olarak ayarlamak, Mailman'in tüm mesajlara ayrý bir <tt>Reply-To:</tt> baþlýðý atamasýný ve eðer gerekliyse özgün mesajdaki baþlýðý deðiþtirmesini saðlar. (<em>Farklý adres</em> <a href="?VARHELP=general/reply_to_address">reply_to_address</a> deðerini atar). Yeni bir <tt>Reply-To:</tt> baþlýðý eklememek veya var olaný deðiþtirmemek için bir çok neden vardýr. Bunlardan biri bazý göndericilerin geçerli yanýt adresleri olarak <tt>Reply-To:</tt> baþlýðýna güvenmeleridir. Diðer bir neden, <tt>Reply-To:</tt> baþlýðýnýn deðiþmesi durumunda özel yanýtlarýn gönderilmesinin çok daha zorlaþmasýdýr. Bu durumun genel bir tartýþmasý için <a href="http://www.unicom.com/pw/reply-to-harmful.html">`Reply-To' Munging Considered Harmful</a> sayfasýna bakabilirsiniz. Bunun tersi bir görüþ için de <a href="http://www.metasystema.org/essays/reply-to-useful.mhtml">`Reply-To' Munging Considered Useful</a> sayfasýna bakabilirsiniz. <p>Bazý mesaj listeleri kýsýtlý gönderim ayrýcalýklarýna ve buna paralel olan ve tartýþmalar için kullanýlan ayrý bir listeye sahiptir. Bu tür listelere örnek olarak `yama' veya `kaydolma' listeleri gösterilebilir. Böyle listelerde yazýlým deðiþiklikleri bir uyarlama kontrol sistemi ile gönderilir. Bu tür listeleri desteklemek için <tt>Farklý adres</tt> seçerek <tt>Reply-To:</tt> baþlýðýný paralel liste olarak gösterin.

source: This is the address set in the <tt>Reply-To:</tt> header when the <a href="?VARHELP=general/reply_goes_to_list">reply_goes_to_list</a> option is set to <em>Explicit address</em>. <p>There are many reasons not to introduce or override the <tt>Reply-To:</tt> header. One is that some posters depend on their own <tt>Reply-To:</tt> settings to convey their valid return address. Another is that modifying <tt>Reply-To:</tt> makes it much more difficult to send private replies. See <a href="http://www.unicom.com/pw/reply-to-harmful.html">`Reply-To' Munging Considered Harmful</a> for a general discussion of this issue. See <a href="http://www.metasystema.org/essays/reply-to-useful.mhtml">Reply-To Munging Considered Useful</a> for a dissenting opinion. <p>Some mailing lists have restricted posting privileges, with a parallel list devoted to discussions. Examples are `patches' or `checkin' lists, where software changes are posted by a revision control system, but discussion about the changes occurs on a developers mailing list. To support these types of mailing lists, specify the explicit <tt>Reply-To:</tt> address here. You must also specify <tt>Explicit address</tt> in the <tt>reply_goes_to_list</tt> variable. <p>Note that if the original message contains a <tt>Reply-To:</tt> header, it will not be changed.
tr: Bu, <a href="?VARHELP=general/reply_goes_to_list">reply_goes_to_list</a> seçeneði <em>Farklý adres</em> olarak ayarlandýðýnda <tt>Reply-To:</tt> baþlýðýna atanacak adrestir. Yeni bir <tt>Reply-To:</tt> baþlýðý eklememek veya var olaný deðiþtirmemek için bir çok neden vardýr. Bunlardan biri bazý göndericilerin geçerli yanýt adresleri olarak <tt>Reply-To:</tt> baþlýðýna güvenmeleridir. Diðer bir neden, <tt>Reply-To:</tt> baþlýðýnýn deðiþmesi durumunda özel yanýtlarýn gönderilmesinin çok daha zorlaþmasýdýr. Bu durumun genel bir tartýþmasý için <a href="http://www.unicom.com/pw/reply-to-harmful.html">`Reply-To' Munging Considered Harmful</a> sayfasýna bakabilirsiniz. Bunun tersi bir görüþ için de <a href="http://www.metasystema.org/essays/reply-to-useful.mhtml">`Reply-To' Munging Considered Useful</a> sayfasýna bakabilirsiniz. <p>Bazý mesaj listeleri kýsýtlý gönderim ayrýcalýklarýna ve buna paralel olan ve tartýþmalar için kullanýlan ayrý bir listeye sahiptir. Bu tür listelere örnek olarak `yama' veya `kaydolma' listeleri gösterilebilir. Böyle listelerde yazýlým deðiþiklikleri bir uyarlama kontrol sistemi ile gönderilir. Bu tür listeleri desteklemek için farklý <tt>Reply-To:</tt> adresinizi burada belirleyin. Ayrýca <tt>reply_goes_to_list</tt> deðiþkenini <tt>Farklý adres</tt> olarak ayarlayýn. <p>Eðer özgün mesajda bir <tt>Reply-To:</tt> baþlýðý varsa, bu baþlýk deðiþmeyecektir.

source: Approval notices are sent when mail triggers certain of the limits <em>except</em> routine list moderation and spam filters, for which notices are <em>not</em> sent. This option overrides ever sending the notice.
tr: Onay bildirimleri, bildirimlerin <em>gönderilmediði</em> rutin liste yönetimi ve spam filtreleri <em>dýþýnda</em>, mesaj bazý sýnýrlarý tetiklediðinde gönderilir. Bu seçenek bildirimin gönderilmesini geçersiz kýlar.

source: Should messages from this mailing list include the <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> (yani <tt>List-*</tt>) headers? <em>Yes</em> is highly recommended.
tr: Bu listeden gelen mesajlar <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> (i.e. <tt>List-*</tt>) baþlýklarýný içersin mi? <em>Evet</em> önemle tavsiye edilir.

source: This is the default natural language for this mailing list. If <a href="?VARHELP=language/available_languages">more than one language</a> is supported then users will be able to select their own preferences for when they interact with the list. All other interactions will be conducted in the default language. This applies to both web-based and email-based messages, but not to email posted by list members.
hr: Ovo je poèetni, materinski jezik za ovu mailing listu. Ako je podr¾an <a href="?VARHELP=language/available_languages">vi¹e nego jedan jezik</a> tada æe korisnici moæi izabrati svoje postavke na nekom od navedenih jezika za rad s listom. Ovo ukljuèuje i web i e-mail bazirane poruke, ali ne i e-mail poruke koje su poslali èlanovi lista.
tr: Bu, bu listenin varsayýlan doðal dilidir. Eðer <a href="?VARHELP=language/available_languages">birden fazla dil</a> destekleniyorsa, kullanýcýlar listede kullanmak istedikleri dili seçebilirler. Diðer tüm etkileþimler varsayýlan dilde yapýlýr. Bu, hem web tabanlý hem e-posta tabanlý mesajlarda geçerlidir, fakat liste üyelerinin gönderdiði mesajlarla ilgili deðildir.

source: Confirm
hr: Potvrdi
tr: Onay

source: When a message is posted to the list, a series of moderation steps are take to decide whether the a moderator must first approve the message or not. This section contains the controls for moderation of both member and non-member postings. <p>Member postings are held for moderation if their <b>moderation flag</b> is turned on. You can control whether member postings are moderated by default or not. <p>Non-member postings can be automatically <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >accepted</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">held for moderation</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >rejected</a> (bounced), or <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >discarded</a>, either individually or as a group. Any posting from a non-member who is not explicitly accepted, rejected, or discarded, will have their posting filtered by the <a href="?VARHELP=privacy/sender/generic_nonmember_action">general non-member rules</a>. <p>In the text boxes below, add one address per line; start the line with a ^ character to designate a <a href= "http://www.python.org/doc/current/lib/module-re.html" >Python regular expression</a>. When entering backslashes, do so as if you were using Python raw strings (i.e. you generally just use a single backslash). <p>Note that non-regexp matches are always done first.
tr: Bir listeye bir mesaj gönderildiðinde, bir moderatörün onayýndan geçmesi gerekip gerekmediðine karar vermek için bir dizi kontrol gerçekleþtirilir. Bu bölüm hem üye olan hem üye olmayan kiþilerden gelen mesajlarýn kontrollerini içerir. <p>Eðer bir üye için <strong>moderatör onay ayarý</strong> açýksa, o üyenin gönderdiði mesajlar moderatör onayý için bekletilir. Üye mesajlarýnýn varsayýlan olarak moderatör onayý gerektirip gerektirmeyeceðini kontrol edebilirsiniz. <p>Üye olmayan kiþilerin mesajlarý otomatik olarak <a href="?VARHELP=privacy/sender/accept_these_nonmembers" >onaylanabilir</a>, <a href="?VARHELP=privacy/sender/hold_these_nonmembers">moderatör onayý için bekletilebilir</a>, <a href="?VARHELP=privacy/sender/reject_these_nonmembers" >reddedilebilir</a> (geri döndürülür), veya <a href="?VARHELP=privacy/sender/discard_these_nonmembers" >gözardý edilebilir</a>, bunlarýn hepsi teker teker veya grup halinde yapýlabilir. Açýkça onaylanmayan, reddedilmeyen veya gözardý edilmeyen kiþilerin mesajlarý, <a href="?VARHELP=privacy/sender/generic_nonmember_action">genel üye olmayan kiþi kurallarý</a>'na göre belirlenir. <p>Aþaðýdaki yazý kutularýna, her satýra bir adres olacak þekilde adres ekleyebilirsiniz; satýra bir ^ karakteri ile baþlayarak bir <a href="http://www.python.org/doc/current/lib/module-re.html">Python regular expression</a> belirtebilirsiniz. Ters geri çizgi girerken Python ham dizgisi gibi girin (yani genel olarak tek bir ters geri çizgi girin). <p>Reg-exp olmayan eþleþmelerin ilk önce yapýlacaðýnýa dikkat edin.

source: Postings from any of these non-members will be automatically accepted with no further moderation applied. Add member addresses one per line; start the line with a ^ character to designate a regular expression match.
tr: Bu üye olmayan kiþilerden gelecek tüm mesajlar herhangi bir moderatör onayý gerektirmeden otomatik olarak kabul edilecektir. Her satýra bir adres olacak þekilde ekleyin, bir ^ karakteri ile baþlayarak bir regular expression eþleþmesi belirleyebilirsiniz.

source: Many (in fact, most) spams do not explicitly name their myriad destinations in the explicit destination addresses - in fact often the To: field has a totally bogus address for obfuscation. The constraint applies only to the stuff in the address before the '@' sign, but still catches all such spams. <p>The cost is that the list will not accept unhindered any postings relayed from other addresses, unless <ol> <li>The relaying address has the same name, or <li>The relaying address name is included on the options that specifies acceptable aliases for the list. </ol>
hr: Mnogo (u biti veæina) spamova ne postavlja eksplicitno mnogo odredi¹ta kao ciljane adrese - u stvari, polje To: èesto ima potpuno krivu adresu radi neèitljivosti. Ogranièenje se odnosi samo na grupu osoba u adresi prije znaka '@', ali i dalje hvata svaki takav spam. <p>Cijena toga je da lista neæe prihvatiti svaku poruku prene¹enu s drugih adresa, jedino ako <ol> <li>Prenesena adresa ima isto ime ili <li>Naziv prenesene adrese uvr¹ten je u opcije koje specificiraju prihvatljive aliase za listu. </ol>
tr: Birçok (aslýnda çoðu) spam genellikle gidecekleri adresleri açýkça belirtmez. - aslýnda, genellikle Alýcý: alaný þaþýrtma için tamamen sahte bir adres içerir. Bu kýsýtlama adreste sadece '@' iþaretinden önceki bölüme uygulanýr, fakat bu tür tüm spam mesajlarý yakalar. <p>Bu kýsýtlamanýn bedeli, þu durumlar dýþýnda baþka adresler üzerinden gönderilen hiçbir mesajý listenin almamasýdýr: <ol> <li>Üzerinden giden adres ayný ismi taþýmalýdýr, veya <li>Üzerinden giden adres ismi, listenin kabul edilebilir takma adlarý içinde olmalýdýr. </ol>

source: Each header filter rule has two parts, a list of regular expressions, one per line, and an action to take. Mailman matches the message's headers against every regular expression in the rule and if any match, the message is rejected, held, or discarded based on the action you specify. Use <em>Defer</em> to temporarily disable a rule. You can have more than one filter rule for your list. In that case, each rule is matched in turn, with processing stopped after the first match.
tr: Her baþlýk filtresi kuralý iki bölümden oluþur, bir her satýra bir tane olacak þekilde bir regular expression listesi ve uygulanacak eylem. Mailman, mesaj baþlýklarýný kuraldaki her regular expression ile karþýlaþtýrýr ve eðer bir eþleþme varsa, mesaj belirleyeceðiniz eyleme göre reddedilir, bekletilir veya gözardý edilir. Bir kuralý geçici olarak devre dýþý býrakmak için <em>Ertele</em> kullanýn. Listeniz için birden çok filtre kuralýnýz olabilir. Bu durumda her kural sýra ile karþýlaþtýrýlýr ve ilk eþleþmeden sonra iþlem durdurulur.

source: The topic filter categorizes each incoming email message according to <a href="http://www.python.org/doc/current/lib/module-re.html">regular expression filters</a> you specify below. If the message's <code>Subject:</code> or <code>Keywords:</code> header contains a match against a topic filter, the message is logically placed into a topic <em>bucket</em>. Each user can then choose to only receive messages from the mailing list for a particular topic bucket (or buckets). Any message not categorized in a topic bucket registered with the user is not delivered to the list. <p>Note that this feature only works with regular delivery, not digest delivery. <p>The body of the message can also be optionally scanned for <code>Subject:</code> and <code>Keywords:</code> headers, as specified by the <a href="?VARHELP=topics/topics_bodylines_limit">topics_bodylines_limit</a> configuration variable.
tr: Konu filtresi gelen her mesajý aþaðýda belirleyeceðiniz <a href="http://www.python.org/doc/current/lib/module-re.html">regular expression filtrelerine</a> göre kategorilere ayýrýr. Eðer mesajýn <code>Konu:</code> veya <code>Keywords:</code> baþlýðý bir konu filtresi ile eþleþirse, bu mesaj mantýksal bir konu <em>kabýna</em> yerleþtirilir. Bundan sonra her kullanýcý mesaj listesinden sadece belli konu kaplarýna giren mesajlarý almayý seçebilir. Bir kullanýcýnýn seçtiði kaba girmeyen hiçbir mesaj ona gitmez. <p>Bu özellik sadece ayrý ayrý mesaj gönderiminde geçerlidir, toplu gönderimde geçerli deðildir. <p>Ýsteðe baðlý olarak mesajýn gövdesi de <a href="?VARHELP=topics/topics_bodylines_limit">topics_bodylines_limit</a> deðiþkeninde belirlenen þekilde <code>Konu:</code> ve <code>Keywords:</code> baþlýklarý için taranabilir.

source: This setting determines the moderation policy of the newsgroup and its interaction with the moderation policy of the mailing list. This only applies to the newsgroup that you are gatewaying <em>to</em>, so if you are only gatewaying from Usenet, or the newsgroup you are gatewaying to is not moderated, set this option to <em>None</em>. <p>If the newsgroup is moderated, you can set this mailing list up to be the moderation address for the newsgroup. By selecting <em>Moderated</em>, an additional posting hold will be placed in the approval process. All messages posted to the mailing list will have to be approved before being sent on to the newsgroup, or to the mailing list membership. <p><em>Note that if the message has an <tt>Approved</tt> header with the list's administrative password in it, this hold test will be bypassed, allowing privileged posters to send messages directly to the list and the newsgroup.</em> <p>Finally, if the newsgroup is moderated, but you want to have an open posting policy anyway, you should select <em>Open list, moderated group</em>. The effect of this is to use the normal Mailman moderation facilities, but to add an <tt>Approved</tt> header to all messages that are gatewayed to Usenet.
hr: Ova postavka odreðuje moderacijska pravila news grupe i njenu interakciju s moderacijskim pravilima mailing liste Ovo se odnosi samo na news grupe koje vi prosljeðujete tako da ako samo prosljeðujete poruke sa Useneta, ili news grupa koju prosljeðujete nije moderirana, postavite ovu opciju na <em>Nijedan</em>. <p>Ako je news grupa moderirana, mo¾ete postaviti ovu mailing listu tako da bude moderacijska adresa za news grupu. Odabiranjem <em>Moderirano</em>, dodatno èekanje æe biti uvr¹teno u proces odobrenja. Sve poruke poslane na mailing listu moraju biti odobrene prije nego ¹to æe biti poslane na news grupu ili èlanstvu mailing liste. <p><em>Primijetite da ukoliko poruka ima <tt>Odobreno</tt> zaglavlje s administrativnom lozinkom liste unutra, ovaj test zadr¾avanja æe biti preskoèen, ¹to æe privilegiranim osobama dozvoliti slanje poruka izravno na listu i na news grupu.</em> <p>Konaèno, ako je news grupa moderirana, ali svejedno ¾elite imati otvorena pravila za slanje poruka, trebali biste odabrati <em>Otvorena lista, moderirana grupa</em>. Posljedica ovoga je kori¹tenje normalnih Mailmanovih sadr¾aja, ali i dodavanje <tt>Odobreno</tt> zaglavlja u sve poruke koje se prosljeðuju na Usenet.
tr: Bu ayar, haber grubunun moderatör onay ilkesi ve bunun mesaj listesinin moderatör onay ilkesi ile etkileþimini belirler. Bu, sadece listenizden mesaj <em>geçirdiðiniz</em> haber grubuna uygulanýr, yani sadece Usenet'ten haber grubu mesajlarý alýyorsanýz, veya listenizden mesaj geçirdiðiniz haber grubu moderatör onaylý deðilse bu seçeneði <em>Yok</em> olarak ayarlayýn. <p>Eðer haber grubu moderatör onaylý ise, bu mesaj listesini haber grubunun moderatör onay adresi olarak ayarlayabilirsiniz. <em>Moderatör onaylý</em> seçeneðini seçerek, onay iþlemine fazladan bir adým ekleyebilirsiniz. Mesaj listesine gönderilen tüm mesajlar, haber grubuna veya listeye daðýtýlmadan moderatör onayý gerektirecektir. <p>Son olarak, eðer haber grubu moderatör onaylý ise fakat sizin bir açýk gönderim ilkeniz varsa, <em>Açýk liste, moderatör onaylý grup</em> seçeneðini seçebilirsiniz. Bunun etkisi, normal Mailman moderatör onay araçlarýný kullanmak, fakat Usenet'e geçirilen tüm mesajlara bir <tt>Approved</tt> baþlýðý eklememektir.

source: An embedded message was scrubbed... From: %(who)s Subject: %(subject)s Date: %(date)s Size: %(size)s Url: %(url)s
tr: Gömülü bir mesaj temizlendi... Gönderen: %(who)s Konu: %(subject)s Tarih: %(date)s Boyut: %(size)s Url: %(url)s

source: A non-text attachment was scrubbed... Name: %(filename)s Type: %(ctype)s Size: %(size)d bytes Desc: %(desc)s Url : %(url)s
tr: Yazý olmayan bir eklenti temizlendi... Ýsim: %(filename)s Tür: %(ctype)s Boyut: %(size)d bayt Taným: %(desc)s Url: %(url)s

source: Skipped content of type %(partctype)s
tr: Ýçerik türü %(partctype)s atlandý

source: You have been invited to join the %(listname)s mailing list
tr: %(listname)s mesaj listesine üye olmak için davet edildiniz

source: Apr
hr: Tra
tr: Nis

source: Feb
hr: Vel
tr: Þub

source: Aug
hr: Kol
tr: Aðu

source: Dec
hr: Pro
tr: Ara

source: Oct
hr: Lis
tr: Eki

source: Sep
hr: Ruj
tr: Eyl

source: %(wday)s %(mon)s %(day)2i %(hh)02i:%(mm)02i:%(ss)02i %(tzname)s %(year)04i
tr: %(day)2i %(mon)s %(year)04i %(wday)s %(hh)02i:%(mm)02i:%(ss)02i %(tzname)s

source: thread
hr: diskusija

source: Thread
hr: Diskusija

source: myposts %(onoff)s
hr: moje poruke %(onoff)s

source: duplicates %(onoff)s
hr: duplikati %(onoff)s

source: reminders %(onoff)s
hr: podsjetnici %(onoff)s

source: Euskara
hr: Euskarski

source: %(listname)s mailing list probe message
hr: Testna poruka %(listname)s mailing liste
