Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: The list administrator has disabled digest delivery for this list, so your delivery option has not been set. However your other options have been set successfully.
hr: Administrator liste je onemoguæio digest dostavu za ovu listu, tako da va¹a opcija dostave nije postavljena. Ipak, ostale opcije su uspje¹no postavljene.
ro: Administratorul listei a dezactivat livrarea rezumatelor pentru aceastã listã, astfel încât opþiunea dumneavoastrã de livrare nu a fost setatã. Oricum, celelalte preferinþe au fost setate cu succes.
tr: Liste yöneticisi bu liste için toplu gönderimi devre dýþý býrakmýþ, bu yüzden gönderim seçeneðiniz ayarlanmadý. Ancak diðer seçenekleriniz baþarýyla ayarlandý.

source: The list administrator has disabled non-digest delivery for this list, so your delivery option has not been set. However your other options have been set successfully.
hr: Administrator liste je onemoguæio non-digest dostavu za ovu listu, tako da va¹a opcija dostave nije postavljena. Ipak, druge opcije su uspje¹no postavljene.
ro: Administratorul listei a dezactivat livrarea individualã (non-digest) pentru aceastã listã, astfel încât opþiunea dumneavoastrã de livrare nu a fost salvatã. Totuºi, celelalte opþiuni v-au fost setate cu succes.
tr: Liste yöneticisi bu liste için toplu olmayan gönderimi devre dýþý býrakmýþ, bu yüzden gönderim seçeneðiniz ayarlanmadý. Ancak diðer seçenekleriniz baþarýyla ayarlandý.

source: You have successfully set your options.
hr: Uspje¹no ste postavili svoje opcije.
ro: Aþi setat cu succes opþiunile personale.
tr: Seçeneklerinizi baþarýyla ayarladýnýz.

source: You may get one last digest.
hr: Mo¾ete eventualno dobiti jo¹ jedan digest mail.
ro: S-ar putea sã primiþi un ultim rezumat.
tr: Son bir toplu mesaj alabilirsiniz.

source: <em>Yes, I really want to unsubscribe</em>
hr: <em>Da, ja se stvarno ¾elim odjaviti</em>
ro: <em>Da, sunt sigur cã doresc sã mã dezabonez</em>
tr: <em>Evet, üyelikten çýkmak istiyorum</em>

source: Change My Password
hr: Promjeni Moju Lozinku
ro: Modificã-mi parola
tr: Þifremi Deðiþtir

source: List my other subscriptions
hr: Prika¾i listu mojih drugih pretplata
ro: Afiºeazã-mi celelalte abonamente
tr: Diðer üyeliklerimi listele

source: Email My Password To Me
hr: Po¹alji mi Moju Lozinku Mailom
ro: Trimite-mi parola
tr: Þifremi Bana E-Postayla Yolla

source: password
hr: lozinka
ro: parola
tr: þifre

source: Log out
hr: Odjava
ro: Ieºire
tr: Çýkýþ

source: Submit My Changes
hr: Po¹alji Moje Promjene
ro: Salveazã modificãrile
tr: Deðiþikliklerimi Gönder

source: days
hr: dani
ro: zile
tr: gün

source: day
hr: dan
ro: zi
tr: gün

source: Change My Address and Name
hr: Promjeni Moju Adresu i Ime
ro: Modificã-mi adresa ºi numele
tr: Adresimi ve Ýsmimi Deðiþtir

source: <em>No topics defined</em>
hr: <em>Nijedna tema nije napisana</em>
ro: <em>Nu sunt topici definite</em>
tr: <em>Herhangi bir konu tanýmlanmadý</em>

source: You are subscribed to this list with the case-preserved address <em>%(cpuser)s</em>.
hr: Pretplaæeni ste na ovu listu sa adresom koja ima saèuvan oblik (velika i mala slova) <em>%(cpuser)s</em>.
ro: Sunteþi abonat(ã) la aceastã listã cu adresa <em>%(cpuser)s</em>.
tr: Bu listeye büyük-küçük harf ayarý korunmuþ þekilde <em>%(cpuser)s</em>adresiyle üyesiniz.

source: %(realname)s list: member options login page
hr: %(realname)s lista: èlanska ulazna stranica sa opcijama
ro: Lista de discuþii %(realname)s: pagina de acces la opþiunile personale
tr: %(realname)s listesi: üyelik seçenekleri giriþ sayfasý

source: email address and
hr: e-mail adresa i
ro: adresa de email ºi
tr: e-posta adresi ve

source: %(realname)s list: member options for user %(safeuser)s
hr: %(realname)s lista: èlanske opcije za korisnika %(safeuser)s
ro: Lista de discuþii %(realname)s: opþiunile personale pentru %(safeuser)s
tr: %(realname)s listesi: %(safeuser)s kullanýcýsý için üyelik seçenekleri

source: In order to change your membership option, you must first log in by giving your %(extra)smembership password in the section below. If you don't remember your membership password, you can have it emailed to you by clicking on the button below. If you just want to unsubscribe from this list, click on the <em>Unsubscribe</em> button and a confirmation message will be sent to you. <p><strong><em>Important:</em></strong> From this point on, you must have cookies enabled in your browser, otherwise none of your changes will take effect.
hr: Da biste mogli promjeniti svoje èlanske postavke, morate se prvo prijaviti s va¹om %(extra)smembership lozinkom u donjem dijelu Ako se ne sjeæate svoje èlanske lozinke, istu mo¾ete dobiti mailom i to klikanjem na donji gumb. Ako se samo ¾elite odjaviti sa ove liste, kliknite na <em>Odjava</em> gumb i poruka sa potvrdom bit æe vam poslana. <p><strong><em>Va¾no:</em></strong> Odavde pa nadalje, u svome browseru morate imati omoguæene kolaèiæe (cookies), jer u suprotnom, promjene koje ste napravili neæe imati uèinka.
ro: Pentru a vã modifica opþiunile de abonament, trebuie mai întâi sã vã autentificaþi cu parola %(extra)smembership în secþiunea de mai jos. Dacã nu vã reamintiþi parola de acces, o puteþi recupera prin e-mail apãsând pe butonul de mai jos. Dacã doriþi sã pãrãsiþi aceastã listã, apãsaþi butonul <em>Dezabonare</em> ºi vã va fi trimis un mesaj de confirmare. <p><strong><em>Important:</em></strong> Din acest punct începând, trebuie sã aveþi activate cookie-urile în browser, altfel nici o modificare nu va fi aplicatã.
tr: Üyelik seçeneklerinizi deðiþtirmek için önce aþaðýda üyelik þifrenizi yazarak giriþ yapmanýz gereklidir. Eðer üyelik þifrenizi bilmiyorsanýz aþaðýdaki düðmeye týklayarak size e-postayla gönderilmesini saðlayabilirsiniz. Eðer sadece bu listeden çýkmak istiyorsanýz <em>Üyelikten Çýk</em> düðmesine týklayýn, size bir onay mesajý gönderilecektir. <p><strong><em>Önemli:</em></strong> Bu noktadan itibaren tarayýcýnýzda tanýmlama bilgilerini (cookie) etkinleþtirmiþ olmanýz gerekir, yoksa deðiþikliklerinizin hiçbiri yapýlmayacaktýr.

source: Email address:
hr: Email adresa:
ro: Adresa de email:
tr: E-posta adresi:

source: Password:
hr: Lozinka:
ro: Parola:
tr: Þifre:

source: Log in
hr: Prijavi se
ro: Autentificare
tr: Giriþ

source: By clicking on the <em>Unsubscribe</em> button, a confirmation message will be emailed to you. This message will have a link that you should click on to complete the removal process (you can also confirm by email; see the instructions in the confirmation message).
hr: Klikanjem na <em>Odjava</em> gumb, bit æe vam poslana poruka sa potvrdom. Ova poruka æe imati link na koji trebate kliknuti da bi proces odjave bio zavr¹en (isto, takoðer mo¾ete potvrditi i mailom; pogledajte upute u poruci sa potvrdom
ro: Dupã apãsarea butonului <em>Dezabonare</em>, veþi primi un mesaj de confirmare prin e-mail. Acest mesaj va conþine un link de confirmare care trebuie vizitat pentru a completa procesul de pãrãsire a listei. (puteþi trimite confirmarea ºi prin e-mail; urmãriþi instrucþiunile din mesajul de confirmare primit).
tr: <em>Üyelikten Çýk</em> düðmesine týkladýðýnýzda size bir onay mesajý gönderilecektir. Bu mesajda bulunan linke týklayarak çýkýþ iþleminizi tamamlayabilirsiniz. (ayrýca e-posta ile de onaylayabilirsiniz, onay mesajýndaki açýklamalarý inceleyin).

source: Password reminder
hr: Podsjetnik lozinke
ro: Mesaj de reamintire a parolei
tr: Þifre hatýrlat

source: By clicking on the <em>Remind</em> button, your password will be emailed to you.
hr: Klikom na <em>Podsjeti</em> gumb bit æe vam mailana va¹a lozinka.
ro: Apãsând pe butonul <em>Reamintire</em>, parola vã va fi trimisã prin email.
tr: Aþaðýda <em>Hatýrlat</em> düðmesine týkladýðýnýzda þifreniz size e-postayla gönderilecektir.

source: Remind
hr: Podsjeti
ro: Reamintire
tr: Hatýrlat

source: Requested topic is not valid: %(topicname)s
hr: Tra¾eni naslov (tema) nije ispravan: %(topicname)s
ro: Topica cerutã nu este validã: %(topicname)s
tr: Ýstenen konu geçerli deðil: %(topicname)s

source: Topic filter details
hr: Detalji o filteru teme
ro: Detalii ale filtrului de topicã
tr: Konu filtre ayrýntýlarý

source: Name:
hr: Naziv:
ro: Nume:
tr: Ýsim:

source: Pattern (as regexp):
hr: Uzorak (kao regexp):
ro: Model (ca ºi regexp):
tr: Desen (regexp olarak):

source: Private Archive Error
hr: Gre¹ka u Privatnoj Arhivi
ro: Eroare la arhiva privatã
tr: Özel Arþiv Hatasý

source: You must specify a list.
hr: Morate specificirati listu.
ro: Trebuie sã specificaþi o listã.
tr: Bir liste belirtmelisiniz.

source: Private Archive Error - %(msg)s
hr: Gre¹ka u Privatnoj Arhivi - %(msg)s
ro: Eroare la arhiva privatã - (msg)s
tr: Özel Arþiv Hatasý - %(msg)s

source: Private archive file not found
hr: Datoteka sa privatnom arhivom nije pronaðena
ro: Fiºierul de arhivã privatã nu a fost gãsit
tr: Özel arþiv dosyasý bulunamadý

source: You're being a sneaky list owner!
hr: Trudite se biti podao vlasnik liste!
ro: Eºti un proprietar de listã dat dracului!
tr: Sinsi bir liste sahibisiniz!

source: You are not authorized to delete this mailing list
hr: Niste ovla¹teni za brisanje ove mailing liste
ro: Nu aveþi autorizarea necesarã pentru a ºterge aceastã listã
tr: Bu mesaj listesini silmek için yetkiniz yok

source: Mailing list deletion results
hr: Rezultati brisanja mailing liste
ro: Rezultatele ºtergerii listei de discuþii
tr: Mesaj listesi silme sonuçlarý

source: You have successfully deleted the mailing list <b>%(listname)s</b>.
hr: Uspje¹no ste obrisali mailing listu <b>%(listname)s</b>.
ro: Aþi ºters cu succes lista de discuþii <b>%(listname)s</b>.
tr: <strong>>%(listname)s</strong> mesaj listesini baþarýyla sildiniz.

source: There were some problems deleting the mailing list <b>%(listname)s</b>. Contact your site administrator at %(sitelist)s for details.
hr: Do¹lo je do nekih problema prilikom brisanja mailing liste <b>%(listname)s</b>. Kontaktirajte site administratora na %(sitelist)s za detalje.
ro: Au apãrut niºte probleme la ºtergerea listei de discuþii <b>%(listname)s</b>. Contactaþi administratorul site-ului la (sitelist)s pentru detalii.
tr: <strong>>%(listname)s</strong> mesaj listesi silinirken bazý sorunlar oluþtu. Ayrýntýlar için %(sitelist)s adresinden site yöneticinizle baðlantý kurun.

source: Permanently remove mailing list <em>%(realname)s</em>
hr: Trajno ukloni mailing listu <em>%(realname)s</em>
ro: Åžterg definitiv lista de discuþii <em>%(realname)s</em>
tr: <em>%(realname)s</em> mesaj listesini kalýcý olarak sil

source: This page allows you as the list owner, to permanent remove this mailing list from the system. <strong>This action is not undoable</strong> so you should undertake it only if you are absolutely sure this mailing list has served its purpose and is no longer necessary. <p>Note that no warning will be sent to your list members and after this action, any subsequent messages sent to the mailing list, or any of its administrative addreses will bounce. <p>You also have the option of removing the archives for this mailing list at this time. It is almost always recommended that you do <strong>not</strong> remove the archives, since they serve as the historical record of your mailing list. <p>For your safety, you will be asked to reconfirm the list password.
hr: Ova stranica vam, kao vlasniku liste, omoguæuje da trajno uklonite ovu mailing listu sa sistema. <strong>Ova akcija ne mo¾e biti poni¹tena</strong> tako da bi je trebali poduzeti samo ako ste apsolutno sigurni da je ova mailing lista odslu¾ila svoje i vi¹e nije potreba. <p>Primjetite da nikakvo upozorenje neæe biti poslano Va¹im èlanovima liste i nakon ove akcije, sve sljedeæe poruke poslane na ovu mailing listu, ili bilo koju njenu administrativnu adresu æe se odbijati. <p>Osim toga sada imate i moguænost uklanjanja arhiva sa ove mailing liste Skoro je uvijek preporuèeno da <strong>ne</strong>uklanjate arhivu, buduæi da ona slu¾i kao povijesni trag va¹e mailing liste. <p>Za va¹u sigurnost, ponovno æete biti upitani da potvrdite lozinku liste.
ro: Aceastã paginã vã faciliteazã, ca ºi proprietar al listei, de a ºterge definitiv aceastã listã de discuþii din sistem. <strong>Aceastã acþiune nu este reversibilã</strong>, aºa cã vã sfãtuim sã apelaþi la ea numai dacã aveþi cetitudinea absolutã cã lista ºi-a servit scopul ºi nu mai este necesarã. <p>Notaþi cã nu vor fi trimise notificãri de atenþionare cãtre membrii listei, iar dupã aceastã acþiune orice mesaje trimise cãtre listã sau adresele adiacente vor fi returnate ca ºi eºecuri. <p>Aveþi, de asemenea, opþiunea ºtergerii arhivelor acestei liste de discuþii în acest moment. Apropate întotdeauna este recomandat sã <strong>nu</strong> ºtergeþi arhivele, devreme ce acestea servesc ca ºi dovezi ale listei. <p>Pentru siguranþã, vi se va cere reconfirmarea parolei de administrare a listei.
tr: Bu sayfa, liste sahibi olarak bu mesaj listesini sistemden kalýcý olarak silmenizi saðlar. <strong>Bu eylem geri dönülmezdir,</strong> bu yüzden, sadece mesaj listesinin görevini tamamladýðýndan ve artýk gerekli olmadýðýndan eminseniz bunu yapmalýsýnýz. <p>Bu eylemin ardýndan liste üyelerinize herhangi bir uyarý gönderilmeyecektir, bundan sonra mesaj listesine veya yönetimsel adresine gönderilen tüm mesajlar geri dönecektir. <p>Ayrýca þu anda bu mesaj listesinin arþivlerini de silme seçeneðine sahipsiniz. Neredeyse her zaman arþivleri <strong>silmemeniz</strong> önerilir, çünkü mesaj listenizin tarihsel kaydý olarak durmaktadýrlar. <p>Güvenliðiniz için liste þifresini tekrar onaylamanýz istenecektir.

source: List password:
hr: Lozinka liste:
ro: Parola de acces la listã:
tr: Liste þifresi:

source: Also delete archives?
hr: Takoðer, obri¹i arhivu?
ro: Åžterg ºi arhivele?
tr: Ayrýca arþivler de silinsin mi?

source: <b>Cancel</b> and return to list administration
hr: <b>Zanemari</b> i vrati se administriranju liste
ro: <b>Renunþã</b> ºi întoarce-te la administrarea listei
tr: <strong>Vazgeç</strong> ve liste yönetimine dön

source: Delete this list
hr: Obri¹i ovu listu
ro: Åžterge aceastã listã
tr: Bu liste silinsin mi?

source: Invalid options to CGI script
hr: Pogre¹ne opcije za CGI skriptu
ro: Opþiuni invalide pentru scriptul CGI
tr: CGI betiðine geçersiz seçenek

source: %(realname)s roster authentication failed.
hr: %(realname)s popis sa krivom autentikacijom.
ro: autentificare eºuatã pentru %(realname)s.
tr: %(realname)s liste kimlik doðrulamasý baþarýsýz oldu.

source: Error
hr: Gre¹ka
ro: Eroare
tr: Hata

source: You must supply a valid email address.
hr: Morate unijeti ispravnu e-mail adresu.
ro: Trebuie sã furnizaþi o adresã de email validã.
tr: Geçerli bir e-posta adresi vermelisiniz.

source: You may not subscribe a list to itself!
hr: Ne mo¾ete pretplatiti listu samu sebi!
ro: Nu puteþi abona o listã la ea însãºi!
tr: Bir listeyi kendisine üye yapamazsýnýz!

source: If you supply a password, you must confirm it.
hr: Ako unesete lozinku, morate istu i potvrditi.
ro: Dacã aþi scris o parolã, trebuie sã o confirmaþi.
tr: Bir þifre verirseniz, onu onaylamanýz gerekir.

source: Your passwords did not match.
hr: Va¹e lozinke se ne podudaraju.
ro: Parolele dumneavoastrã nu se potrivesc.
tr: Þifreleriniz birbiriyle eþleþmedi!

source: Your subscription request has been received, and will soon be acted upon. Depending on the configuration of this mailing list, your subscription request may have to be first confirmed by you via email, or approved by the list moderator. If confirmation is required, you will soon get a confirmation email which contains further instructions.
hr: Va¹ zahtjev za pretplatom je primljen i uskoro æemo ga procesirati. Zavisno o konfiguraciji ove mailing liste, va¹ zahtjev za pretplatom mo¾e prvo biti potvrðen mailom s va¹e strane ili odobren od strane moderatora liste. Ako je potrebna potvrda, uskoro æete dobiti mail s potvrdom, koji sadr¾i daljnje upute.
ro: Cererea dumneavoastrã de abonare a fost recepþionatã, ºi va fi luatã în considerare în scurt timp. În funcþie de configuraþia acestei liste, cererea dumneavoastrã de abonare va trebui probabil confirmatã prin email, sau aprobatã de cãtre moderatorul listei. Dacã este necesarã o confirmare, în scurt timp veþi primi un mesaj cu instrucþiuni suplimentare.
tr: Üyelik isteðiniz alýndý ve gerekenler yapýlacak. Mesaj listesinin yapýlandýrmasýna baðlý olarak üyelik isteðinizin e-posta yoluyla size onaylatýlmasý, veya liste moderatörü tarafýndan onaylanmasý gerekebilir. Eðer onay gerekiyorsa, kýsa bir süre sonra gerekli bilgileri içeren bir onay e-postasý alacaksýnýz.

source: The email address you supplied is banned from this mailing list. If you think this restriction is erroneous, please contact the list owners at %(listowner)s.
hr: E-mail adresa koju ste unijeli je udaljena s ove mailing liste. Ako mislite da je ova restrikcija prestroga, molim da se obratite vlasniku liste na %(listowner)s.
ro: Adresa pe care aþi dat-o este interzisã pe aceastã listã. Dacã credeþi cã aceastã restricþie este eronatã, vã rugãm sã contactaþi proprietarii listei la %(listowner)s.
tr: Verdiðiniz e-posta adresinin bu listeye üye olmasý yasaklanmýþ. Eðer bu kýsýtlamanýn hatalý olduðunu düþünüyorsanýz, %(listowner)s adresinden liste yöneticileriyle baðlantý kurabilirsiniz.

source: The email address you supplied is not valid. (E.g. it must contain an `@'.)
hr: E-mail adresa koju ste unijeli nije ispravna. (Npr. ista mora sadr¾avati `@'.)
ro: Adresa de email pe care aþi furnizat-o nu este validã. (De ex. trebuie sã conþinã un '@')
tr: Verdiðiniz e-posta adresi geçerli deðil. (Örneðin bir `@' karakteri içermeli.)

source: Your subscription is not allowed because the email address you gave is insecure.
hr: Va¹a pretplata nije dozvoljena zbog toga ¹to je e-mail adresa koju ste dali nesigurna.
ro: Abonarea dumneavoastrã nu este permisã deoarece adresa de email pe care ne-aþi dat-o nu este sigurã.
tr: Üyeliðinize izin verilmedi çünkü verdiðiniz e-posta adresi güvenli deðil.

source: Confirmation from your email address is required, to prevent anyone from subscribing you without permission. Instructions are being sent to you at %(email)s. Please note your subscription will not start until you confirm your subscription.
hr: Potrebna je potvrda s va¹e e-mail adrese, da bi se sprijeèilo bilo koga da vas pretplati bez va¹e dozvole. Upute su vam poslane na %(email)s. Primjetite da vam pretplata neæe poèeti dok ne potvrdite istu.
ro: Este necesarã confirmarea adresei dumneavoastrã de e-mail, pentru a preveni abonarea dumneavoastrã abuzivã. Instrucþiunile vã sunt trimise la %(email)s. Nu uitaþi cã abonamentul dumneavoastrã începe doar în momentul confirmãrii adresei de e-mail cu care v-aþi abonat.
tr: E-posta adresinizden onay, herhangi birisinin sizi izniniz olmadan üye yapmasýný engellemek için gereklidir. %(email)s adresinize gerekli bilgiler þu anda gönderiliyor. Üyeliðinizin siz onaylamadan önce baþlamayacaðýna dikkat edin.

source: Your subscription request was deferred because %(x)s. Your request has been forwarded to the list moderator. You will receive email informing you of the moderator's decision when they get to your request.
hr: Va¹ zahtjev za pretplatom je odgoðen zbog %(x)s. Zahtjev je proslijeðen moderatoru liste. Primit æete mail koji æe vas informirati o odluci moderatora.
ro: Cererea dumneavoastrã de abonare a fost amânatã datoritã %(x)s. Cererea dumneavoastrã a fost înaintatã cãtre moderatorul listei. Veþi primi un mesaj informativ privind decizia moderatorului, de îndatã ce acesta vã va prelua cererea.
tr: Üyelik isteðiniz ertelendi çünkü %(x)s. Ýsteðiniz liste moderatörüne iletildi. Ýsteðinizi aldýðýnda moderatörün kararýný bildiren bir e-posta alacaksýnýz.

source: You are already subscribed.
hr: Veæ ste pretplaæeni.
ro: Sunteþi deja abonat.
tr: Þu anda zaten üyesiniz.

source: Mailman privacy alert
hr: Uzbuna zbog povrede Mailmanove privatnosti
ro: Alertã Mailman
tr: Mailman gizlilik uyarýsý

source: An attempt was made to subscribe your address to the mailing list %(listaddr)s. You are already subscribed to this mailing list. Note that the list membership is not public, so it is possible that a bad person was trying to probe the list for its membership. This would be a privacy violation if we let them do this, but we didn't. If you submitted the subscription request and forgot that you were already subscribed to the list, then you can ignore this message. If you suspect that an attempt is being made to covertly discover whether you are a member of this list, and you are worried about your privacy, then feel free to send a message to the list administrator at %(listowner)s.
hr: Napravljen je poku¹aj da se va¹a adresa pretplati na mailing listu %(listaddr)s. Veæ ste prijavljeni na ovu mailing listu. Primijetite da èlanstvo na listi nije javno, pa je moguæe da je maliciozna osoba poku¹avala isprobati listu za svoje èlanstvo. Buduæi da bi to bilo povreda privatnosti mi joj to nismo dopustili. Ako ste poslali zahtjev za pretplatom i zaboravili da ste veæ pretplaæeni na listu, mo¾ete zanemariti ovu poruku. Ako sumnjate da je poku¹ano otkriti jeste li vi èlan ove liste, a vi ste zabrinuti zbog svoje privatnosti, tada slobodno po¹aljite poruku na adresu administratora liste na %(listowner)s.
ro: Cineva a încercat sã abonese adresa dumneavoastrã la lista de discuþii %(listaddr)s. Aceastã adresã este deja abonatã la aceastã listã.
tr: %(listaddr)s mesaj listesine e-posta adresinizi üye yapmak için bir giriþim oldu. Bu listeye zaten üyesiniz. Liste üyeliðinin genel olmadýðýný dikkate alýrsanýz, kötü bir kiþinin listeyi üyeleri ile ilgili araþtýrmasý olasýlýðý olduðunu görürsünüz. Eðer bunu yapmalarýna izin versek bu bir gizlilik ihlali olurdu ama, izin vermedik. Eðer üyelik isteðini siz gönderdiyseniz ve listeye zaten üye olduðunuzu unuttuysanýz bu mesajý gözardý edebilirsiniz. Eðer bunun, birisinin bu listeye üye olup olmadýðýnýzý gizlice öðrenmeye çalýþmasý olduðundan þüpheleniyorsanýz ve gizliliðiniz hakkýnda endiþe duyuyorsanýz liste yöneticisine %(listowner)s adresinden ulaþabilirsiniz.

source: This list does not support digest delivery.
hr: Ova lista ne podr¾ava digest dostavu.
ro: Aceastã listã nu suportã livrarea rezumatelor zilnice.
tr: Bu liste toplu gönderimi desteklemiyor.

source: This list only supports digest delivery.
hr: Ova lista podr¾ava samo digest dostavu.
ro: Aceastã listã suportã numai livrarea de rezumate zilnice.
tr: Bu liste sadece toplu gönderimi destekliyor.

source: You have been successfully subscribed to the %(realname)s mailing list.
hr: Uspje¹no ste pretplaæeni na %(realname)s mailing listu.
ro: Aþi fost abonat cu succes la lista de discuþii %(realname)s.
tr: %(realname)s mesaj listesine baþarýyla üye oldunuz.

source: confirm <confirmation-string> Confirm an action. The confirmation-string is required and should be supplied by a mailback confirmation notice.
hr: confirm <confirmation-string> Potvrdi akciju. Confirmation-string je potreban i treba biti dostavljen s povratnim, potvrdnim mailom.
ro: confirm <cod de confirmare> Confirmã o acþiune. Codul de confirmare este obligatoriu ºi trebuie trimis printr-un mesaj de confirmare.
tr: confirm <onay-dizisi> Bir eylemi onaylar. onay-dizgisi gereklidir ve e-posta onay bildirimi ile verilmelidir.

source: Usage:
hr: Kori¹tenje:
ro: Folosire:
tr: Kullaným:
