Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: List-specific text prepended to new-subscriber welcome message
hr: Specifièan tekst liste koji se dodaje poruci dobrodo¹lice za nove pretplatnike
ro: Textul specific listei care va fi inserat înaintea mesajului de bun venit pentru orice utilizator nou abonat
tr: Yeni üye olanlara giden Hoþgeldiniz mesajýnýn önüne eklenecek listeye özgü yazý

source: This value, if any, will be added to the front of the new-subscriber welcome message. The rest of the welcome message already describes the important addresses and URLs for the mailing list, so you don't need to include any of that kind of stuff here. This should just contain mission-specific kinds of things, like etiquette policies or team orientation, or that kind of thing. <p>Note that this text will be wrapped, according to the following rules: <ul><li>Each paragraph is filled so that no line is longer than 70 characters. <li>Any line that begins with whitespace is not filled. <li>A blank line separates paragraphs. </ul>
hr: Ova æe vrijednost, ako postoji, biti dodana prije poruke dobrodo¹lice novim pretplatnicima. Preostali dio poruke dobrodo¹lice veæ opisuje va¾ne adrese i URL-ove za mailing listu, tako da ovdje ne morate pisati slièan sadr¾aj. Samo unesite specifiène podatke, kao npr. pravila, timsku orjentaciju ili sl. <p>Primijetite da æe ovaj tekst biti razlomljen prema sljedeæim pravilima: <ul><li>Svaki je odlomak popunjen tako da niti jedna linija nije du¾a od 70 slova. <li>Svaka linija koja poèinje razmakom nije popunjena. <li>Prazna linija odvaja odlomke. </ul>
ro: Acest text (dacã existã), va fi adãugat înaintea mesajului de bun venit pentru fiecare nou abonat. Restul mesajului specificã adresele importante ºi URL-urile pentru aceastã listã de discuþii, deci nu trebuie sã adãugaþi aceste informaþii aici. Acest text trebuie sã conþinã doar detalii specifice, precum regulile de etichetã sau de orientare a listei. <p>Notaþi cã acest text va fi formatat conform urmãtoarelor reguli: <ul> <li>Fiecare paragraf este completat astfel încât rândurile nu sunt mai lungi de 70 de caractere.</li> <li>Orice rând care începe cu spaþii nu este completat;</li> <li>O linie goalã separã douã paragrafe</li> </ul>
tr: Bu deðer, boþ deðilse, yeni üye olanlara gönderilen hoþgeldiniz mesajýnýn önüne eklenir. Hoþgeldiniz mesajýnýn geri kalan kýsmý zaten önemli adresleri ve URL'leri içerdiði için o tür bilgiyi burada yazmanýza gerek yoktur. Buraya göreve özel yazýlarý örneðin etiket ilkeleri veya takým yönelimi gibi bilgileri yazabilirsiniz. <p>Bu yazý, þu kurallara uygun olarak kaydýrýlacaktýr: <ul><li>Her paragraf, her bir satýr 70 karakterden uzun olmayacak þekilde doldurulacaktýr. <li>Boþlukla baþlayan hiçbir satýr doldurulmaz. <li>Boþ bir satýr paragraflarý ayýrýr. </ul>

source: Send welcome message to newly subscribed members?
hr: Po¹alji poruku dobrodo¹lice novim pretplatnicima?
ro: Trimit mesajul de bun venit noilor abonaþi ai listei?
tr: Yeni eklenen üyelere hoþgeldiniz mesajý gönderilsin mi?

source: Turn this off only if you plan on subscribing people manually and don't want them to know that you did so. This option is most useful for transparently migrating lists from some other mailing list manager to Mailman.
hr: Ovu opciju iskljuèite samo ako planirate ruèno pretplatiti ljude i ne ¾elite da oni to znaju. Ujedno ova opcija je jako korisna za transparentno migriranje lista s nekog drugog sustava za upravljanje listama na Mailmana.
ro: Dezactivaþi aceastã opþiune numai dacã aþi planificat abonarea manualã a utilizatorilor ºi nu doriþi ca ei sã ºtie asta. Aceastã opþiune este foarte utilã pentru migrarea transparentã a altor liste de discuþii cãtre Mailman.
tr: Bunu, kiþileri kendiniz eklemek istiyorsanýz ve onlarýn bunu bilmelerini istemiyorsanýz açýn. Bu seçenek en çok baþka mesaj listesi programlarýndan Mailman'e mesaj listelerinizi taþýrken kullanýþlýdýr.

source: Text sent to people leaving the list. If empty, no special text will be added to the unsubscribe message.
hr: Tekst koji se ¹alje osobama koje napu¹taju listu. Ako je prazan, nikakav poseban tekst neæe biti dodan odjavnoj poruci.
ro: Textul trimis persoanelor care pãrãsesc lista. Dacã lipseºte, nici un text special nu va fi adãugat la mesajul de confirmare a dezabonãrii.
tr: Bu listeden çýkan kiþilere gönderilecek yazý. Eðer boþ býrakýlýrsa, listeden çýkma mesajýna herhangi bir yazý eklenmez.

source: Send goodbye message to members when they are unsubscribed?
hr: Po¹alji pozdravnu poruku èlanovima kada su odjavljeni?
ro: Trimit mesajul de bun rãmas membrilor la pãrãsirea listei?
tr: Listeden çýkan üyelere hoþçakalýn mesajý gönderilsin mi?

source: Should the list moderators get immediate notice of new requests, as well as daily notices about collected ones?
hr: Treba li moderator liste odmah dobiti obavijest o novim zahtjevima, kao ¹to dobiva dnevne obavijesti o prikupljenim zahtjevima?
ro: Sã primeascã moderatorii listei notificãri imediate despre cererile noi, precum ºi note zilnice despre cele adunate?
tr: Liste moderatörlerine yeni istekler anýnda bildirilsin ve var olan istekler günlük olarak hatýrlatýlsýn mý?

source: List moderators (and list administrators) are sent daily reminders of requests pending approval, like subscriptions to a moderated list, or postings that are being held for one reason or another. Setting this option causes notices to be sent immediately on the arrival of new requests as well.
hr: Moderatorima liste (i administratorima liste) se dnevno ¹alju podsjetnici zahtjeva za odobrenjem, kao ¹to su pretplate na moderiranu listu ili poslane poruke koje su zadr¾ane zbog nekog razloga. Postavljanje ove opcije uzrokuje slanje obavijesti odmah po primitku novih zahtjeva.
ro: Moderatorii listei (ºi administratorii acesteia) primesc zilnic mesaje de notificare a cererilor ce necesitã aprobare, precum cererile de abonare la listele moderate, sau mesajele reþinute pentru aprobare din diverse motive. Activarea acestei opþiuni va avea ca urmare trimiterea de notificãri pentru fiecare eveniment ce necesitã aprobare.
tr: Liste moderatörlerine (ve liste yöneticilerine) moderatör onayý isteyen listelere üyelikler veya herhangi bir nedenden dolayý bekletinen mesajlar gibi onay bekleyen isteklerin günlük hatýrlatýcýlarý gönderilir. Bu seçeneðin ayarlanmasý yeni istekler geldiði anda da bu bildirimlerin gönderilmesini saðlar.

source: Should administrator get notices of subscribes and unsubscribes?
hr: Treba li administrator dobivati obavijesti o pretplatama i odjavama?
ro: Trebuie administratorii sã primeascã notificãri ale abonãrilor ºi dezabonãrilor?
tr: Yöneticilere liste üyelikleri ve listeden çýkmalarýn bildirimi gönderilsin mi?

source: Send mail to poster when their posting is held for approval?
hr: Po¹alji e-mail po¹iljatelju kada je njegova poruka zadr¾ana za odobrenje?
ro: Trimit o notã cãtre expeditor când mesajul acestuia este reþinut pentru aprobare?
tr: Göndericiye mesajý onay beklemeye alýndýðýnda e-posta gönderilsin mi?

source: Additional settings
hr: Dodatne postavke
ro: Setãri suplimentare
tr: Ek ayarlar

source: Emergency moderation of all list traffic.
hr: Hitna moderacija cjelokupnog prometa liste.
ro: Supravegherea de urgenþã a întregului trafic al listei.
tr: Tüm trafiðe acil moderatör onayý

source: When this option is enabled, all list traffic is emergency moderated, i.e. held for moderation. Turn this option on when your list is experiencing a flamewar and you want a cooling off period.
hr: Kada je ova opcija ukljuèena, cjelokupan promet liste je hitno moderiran, tj. zadr¾an za moderiranje. Ukljuèite ovu opciju onda kada va¹a lista do¾ivljava flame rat, a vi ¾elite sve to malo ohladiti.
ro: Când aceastã opþiune este activatã, tot traficul listei este moderat în regim de urgenþã, adicã toate mesajele sunt reþinute pentru aprobare. Activaþi aceastã opþiune în momentele în care lista este supusã unor discuþii foarte aprinse ºi doriþi sã mai calmaþi spiritele pentru o perioadã.
tr: Bu seçenek etkinleþtirildiðinde, tüm liste trafiði acil olarak moderatör onayýna alýnarak bekletilir. Listenizde kiþiler arasýnda bir atýþma olursa ve bir süre durulma olmasýný isterseniz bu seçeneði açýn.

source: Default options for new members joining this list.<input type="hidden" name="new_member_options" value="ignore">
hr: Poèetne postavke za nove èlanove koji dolaze na listu.<input type="hidden" name="new_member_options" value="ignore">
ro: Opþiunile din oficiu pentru noii membrii ce se alãturã acestei liste.<input type="hidden" name="new_member_options" value="ignore">
tr: Bu listeye yeni üye olanlar için varsayýlan ayarlar.<input type="hidden" name="new_member_options" value="ignore">

source: When a new member is subscribed to this list, their initial set of options is taken from the this variable's setting.
hr: Kada je novi èlan pretplaæen na ovu listu, njegove su poèetne postavke uzete iz vrijednosti varijabli.
ro: Când un nou membru este abonat la aceastã listã, setul iniþial de opþiuni este preluat din valorile acestei variabile.
tr: Yeni bir kiþi listeye üye olduðunda, baþlangýç ayarlarý bu deðiþkenden alýnýr.

source: (Administrivia filter) Check postings and intercept ones that seem to be administrative requests?
hr: (Administracijski filter) Provjerite poslane poruke i presretnite one za koje vam se èini da su administrativni zahtjevi?
ro: (Filtru administrativ) Verific mesajele trimise ºi interceptez cererile administrative?
tr: (Yönetimsel filtre) Gönderiler incelenerek yönetimsel görünen istekler yakalansýn mý mu?

source: Administrivia tests will check postings to see whether it's really meant as an administrative request (like subscribe, unsubscribe, etc), and will add it to the the administrative requests queue, notifying the administrator of the new request, in the process.
hr: Testovi administracije æe provjeriti poslane poruke da bi se ustanovilo jesu li one stvarno administracijski zahtjevi (kao npr. pretplata, odjava itd.) te æe ih dodati u red èekanja administracijskih zahtjeva, obavje¹tavajuæi administratora o novim zahtjevima koji se obraðuju.
ro: Testele administrative vor verifica mesajul pentru a verifica dacã acesta este într-adevãr o cerere administrativã (precum o cerere de abonare, pãrãsire a listei, etc.) ºi o va adãuga în coada de cereri administrative, notificând administratorul.
tr: Yönetimsel testler mesajlarýn gerçekten yönetimsel bir istek olup olmadýðýný kontrol eder (üye olma, listeden çýkma vb.) ve öyleyse, yönetimsel istekler kuyruðuna ekleyerek yöneticiyi yeni istekten haberdar eder.

source: Maximum length in kilobytes (KB) of a message body. Use 0 for no limit.
hr: Maksimalna velièina tijela poruke u kilobajtima (KB). Koristite 0 za neogranièeno.
ro: Dimensiunea maximã în kiloocteþi (Ko) a corpului mesajului. 0 înseamnã fãrã limitã.
tr: Mesaj gövdesinin kilobayt (KB) olarak maksimum uzunluðu. Sýnýr koymamak için 0 kullanýn.

source: Host name this list prefers for email.
hr: Naziv raèunala kojeg ova lista preferira za e-mail.
ro: Numele serverului (host name) preferat pentru email.
tr: Bu listenin e-posta için tercih ettiði ana bilgisayar adý

source: The "host_name" is the preferred name for email to mailman-related addresses on this host, and generally should be the mail host's exchanger address, if any. This setting can be useful for selecting among alternative names of a host that has multiple addresses.
hr: "host_naziv" je preferirani naziv za e-mail adrese vezane uz mailmana na ovom raèunalu, koje bi ujedno trebalo biti raèunalo za razmjenu mail adrese, ako ona postoji. Ova postavka mo¾e biti korisna za odabir izmeðu vi¹e alternativnih naziva hosta koji ima vi¹e adresa.
ro: "Numele serverului" (host name) este numele folosit pentru toate adresele de e-mail relative la lista mailman pe acest server ºi în general este adresa definitã în înregistrãrile MX. Acest parametru se dovedeºte util în cazul selectãrii dintre nume de servere ce au adrese multiple.
tr: "host_name", bu sunucuda mailman ile ilgili adreslerin e-posta için tercih ettikleri addýr ve eðer varsa, genel olarak e-posta sunucunuzun adresidir. Farklý adreslere sahip bir sunucunun alternatif isimlerinden birini seçmek için kullanýþlý bir ayardýr.

source: Should messages from this mailing list include the <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> (i.e. <tt>List-*</tt>) headers? <em>Yes</em> is highly recommended.
hr: Trebaju li poruke s ove mailing liste ukljuèivati <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> (npr. <tt>List-*</tt>) zaglavlja? Preporuèuje se <em>Da</em>.
ro: Sã includã mesajele acestei liste ºi headerele <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> (de ex: <tt>List-*</tt>) ? <em>Da</em> este foarte recomandat.

source: RFC 2369 defines a set of List-* headers that are normally added to every message sent to the list membership. These greatly aid end-users who are using standards compliant mail readers. They should normally always be enabled. <p>However, not all mail readers are standards compliant yet, and if you have a large number of members who are using non-compliant mail readers, they may be annoyed at these headers. You should first try to educate your members as to why these headers exist, and how to hide them in their mail clients. As a last resort you can disable these headers, but this is not recommended (and in fact, your ability to disable these headers may eventually go away).
hr: RFC 2369 definira skup List-* zaglavlja dodanih svakoj poruci koja je poslana èlanstvu liste. Navedeno znatno poma¾e krajnjim korisnicima koji koriste mail preglednike koji podlije¾u standardima. Ova zaglavlja bi uvijek trebala biti omoguæena. <p>Ipak, nisu svi mail preglednici kompatibilni sa standardima, pa ako imate veliki broj korisnika takvih preglednika, oni mogu biti nezadovoljni spomenutim zaglavljima. Prvo biste trebali poduèiti svoje èlanove za¹to ta zaglavlja postoje i kako ih sakriti u njihovim mail preglednicima, dok kao krajnju mjeru mo¾ete iste onemoguæiti, ¹to se ipak ne preporuèa (ta moguænost mo¾e u buduænosti biti i izbaèena).
ro: RFC 2369 defineºte un set de headere List-* ce sunt adãugate în mod normal oricãrui mesaj trimis listei. Aceste headere vin în ajutorul abonaþilor ce folosesc clienþi de e-mail care respectã standardele, ºi ar trebui sã fie activate întotdeauna. <p>Totuºi, nu toþi clienþii de e-mail respectã standardele în întregime, ºi în cazul unui numãr mare de abonaþi ce folosesc clienþi non-standard, ei pot fi deranjaþi de aceste headere suplimentare. Ca un prim pas trebuie sã încercaþi sã educaþi abonaþii în privinþa acestor headere ºi cum sã le ascundã în clienþii lor de e-mail. Ca ultimã mãsurã puteþi apela la dezactivarea acestor headere, dar acest lucru nu este deloc recomandat (ºi în viitor oricum s-ar putea sã nu mai puteþi interveni asupra acestor headere).
tr: RFC 2369 liste üyelerine gönderilen her mesaja normal olarak eklenen List-* baþlýklarýný tanýmlar. Bunlar standartlara uygun mesaj okuma programlarý kullanan son kullanýcýlara genellikle yardýmcý olur. Normalde her zaman etkin olmalarý gereklidir. <p>Fakat, tüm mesaj okuma programlarý henüz standartlara uygun olmadýðý için ve bu tür programlarý kullanan çok sayýda kullanýcýnýz varsa, bu baþlýklardan rahatsýz olabilirler. Önce üyelerinizi bu baþlýklarýn niye olduðu konusunda ve programlarýnda bu baþlýklarý nasýl gizleyecekleri konusunda eðitmeye çalýþmalýsýnýz. Son bir çare olarak bu baþlýklarý devre dýþý býrakabilirsiniz, fakat bu önerilmez (yakýnda bu baþlýklarý devre dýþý býrakabilme yeteneðiniz de yok olabilecektir.)

source: Should postings include the <tt>List-Post:</tt> header?
hr: Trebaju li poslane poruke ukljuèivati <tt>List-Post:</tt> zaglavlje?
ro: Mesajele includ ºi headerul <tt>List-Post:</tt>?
tr: Mesajlar <tt>List-Post:</tt> baþlýðýný içersin mi?

source: The <tt>List-Post:</tt> header is one of the headers recommended by <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a>. However for some <em>announce-only</em> mailing lists, only a very select group of people are allowed to post to the list; the general membership is usually not allowed to post. For lists of this nature, the <tt>List-Post:</tt> header is misleading. Select <em>No</em> to disable the inclusion of this header. (This does not affect the inclusion of the other <tt>List-*:</tt> headers.)
hr: <tt>List-Post:</tt> zaglavlje je jedno od zaglavlja koje preporuèuje <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a>. Ipak za neke <em>samo objava</em> mailing liste, slanje poruka na listu je dozvoljeno samo izabranoj skupini ljudi; normalnom èlanstvu najèe¹æe nije dozvoljeno slanje poruka. Za liste ove vrste <tt>List-Post:</tt> zaglavlje je napotrebno. Izaberite <em>Ne</em> da biste onemoguæili ukljuèivanje ovoga zaglavlja. (Ovo ne utjeèe na ukljuèivanje drugih <tt>List-*:</tt> zaglavlja.)
ro: Headerul <tt>List-Post</tt> este unul din headerele recomandate de <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a>. Totuºi, în cazul unor <em>liste de anunþuri</em>, doar un grup foarte restrâns de abonaþi are dreptul de a publica mesaje, în timp ce restul abonaþilor nu are acest drept. În acest caz, headerul <tt>List-Post</tt> este confuz. Selectaþi <em>Nu</em> pentru a dezactiva acest header. (Acest fapt nu afecteazã însã includerea celorlalte headere <tt>List-*:</tt>.)
tr: <tt>List-Post:</tt> baþlýðý, <a href="http://www.faqs.org/rfcs/rfc2369.html">RFC 2369</a> tarafýndan önerilen baþlýklardan birisidir. Ancak bazý <em>sadece ilan için olan</em> mesaj listelerinde sadece seçilmiþ bir grup kiþi listeye mesaj gönderebilir; genel olarak üyeler mesaj gönderme hakkýna sahip deðildir. Bu tür listelerde <tt>List-Post:</tt> baþlýðý yanýltýcýdýr. Bu baþlýðýn eklenmemesi için <em>Hayýr</em> seçin. (Bu, diðer <tt>List-*:</tt> baþlýklarýnýn eklenmesini etkilemez.)

source: Discard held messages older than this number of days. Use 0 for no automatic discarding.
ro: Aruncã mesajele mai vechi decât numãrul de zile specificat. Puneþi 0 pentru a dezactiva aruncarea automatã.

source: <b>real_name</b> attribute not changed! It must differ from the list's name by case only.
hr: <b>stvarno_ime</b> atribut nije promjenjen! Ono se mora razlikovati od naziva liste samo po velikim i malim slovima.
ro: atributul <strong>real_name</strong> nu a fost modificat! Acesta trebuie sã difere de precedentul nume doar prin folosirea majusculelor.
tr: <strong>real_name</strong> özelliði deðiþmedi! Liste isminden sadece büyük-küçük harf farký olmalý.

source: You cannot add a Reply-To: to an explicit address if that address is blank. Resetting these values.
hr: Ne mo¾ete dodati Reply-To: explicitno navedenoj adresi, ako je ta adresa prazna. Resetiram ove vrijednosti.
ro: Nu puteþi adãuga un header Reply-To la o adresã explicitã dacã acea adresã este goalã. Resetz valorile.
tr: Eðer adres boþ ise bu adrese bir Reply-To: ekleyemezsiniz. Bu deðerler sýfýrlanýyor.

source: Language&nbsp;options
hr: Jeziène&nbsp;postavke
ro: Opþiuni de limbã
tr: Dil&nbsp;Seçenekleri

source: Natural language (internationalization) options.
hr: Postavke za materinski jezik (internacionalizacija).
ro: Opþiunile de limbã (internaþionalizare).
tr: Doðal dil seçenekleri

source: Default language for this list.
hr: Poèetni jezik za ovu listu.
ro: Limba predefinitã pentru aceastã listã
tr: Bu listenin varsayýlan dili.

source: Languages supported by this list.
hr: Jezici koje podr¾ava ova lista.
ro: Limbile suportate de aceastã listã
tr: Bu listenin desteklediði diller

source: These are all the natural languages supported by this list. Note that the <a href="?VARHELP=language/preferred_language">default language</a> must be included.
hr: Ovo su sve materinski jezici koje podr¾ava ova lista. Primijetite da <a href="?VARHELP=language/preferred_language">poèetni jezik</a> mora biti ukljuèen.
ro: Acestea sunt toate limbile acceptate pe aceastã listã. Notaþi cã <a href="?VARHELP=language/preferred_language">limba implicitã</a> trebuie inclusã.
tr: Bunlar, bu listenin desteklediði tüm doðal dillerdir. <a href="?VARHELP=language/preferred_language">varsayýlan dilin</a> de burada seçili olmasý gereklidir.

source: Always
hr: Uvijek
ro: Totdeauna
tr: Her zaman

source: As needed
hr: Po potrebi
ro: La nevoie
tr: Gerektiðinde

source: Never
hr: Nikada
ro: Niciodatã
tr: Hiçbir zaman

source: Encode the <a href="?VARHELP=general/subject_prefix">subject prefix</a> even when it consists of only ASCII characters?
hr: Kodiraj <a href="?VARHELP=general/subject_prefix">prefiks naslova</a> èak i onda kada se sastoji samo od ASCII znakova?
ro: Encodez <a href="?VARHELP=general/subject_prefix">prefixul subiectului</a> chiar ºi dacã el constã doar din caractere ASCII?
tr: <a href="?VARHELP=general/subject_prefix">konu önek'i</a> sadece ASCII karakterler içerse bile kodlansýn mý?
