Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Your <code>%(property)s</code> string appeared to have some correctable problems in its new value. The fixed value will be used instead. Please double check that this is what you intended.
hr: Èini se da va¹ <code>%(property)s</code> tekst ima neke probleme koji se mogu popraviti u njegovoj novoj vrijednosti. Popravljena vrijednost æe biti kori¹tena. Molim, provjerite da je ovo zaista ono ¹to ste namjeravali..
ro: Codul dumneavoastrã <code>%(property)s</code> pare sã aibã câteva erori corectabile la noile valori. Valorile fixe vor fi folosite în locul acestora; vã rugãm sã re-verificaþi cã valorile sunt cele dorite.
tr: <code>%(property)s</code> dizginiz yeni deðerinde bazý düzeltilebilir sorunlar içerir gibi görünüyor. Bunlar yerine düzeltilmiþ deðerler kullanýlacak. Lütfen niyetinizin bu olduðunu tekrar kontrol edin.

source: General Options
hr: Opæe postavke
ro: Opþiuni generale
tr: Genel Seçenekler

source: Conceal the member's address
hr: Sakrivena èlanska adresa
ro: Ascund adresa utilizatorului
tr: Üye adresini gizle

source: Acknowledge the member's posting
hr: Potvrdi poslanu poruku èlana
ro: Confirmaþi mesajul utilizatorului
tr: Üye mesajýnýn ek bilgisini al

source: Do not send a copy of a member's own post
hr: Ne ¹alji kopiju poruke koja je poslana od strane nekog èlana liste
ro: Nu trimit duplicate ale mesajului utilizatorului
tr: Üyeye kendi mesajýnýn kopyasýný gönderme

source: Filter out duplicate messages to list members (if possible)
hr: Filtriraj duplikate poruka èlanovima liste (ako je moguæe)
ro: Filtrez mesajele duplicate cãtre membrii listei (dacã este posibil)
tr: Liste üyelerine gidecek kopya mesajlarý filtrele (eðer mümkünse)

source: Fundamental list characteristics, including descriptive info and basic behaviors.
hr: Glavne karakteristike liste, ukljuèujuæi opisne informacije i osnovna pona¹anja.
ro: Caracteristici fundamentale ale listei, incluzând informaþii descriptive ºi comportamente de bazã.
tr: Tanýmlayýcý bilgi ve temel davranýþlarý içeren ana liste özellikleri.

source: General list personality
hr: Opæenita personalizacija liste
ro: Personalitatea generalã a listei
tr: Genel liste kiþiliði

source: The public name of this list (make case-changes only).
hr: Javni naziv liste (napravite samo promjene vezane uz velika i mala slova).
ro: Numele public al acestei liste (modificaþi doar din/în majuscule/minuscule).
tr: Bu listenin genel ismi (sadece büyük-küçük harf deðiþikliði yapýn).

source: The capitalization of this name can be changed to make it presentable in polite company as a proper noun, or to make an acronym part all upper case, etc. However, the name will be advertised as the email address (e.g., in subscribe confirmation notices), so it should <em>not</em> be otherwise altered. (Email addresses are not case sensitive, but they are sensitive to almost everything else :-)
hr: Promjena velikih i malih slova u nazivu mo¾e biti napravljena sa svrhom ljep¹eg izgleda, u obliku neke imenice ili kao kratica u obliku velikih slova itd. Ipak, naziv æe biti ogla¹en kao e-mail adresa (npr. u obavijestima za potvrdu pretplate), tako da ga u pravilu <em>ne</em> bi trebalo mijenjati. (E-mail adrese nisu osjetljive na promjenu velikih i malih slova, ali su zato osjetljive na bilo koju drugu promjenu :-)
ro: Modificarea acestui nume folosind majuscule sau minuscule poate fi realizatã în caz de nevoie: substantiv comun, acronim, parte dintr-un titlu unde toate literele sunt majuscule, etc. Totuºi, nu uitaþi cã acest nume va fi folosit ca ºi adresã de e-mail (de ex. în mesajele de confirmare a abonãrii), deci este recomandat sã <em>nu</em> faceþi alte modificãri. (Adresele de e-mail nu sunt afectate de tipul caracterelor - majuscule sau miuscule - dar sunt afectate de orice alte modificãri :-)
tr: Listenin isminin baþ harfinin büyük harfle yazýlmasý daha kibar bir özel isim olarak görünmesini saðlayabilir, veya bir kýsmý tamamen büyük harfle yazýlabilir vb. Fakat isim e-posta adresi olarak ilan edileceði için (örneðin üyelik onay bildirimlerinde), <em>kesinlikle</em> baþka bir isme deðiþtirilmemelidir. (E-posta adresleri büyük-küçük harf farkýna karþý hassas deðildir, ama neredeyse baþka herþeye karþý hassastýrlar :-)

source: The list administrator email addresses. Multiple administrator addresses, each on separate line is okay.
hr: E-mail adrese administratora. Prihvatljive su vi¹estruke administratorske adrese, od kojih je svaka u drugoj liniji.
ro: Adresele de email ale administratorilor listei. Adresele multiple trebuie scrise separat, câte una pe rând.
tr: Liste yöneticisi e-posta adresleri. Birden çok yönetici adresi tanýmlanabilir, her satýra tek bir adres yazýn.

source: There are two ownership roles associated with each mailing list. The <em>list administrators</em> are the people who have ultimate control over all parameters of this mailing list. They are able to change any list configuration variable available through these administration web pages. <p>The <em>list moderators</em> have more limited permissions; they are not able to change any list configuration variable, but they are allowed to tend to pending administration requests, including approving or rejecting held subscription requests, and disposing of held postings. Of course, the <em>list administrators</em> can also tend to pending requests. <p>In order to split the list ownership duties into administrators and moderators, you must <a href="passwords">set a separate moderator password</a>, and also provide the <a href="?VARHELP=general/moderator">email addresses of the list moderators</a>. Note that the field you are changing here specifies the list administrators.
hr: Postoje dvije uloge vlasni¹tva koje su povezane sa svakom mailing listom. <em>Administratori liste</em> su ljudi koji imaju sveukupnu kontrolu nad svim parametrima ove mailing liste. Oni su u moguænosti promjeniti bilo koju konfiguracijsku varijablu liste, koja je dostupna kori¹tenjem ovih administratorskih web-stranica. <p><em>Moderatori liste</em> imaju ogranièene dozvole; oni ne mogu promjeniti bilo koju konfiguracijsku varijablu liste, ali mogu obavljati poslove vezane uz administracijske zahtjeve. To ukljuèuje odobravanje ili odbijanje zadr¾anih zahtjeva za pretplatom i rasporeðivanje zadr¾anih poruka. Naravno, <em>administratori liste </em> mogu se baviti i zahtjevima na èekanju. <p>Da bi se ove du¾nosti podijelile na administratorske i moderatorske morate <a href="passwords">postaviti odvojenu lozinku za moderatora</a> i omoguæiti <a href="?VARHELP=general/moderator">e-mail adrese moderatora liste</a>. Primjetite da polje koje ovdje mijenjate odreðuje administratore liste.
ro: Existã douã roluri de proprietate asociate cu fiecare listã. <p><em>Administratorii listei</em> sunt persoane care au controlul absolut asupra tuturor parametrilor acestei liste. Aceºtia au dreptul ºi posibilitatea de a modifica orice variabile de configurare prin intermediul acestor pagini web.</p> <p><em>Moderatorii listei</em> au permisiuni limitate, ei neavând dreptul de a modifica nici o variabilã de configurare a listei, dar au permisiunea de a procesa cererile în aºteptare, inclusiv aprobarea sau respingerea cererilor de abonare ºi procesarea mesajelor din coada de moderare. Desigur, ºi <em>administratorii listei</em> au acest drept.</p> <p>Pentru a putea separa sarcinile de proprietate în categoriile administrative ºi de moderare, trebuie sã <a href="passwords">setaþi o parolã separate de moderare</a>, ºi de asemenea sã publicaþi <a href="?VARHELP=general/moderator">adresele de e-mail ale moderatorilor listei</a>. Nu uitaþi cã acest câmp la care faceþi modificãri specificã administratorii listei.</p>
tr: Her mesaj listesi için iki sahiplik rolü vardýr. <em>Liste yöneticileri</em> bu listede tüm parametreler üzerinde kontrol sahibi olan kiþilerdir. Liste ayarlarýyla ilgili her deðeri bu yönetim sayfalarý aracýlýðýyla deðiþtirebilirler. <p><em>Moderatörler</em> daha sýnýrlý izinlere sahiptirler, herhangi bir ayar deðerini deðiþtiremezler, sadece bekleyen yönetim isteklerine bakarak üyelik istekleri ile mesajlarý kabul edebilir veya reddedebilirler. Tabi ki <em>liste yöneticileri</em> de bekleyen yönetim isteklerine cevap verebilir. <p>Liste yönetim görevlerini yöneticiler ve moderatörler arasýnda bölmek için <a href="passwords">farklý bir moderatör þifresi belirlemeniz></a> ve ayrýca liste moderatörlerinin <a href="?VARHELP=general/moderator">e-posta adreslerini tanýmlamanýz gereklidir. Burada deðiþtirdiðiniz alan liste yöneticilerini belirlemektedir.

source: The list moderator email addresses. Multiple moderator addresses, each on separate line is okay.
hr: E-mail adrese moderatora liste. Prihvatljive su vi¹estruke moderatorske adrese, od kojih je svaka u drugoj liniji.
ro: Adresele de e-mail ale moderatorilor listei. Adresele multiple trebuie scrise separat, câte una pe rând.
tr: Liste moderatör adresleri. Birden çok moderatör adresi tanýmlanabilir, her satýra tek bir adres yazýn.

source: There are two ownership roles associated with each mailing list. The <em>list administrators</em> are the people who have ultimate control over all parameters of this mailing list. They are able to change any list configuration variable available through these administration web pages. <p>The <em>list moderators</em> have more limited permissions; they are not able to change any list configuration variable, but they are allowed to tend to pending administration requests, including approving or rejecting held subscription requests, and disposing of held postings. Of course, the <em>list administrators</em> can also tend to pending requests. <p>In order to split the list ownership duties into administrators and moderators, you must <a href="passwords">set a separate moderator password</a>, and also provide the email addresses of the list moderators in this section. Note that the field you are changing here specifies the list moderators.
hr: Postoje dvije uloge vlasni¹tva koje su povezane sa svakom mailing listom. <em>Administratori liste</em> su ljudi koji imaju sveukupnu kontrolu nad svim parametrima ove mailing liste. Oni su u moguænosti promjeniti bilo koju konfiguracijsku varijablu liste koja je dostupna preko ovih administracijskih web stranica. <p><em>Moderatori liste</em> imaju ogranièene moguænosti; oni ne mogu promjeniti bilo koju konfiguracijsku varijablu liste, ali mogu obavljati poslove vezane uz administracijske zahtjeve, To ukljuèuje odobravanje ili odbijanje zadr¾anih zahtjeva za pretplatom i raporeðivanje zadr¾anih poruka. Naravno, <em>administratori liste </em> mogu se baviti i zahtjevima na èekanju. <p>Da bi se ove du¾nosti podijelile na administratorske i moderatorske, morate <a href="passwords">postaviti odvojenu lozinku za moderatora</a> i omoguæiti adrese moderatora liste u ovom dijelu. Primjetite da polje koje ovdje mijenjate odreðuje moderatore liste.
ro: Existã douã roluri de proprietate asociate cu fiecare listã. <p><em>Administratorii listei</em> sunt persoane care au controlul absolut asupra tuturor parametrilor acestei liste. Aceºtia au dreptul ºi posibilitatea de a modifica orice variabile de configurare prin intermediul acestor pagini web.</p> <p><em>Moderatorii listei</em> au permisiuni limitate, ei neavând dreptul de a modifica nici o variabilã de configurare a listei, dar au permisiunea de a procesa cererile în aºteptare, inclusiv aprobarea sau respingerea cererilor de abonare ºi procesarea mesajelor din coada de moderare. Desigur, ºi <em>administratorii listei</em> au acest drept.</p> <p>Pentru a putea separa sarcinile de proprietate în categoriile administrative ºi de moderare, trebuie sã <a href="passwords">setaþi o parolã separate de moderare</a>, ºi de asemenea sã publicaþi <a href="?VARHELP=general/moderator">adresele de e-mail ale moderatorilor listei</a>. Nu uitaþi cã acest câmp la care faceþi modificãri specificã moderatorii listei.</p>
tr: Her mesaj listesi için iki sahiplik rolü vardýr. <em>Liste yöneticileri</em> bu listede tüm parametreler üzerinde kontrol sahibi olan kiþilerdir. Liste ayarlarýyla ilgili her deðeri bu yönetim sayfalarý aracýlýðýyla deðiþtirebilirler. <p><em>Moderatörler</em> daha sýnýrlý izinlere sahiptirler, herhangi bir ayar deðerini deðiþtiremezler, sadece bekleyen yönetim isteklerine bakarak üyelik istekleri ile gönderileri kabul edebilir veya reddedebilirler. Tabi ki <em>liste yöneticileri</em> de bekleyen yönetim isteklerine cevap verebilir. <p>Liste yönetim görevlerini yöneticiler ve moderatörler arasýnda bölmek için <a href="passwords">farklý bir moderatör þifresi belirlemeniz></a> ve ayrýca liste moderatörlerinin adreslerini bu bölümde tanýmlamanýz gereklidir. Burada deðiþtirdiðiniz alan liste moderatörlerini belirlemektedir.

source: A terse phrase identifying this list.
hr: Sa¾eta fraza koja identificira ovu listu.
ro: O terþã frazã pentru identificarea acestei liste.
tr: Bu listeyi belirleyen kýsa bir ifade.

source: This description is used when the mailing list is listed with other mailing lists, or in headers, and so forth. It should be as succinct as you can get it, while still identifying what the list is.
hr: Ovaj opis se koristi onda kada je mailing lista na istom popisu kao i druge mailing liste, u zaglavljima i slièno. Trebao bi biti kratak toliko koliko treba da shvatite o èemu se radi na listi, tj. da listu na neki naèin identificira.
ro: Descrierea este folositã când lista de discuþii este prezentatã împreunã cu alte liste, în headere, ºi aºa mai departe. Trebuie sã fie cât mai succintã, dar sã identifice lista.
tr: Bu tanýmlama, bu mesaj listesi diðer listelerle beraber listelendiðinde veya baþlýklarda vb. kullanýlýr. Mümkün olduðunca özlü olmalý, ayný anda da bu listenin ne olduðunu tanýmlamalýdýr.

source: An introductory description - a few paragraphs - about the list. It will be included, as html, at the top of the listinfo page. Carriage returns will end a paragraph - see the details for more info.
hr: Uvodni opis - nekoliko odlomaka - opæenito o listi. Bit æe biti ukljuèen kao html na vrh stranice sa informacijama o listi. Pritisak na tipku enter zavr¹iti æe odlomak - za vi¹e informacija pogledajte detalje.
ro: O descriere introductivã - cãteva paragrafe - despre listã. Va fi inclusã, ca ºi cod HTML, la începutul paginii de informaþii generale despre listã. Carriage return separã paragrafele - vedeþi detaliile pentru mai multe informaþii.
tr: Liste ile ilgili bir önsöz - birkaç paragraf -. Liste bilgisinin baþýna, html olarak eklenecektir. Satýrbaþlarý bir paragrafý bitirir. - daha fazla bilgi için ayrýntýlara bakýnýz.

source: The text will be treated as html <em>except</em> that newlines will be translated to &lt;br&gt; - so you can use links, preformatted text, etc, but don't put in carriage returns except where you mean to separate paragraphs. And review your changes - bad html (like some unterminated HTML constructs) can prevent display of the entire listinfo page.
hr: Tekst æe biti shvaæen kao html, <em>osim</em> ¹to æe nove linije biti prevedene kao <br> - mo¾ete koristiti linkove, formatirani tekst itd., ali nemojte umetati entere, osim tamo gdje mislite odvojiti odlomke. Takoðer pregledajte svoje promjene - pogre¹an html (kao npr. otvoreni HTML tagovi) mo¾e sprijeèiti prikaz cijele stranice sa informacijama o listi.
ro: Textul va fi tratat ca cod HTML <em>exceptând</em> faptul cã rândurile noi vor fi traduse în <strong>&lt;br&gt;</strong> - deci puteþi folosi link-uri, text formatat, etc. , dar nu introduceþi CR (rând nou) decât în cazurile în care doriþi separarea paragrafelor. ªi nu uitaþi sã revizuiþi toate modificãrile; codul HTML eronat (precum unele link-uri cu cod neterminat) pot împiedica afiºarea corectã a întregii pagini de prezentare a listei.
tr: Bu yazý html olarak ele alýnacaktýr, sadece yeni satýrlar &lt;br&gt; haline çevrilir, yani önceden düzenlenmiþ yazýlar, linkler kullanabilirsiniz, yalnýz paragraflarý ayýrmak istediðiniz yerler dýþýnda satýr baþý kullanmayýn. Deðiþikliklerinizi gözden geçirin - kötü html (örneðin sonlanmamýþ HTML yapýlarý) tüm liste bilgi sayfasýnýn görünümünü engelleyebilir.

source: Prefix for subject line of list postings.
hr: Prefiks za naslovnu liniju poruke.
ro: Prefixul subiectului mesajelor listei.
tr: Mesajlarýn konu baþlýðý için önek

source: Hide the sender of a message, replacing it with the list address (Removes From, Sender and Reply-To fields)
hr: Sakrij po¹iljatelja poruke tako da ga zamijeni¹ adresom liste (Uklanja From, Sender i Reply-To polja).
ro: Ascund adresa expeditorului, înlocuind-o cu adresa listei (sunt ºterse câmpurile From, Sender ºi Reply-To)
tr: Mesajýn göndericisini, liste adresi ile deðiþtirerek gizle (Gönderen, Alýcý ve Reply-To alanlarýný deðiþtirir)

source: <tt>Reply-To:</tt> header munging
hr: <tt>Reply-To:</tt> rad sa zaglavljima
ro: Prelucrarea headerului <tt>Reply-To:</tt>
tr: <tt>Reply-To:</tt> baþlýðýný yok et

source: Should any existing <tt>Reply-To:</tt> header found in the original message be stripped? If so, this will be done regardless of whether an explict <tt>Reply-To:</tt> header is added by Mailman or not.
hr: Trebaju li veæ postojeæa <tt>Reply-To:</tt> zaglavlja, koja su pronaðena u izvornoj poruci, biti odrezana? Ako trebaju, ovo æe biti napravljeno bez obzira da li je <tt>Reply-To:</tt> zaglavlje dodano od strane Mailmana ili nije dodano.
ro: Sã ºterg orice header de genul <tt>Reply-To:</tt> din mesajul original ? Dacã da, acesta va fi ºters chiar dacã adãugaþi sau nu din Mailman un header explicit <tt>Reply-To:</tt>.
tr: Özgün mesajda bulunan <tt>Reply-To:</tt> baþlýðý silinsin mi? Eðer yapýlacaksa, Mailman tarafýndan ayrý bir <tt>Reply-To:</tt> baþlýðý eklense de eklenmese de silinecektir.

source: Explicit address
hr: Eksplicitna adresa
ro: Adresã explicitã
tr: Farklý adres

source: Poster
hr: Po¹iljatelj
ro: Expeditor
tr: Gönderici

source: This list
hr: Ova lista
ro: Aceastã listã
tr: Bu liste

source: Where are replies to list messages directed? <tt>Poster</tt> is <em>strongly</em> recommended for most mailing lists.
hr: Gdje su upuæeni odgovori na poruke? <tt>Po¹iljatelj</tt> se <em>veoma</em> preporuèa za veæinu mailing listi.
ro: Unde sunt trimise replicile la mesajele listei ? <tt>Expeditor</tt> este <em>recomandat</em> pentru majoritatea listelor de discuþii.
tr: Bu liste mesajlarýna cevaplar nereye yönlendirilecek? <tt>Gönderici</tt>, mesaj listeleri için <em>önemle</em> tavsiye edilir.

source: Explicit <tt>Reply-To:</tt> header.
hr: Eksplicitno <tt>Reply-To:</tt> zaglavlje.
ro: Headerul <tt>Reply-To</tt> explicit.
tr: Farklý <tt>Reply-To:</tt> baþlýðý.

source: Umbrella list settings
hr: Za¹titne postavke liste
ro: Setãrile listei umbrelã
tr: Kapsayýcý liste ayarlarý

source: Send password reminders to, eg, "-owner" address instead of directly to user.
hr: ©alji podsjetnike lozinke na npr. "-owner" adresu umjesto izravno korisniku.
ro: Trimit mesajele de reamintire a parolei la adresa "-owner" în loc sã le trimit direct la utilizator.
tr: Þifre hatýrlatýcýlarý doðrudan kullanýcýya göndermek yerine örneðin "-owner" adresine gönderilsin.

source: Set this to yes when this list is intended to cascade only to other mailing lists. When set, meta notices like confirmations and password reminders will be directed to an address derived from the member's address - it will have the value of "umbrella_member_suffix" appended to the member's account name.
hr: Postavite ovo na 'Da' onda kada je lista namijenjena prebacivanju na druge mailing liste. Postavljene meta obavijesti, kao ¹to su potvrde i podsjetnici lozinke, bit æe upuæene na adresu koja je izvedena iz èlanske adrese - imat æe vrijednost "èlan_pod_za¹titom_sufiks" dodan korisnièkom imenu èlana.
ro: Alegeþi 'da' pentru aceastã opþiune atunci când doriþi aceastâ listã sã transmitã doar mesaje în cascadã cãtre alte liste. Odatã setatã, meta-notificãrile, precum confirmãrile ºi mesajele de reamintire a parolei vor fi redirectate cãtre o adresã derivatã din adresa abonatului, având valorile "umbrella_member_suffix" adãugate la numele abonatului.
tr: Eðer bu liste baþka mesaj listelerini kapsayan bir liste ise bunu evet olarak ayarlayýn. Böyle ayarlandýðýnda onay veya þifre hatýrlatýcýlar gibi bildirimler üye adresinden türetilmiþ bir adrese gönderilir - bu durumda "umbrella_member_suffix" deðeri üyenin hesap adýnýn arkasýna eklenir.

source: Suffix for use when this list is an umbrella for other lists, according to setting of previous "umbrella_list" setting.
hr: Sufiks koji se koristi onda kada je ova lista za¹titna za druge liste, u skladu sa stanjem prethodne postavke "za¹titna_lista"
ro: Sufixul folosit atunci când aceastã listã este o umbrelã pentru alte liste conform parametrului anterior "umbrella_list".
tr: Bir önceki "umbrella_list" seçeneðine göre bu liste diðer listeler için bir kapsayýcý ise, kullanýlacak sonek.

source: When "umbrella_list" is set to indicate that this list has other mailing lists as members, then administrative notices like confirmations and password reminders need to not be sent to the member list addresses, but rather to the owner of those member lists. In that case, the value of this setting is appended to the member's account name for such notices. `-owner' is the typical choice. This setting has no effect when "umbrella_list" is "No".
hr: Kada je "za¹titna_lista" postavljena tako da pokazuje druge mailing liste kao svoje èlanove, administrativne obavijesti, kao ¹to su potvrde i podsjetnici lozinke, ne moraju biti poslani na adrese èlanova liste, nego èlanovima èlanskih listi. U tom sluèaju vrijednost ove postavke se dodaje korisnièkom imenu èlana za takve obavijesti. '-owner' je tipièan izbor. Ova postavka nema utjecaja kada je "za¹titna_lista" postavljena na "Ne".
ro: Când parametrul "umbrella_list" etse setat, indicând faptul cã aceastã lista are alte liste ca ºi membri, notificãrile administrative precum confirmãrile ºi notificãrile de reamintire a parolei nu trebuie sã fie trimise membrilor, ci mai degrabã proprietarilor acelor liste. În acest caz, valoarea acestui parametru este adãugatã la adresa de abonament a membrilor. '-owner' este opþiunea tipicã. Acestã opþiune nu are nici un efect dacã parametrul "umbrella_list" este setat pe "Nu".
tr: Bu listenin üyelerinin baþka listeler olduðunu gösteren "umbrella_list" ayarlýysa, onaylar veya þifre hatýrlatýcýlarý gibi üye adresine gönderilmemesi gereken yönetimsel bildirimler üye liste adresi yerine, o listenin sahibine gönderilir. Bu durumda, üye hesap adýnýn sonuna bu ayarýn deðeri eklenir. `-owner' tipik seçimdir. Eðer "umbrella_list" "Hayýr" ise bu ayarýn bir etkisi yoktur.

source: Send monthly password reminders?
hr: ©alji podsjetnike lozinke mjeseèno?
ro: Trimit mesaje lunare de reamintire a parolei?
tr: Aylýk þifre hatýrlatýcýlar gönderilsin mi?

source: Turn this on if you want password reminders to be sent once per month to your members. Note that members may disable their own individual password reminders.
hr: Ovo ukljuèite ako ¾elite da se podsjetnici lozinke ¹alju va¹im èlanovima mjeseèno. Primijetite da èlanovi mogu onemoguæiti svoje individulane podsjetnike lozinke.
ro: Activaþi aceastã opþiune dacã doriþi sã trimiteþi membrilor listei notificãri lunare de aducere aminte a parolei. Utilizatorii pot sã dezactiveze aceste individual notificãri.
tr: Üyelerinize ayda bir þifre hatýrlatýcýlarýnýn gönderilmesi için bunu açýn. Üyeler kendi þifre hatýrlatýcýlarýný devre dýþý býrakabilirler.
