Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Your subscription is not allowed because the email address you gave is insecure.
hr: Va¹a pretplata nije dozvoljena zbog toga ¹to navedena e-mail adresa nije sigurna.
ro: Abonarea dumneavoastrã nu este permisã deoarece adresa de email furnizatã nu este sigurã.
tr: Üyeliðinize izin verilmedi çünkü verdiðiniz e-posta adresi güvenli deðil.

source: You are already subscribed!
hr: Vi ste veæ pretplaæeni!
ro: Sunteþi deja abonat!
tr: Zaten üyesiniz!

source: No one can subscribe to the digest of this list!
hr: Nitko se ne mo¾e pretplatiti na digest poruke ove liste!
ro: Nimeni nu se poate abona la rezumatele zilnice ale acestei liste!
tr: Bu listeye toplu mesaj alýmý için üye olamazsýnýz!

source: This list only supports digest subscriptions!
hr: Ova lista podr¾ava samo digest pretplate!
ro: Aceastã listã suportã doar abonamente la rezumatele zilnice!
tr: Bu liste sadece toplu mesaj alýmýný desteklemektedir!

source: Your subscription request has been forwarded to the list administrator at %(listowner)s for review.
hr: Va¹ zahtjev za pretplatom proslijeðen je administratoru liste na %(listowner)s za pregled.
ro: Cererea dumneavoastrã de abonare a fost înaintatã administratorului listei la %(listowner)s pentru revizuire.
tr: Üyelik isteðiniz at %(listowner)s adresindeki liste yöneticisine inceleme için iletildi.

source: Subscription request succeeded.
hr: Zahtjev za pretplatom je uspje¹no proveden.
ro: Cererea de abonare a fost trimisã.
tr: Üyelik isteði baþarýlý.

source: unsubscribe [password] [address=<address>] Unsubscribe from the mailing list. If given, your password must match your current password. If omitted, a confirmation email will be sent to the unsubscribing address. If you wish to unsubscribe an address other than the address you sent this request from, you may specify `address=<address>' (no brackets around the email address, and no quotes!)
hr: unsubscribe [password] [address=<address>] Odjavite se s mailing liste. Unesena lozinka mora se podudarati s va¹om trenutnom lozinkom. U sluèaju da niste unijeli lozinku, potvrdni mail æe vam biti poslan na odjavnu adresu. Ako se ¾elite odjaviti s adresom koja je drugaèija od one s koje ste poslali ovaj zahtjev, mo¾ete specificirati `address=<address>' (bez zagrada oko mail adrese i bez navodnika!)
ro: unsubscribe [parola] [address=<adresa>]
tr: unsubscribe [þifre] [address=<adres] Bu, listeden çýkmanýzý saðlar. Eðer bir þifre verdiyseniz, þifreniz þu andaki þifrenizle eþleþmelidir. Eðer þifre vermediyseniz, listeden çýkarýlacak adrese bir onay e-postasý gönderilecektir. Bu formu gönderdiðiniz adres dýþýnda bir adresi listeden çýkarýyorsanýz, bu adresi `address=<adres>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) þeklinde belirtin.

source: %(address)s is not a member of the %(listname)s mailing list
hr: %(address)s nije èlan %(listname)s mailing liste
ro: %(address)s nu este abonatal listei de discuþii %(listname)s
tr: %(address)s, %(listname)s mesaj listesine üye deðil

source: Your unsubscription request has been forwarded to the list administrator for approval.
hr: Va¹ zahtjev za odjavom je prosljeðen administratoru liste na odobrenje.
ro: Cererea dumneavoastrã de pãrãsire a listei a fost înaintatã administratorului listei pentru aprobare.
tr: Üyelikten çýkma isteðiniz onaylama için liste yöneticisine iletildi.

source: You gave the wrong password
hr: Unjeli ste pogre¹nu lozinku
ro: Aþi scris o parolã greºitã
tr: Yanlýþ þifre verdiniz

source: Unsubscription request succeeded.
hr: Zahjtev za odjavom je uspje¹no proveden.
ro: Cererea de dezabonare a fost trimisã.
tr: Üyelikten çýkma isteði baþarýlý

source: who password See everyone who is on this mailing list. The roster is limited to list administrators and moderators only; you must supply the list admin or moderator password to retrieve the roster.
hr: who password Pogledajte tko je sve na ovoj mailing listi. Popis je dostupan samo administratorima liste i moderatorima; Da biste dobili popis morate unijeti lozinku za administratora ili moderatora .
ro: who parola Afiºeazã toþi membrii acestei liste. Accesul este limitat doar administratorilor ºi moderatorilor listei, astfel încât trebuie sã precizaþi parola de administrator sau moderator a listei pentru a putea obþine informaþia doritã.
tr: who password Bu mesaj listesine üye olan herkesi gösterir. Ýsim listesi sadece liste yöneticileri ve moderatörlere görünür durumda olduðu için liste yönetim veya moderatör þifresini vermeniz gereklidir.

source: You are not allowed to retrieve the list membership.
hr: Nije vam dozvoljen pregled liste èlanova.
ro: Nu vã este permisã afiºarea listei membrilor.
tr: Liste üyeliðine eriþme yetkiniz yok

source: This list has no members.
hr: Ova lista nema èlanova.
ro: Aceastã listã nu are membri.
tr: Bu listenin hiç üyesi yok

source: Non-digest (regular) members:
hr: Non-digest (regularni) èlanovi:
ro: Abonaþi normali (fãrã rezumate zilnice):
tr: Toplu mesaj almayan üyeler:

source: Digest members:
hr: Digest èlanovi:
ro: Membrii ce primesc doar rezumate zilnice:
tr: Toplu mesaj alan üyeler:

source: Catalan
hr: Katalanski
ro: Catalanã
tr: Katalonca

source: Czech
hr: Èe¹ki
ro: Cehã
tr: Çekçe

source: Danish
hr: Danski
ro: Danezã
tr: Danca

source: German
hr: Njemaèki
ro: Germanã
tr: Almanca

source: English (USA)
hr: Engleski (SAD)
ro: Englezã (USA)
tr: Ýngilizce (ABD)

source: Spanish (Spain)
hr: ©panjolski
ro: Spaniolã (Spania)
tr: Ýspanyolca (Ýspanya)

source: Estonian
hr: Estonski
ro: Estonã
tr: Estonyaca

source: Finnish
hr: Finski
ro: Finlandezã
tr: Fince

source: French
hr: Francuski
ro: Francezã
tr: Fransýzca

source: Croatian
hr: Hrvatski
ro: Croatã
tr: Hýrvatça

source: Hungarian
hr: Maðarski
ro: Maghiarã
tr: Macarca

source: Italian
hr: Talijanski
ro: Italianã
tr: Ýtalyanca

source: Japanese
hr: Japanski
ro: Japonezã
tr: Japonca

source: Korean
hr: Korejski
ro: Coreeanã
tr: Korece

source: Lithuanian
hr: Litvanski
ro: Lituanianã
tr: Litvanyaca

source: Dutch
hr: Nizozemski
ro: Olandezã
tr: Flemenkçe

source: Norwegian
hr: Norve¹ki
ro: Norvegianã
tr: Norveççe

source: Polish
hr: Poljski
ro: Polonezã
tr: Polonyaca

source: Portuguese
hr: Portugalski
ro: Portughezã
tr: Portekizce

source: Portuguese (Brazil)
hr: Portugalski (Brazil)
ro: Portughezã (Brazilia)
tr: Portekizce (Brezilya)

source: Romanian
hr: Rumunjski
ro: Românã
tr: Romanyaca

source: Russian
hr: Ruski
ro: Rusã
tr: Rusça

source: Slovenian
hr: Slovenski
ro: Slovenã
tr: Slovence

source: Serbian
hr: Srpski
ro: Sârbã
tr: Sýrpça

source: Swedish
hr: ©vedski
ro: Suedezã
tr: Ýsveççe

source: Turkish
ro: Turcã
tr: Türkçe

source: Ukrainian
hr: Ukrajinski
ro: Ucrainianã
tr: Ukraynaca

source: Chinese (China)
hr: Kineski (Kina)
ro: Chinezã (China)
tr: Çince (Çin)

source: Chinese (Taiwan)
hr: Kineski (Tajvan)
ro: Chinezã (Taiwan)
tr: Çince (Tayvan)

source: Note: Since this is a list of mailing lists, administrative notices like the password reminder will be sent to your membership administrative address, %(addr)s.
hr: Primjetite: Buduæi je ovo lista mailing lista, administrativne obavijesti kao ¹to je podsjetnik lozinke bit æe vam poslane na va¹u èlansku administrativnu adresu, %(addr)s.
ro: Notã: Devreme de aceasta este o listã de liste de discuþii, notele administrative precum reamintirea parolei vã va fi trimisã la adresa dumneavoastrã administrativã, %(addr)s.
tr: Not: Bu, mesaj listelerinin bir listesi olduðu için þifre hatýrlatýcý gibi yönetimsel bildirimler, üyelik yönetimsel adresiniz olan %(addr)s adresine gönderilecektir.

source: (Digest mode)
hr: (Digest mod)
ro: (Mod rezumat)
tr: (Toplu mod)

source: Welcome to the "%(realname)s" mailing list%(digmode)s
hr: Dobrodo¹li na "%(realname)s" mailing listu%(digmode)s
ro: Bun venit la lista de discuþii "%(realname)s" - list%(digmode)s
tr: "%(realname)s" mesaj listesine%(digmode)s hoþgeldiniz

source: You have been unsubscribed from the %(realname)s mailing list
hr: Odjavljeni ste sa %(realname)s mailing liste
ro: Aþi fost dezabonat de la lista de discuþii %(realname)s
tr: %(realname)s mesaj listesi üyeliðinden çýktýnýz

source: %(listfullname)s mailing list reminder
hr: %(listfullname)s podsjetnik mailing liste
ro: Mesaj de reamintire pentru lista de discuþii %(listfullname)s
tr: %(listfullname)s mesaj listesi hatýrlatýcýsý

source: No reason given
hr: Razlog nije dat
ro: Fãrã motiv
tr: Neden belirtilmedi

source: Hostile subscription attempt detected
hr: Detektiran je nedozvoljeni poku¹aj pretplate
ro: A fost detectatã o încercare de abonare ostilã
tr: Saldýrgan üyelik denemesi saptandý

source: %(address)s was invited to a different mailing list, but in a deliberate malicious attempt they tried to confirm the invitation to your list. We just thought you'd like to know. No further action by you is required.
hr: %(address)s je pozvana na drugu mailing listu, ali u namjernom malicioznom poku¹aju namjeravalo se potvrditi poziv na va¹u listu. Smatrali smo da ste ¾eljeli to znati. Sa va¹e strane nije potrebna nikakva daljnja akcija.
ro: %(address)s a fost invitat(ã) pe o altã listã, dar a încercat în mod deliberat ºi maliþios sã confirme invitaþia pentru lista dumneavoastrã. Am considerat cã trebuie sã ºtiþi asta, nefiind necesarã nici o altã intervenþie din partea dumneavoastrã.
tr: %(address)s adresi farklý bir mesaj listesine davet edilmiþti, ama kasti ve kötü niyetli bir deneme ile daveti sizin listenizde onaylamaya çalýþtýlar. Sadece bilmek istersiniz diye düþündük. Herhangi bir eylemde bulunmanýza gerek yok.

source: You invited %(address)s to your list, but in a deliberate malicious attempt, they tried to confirm the invitation to a different list. We just thought you'd like to know. No further action by you is required.
hr: Pozvali ste %(address)s na va¹u listu, ali u namjernom malicioznom poku¹aju, namjeravalo se potvrditi poziv na drugu listu. Smatrali smo da ste ¾eljeli to znati. Sa va¹e strane nije potrebna nikakva daljnja akcija.
ro: Aþi invitat %(address)s pe lista dumneavoastrã, dar printr-o tentativã deliberat maliþioasã, cineva a încercat sã confirme invitaþia pe o altã listã. Ne-am gândit cã poate doriþi sã ºtiþi asta, devreme ce nu este necesarã nici o acþiune suplimentarã din partea dumneavoastrã.
tr: %(address)s adresini listenize davet etmiþtiniz, ama kasti ve kötü niyetli bir deneme ile daveti baþka bir listede onaylamaya çalýþtýlar. Sadece bilmek istersiniz diye düþündük. Herhangi bir eylemde bulunmanýza gerek yok.

source: For some unknown reason
hr: Zbog nepoznatog razloga
ro: Din motive necunoscute
tr: Bilinmeyen bir nedenle

source: Your message was rejected
hr: Va¹a poruka je odbijena
ro: Mesajul dumneavoastrã a fost respins
tr: Mesajýnýz reddedildi

source: Archiving Options
hr: Opcije arhive
ro: Opþiuni de arhivare
tr: Arþivleme Seçenekleri

source: List traffic archival policies.
hr: Ureðenje prometa arhive liste
ro: Politicile de arhivare a traficului listei.
tr: Liste trafiði arþiv ilkeleri

source: Archive messages?
hr: Arhiviraj poruke?
ro: Arhivez mesajele?
tr: Mesajlar arþivlensin mi?

source: private
hr: privatno
ro: privat
tr: özel

source: Is archive file source for public or private archival?
hr: Je li izvorna datoteka arhive za javno ili privatno arhiviranje?
ro: Arhiva este publicã sau privatã?
tr: Arþiv dosyasý genel kullaným için mi yoksa özel kullaným için mi arþivlenecek?

source: Monthly
hr: Mjeseèno
ro: Lunar
tr: Aylýk

source: Quarterly
hr: Kvartalno
ro: Trimestrial
tr: 3 Aylýk

source: Yearly
hr: Godi¹nje
ro: Anual
tr: Yýllýk

source: Daily
hr: Dnevno
ro: Zilnic
tr: Günlük

source: Weekly
hr: Tjedno
ro: Sãptãmânal
tr: Haftalýk

source: How often should a new archive volume be started?
hr: Koliko èesto æe se pokrenuti nova arhiva?
ro: Cât de des vor fi create volumele din arhivã?
tr: Yeni bir arþiv ne kadar sürede bir baþlatýlsýn?

source: Auto-responder characteristics.<p> In the text fields below, string interpolation is performed with the following key/value substitutions: <p><ul> <li><b>listname</b> - <em>gets the name of the mailing list</em> <li><b>listurl</b> - <em>gets the list's listinfo URL</em> <li><b>requestemail</b> - <em>gets the list's -request address</em> <li><b>owneremail</b> - <em>gets the list's -owner address</em> </ul> <p>For each text field, you can either enter the text directly into the text box, or you can specify a file on your local system to upload as the text.
hr: Karakteristike automatskog odgovora.<p> U donjim poljima umetanje teksta obavlja se sa sljedeæim kljuè/vrijednost zamjenama: <p><ul> <li><b>listname</b> - <em>dobavlja naziv mailing liste</em> <li><b>listurl</b> - <em>dobavlja URL stranice sa informacijama</em> <li><b>requestemail</b> - <em>dobavlja -request adresu liste</em> <li><b>owneremail</b> - <em>dobavlja -owner adresu</em> </ul> <p>Za svako tekstualno polje mo¾ete ili izravno unijeti tekst u isto ili mo¾ete specificirati datoteku na svom lokalnom sistemu, koju æete uploadati kao tekst.
ro: Caracteristicile auto-responder-ului<p> În câmpurile de mai jos, interpolarea ºirurilor de caractere se face prin substituirea urmãtoarelor perechi cheie/valoare: <p><ul> <li><b>listname</b> - <em>este numele listei de discuþii</em> <li><b>listurl</b> - <em>este adresa URL a paginii de informaþii despre listã</em> <li><b>requestemail</b> - <em>este adresa -request a listei</em> <li><b>owneremail</b> - <em>este adresa -owner a listei</em> </ul> <p>pentru fiecare câmp text, puteþi introduce direct textul în câmpul aferent, sau puteþi specifica un fiºier local ce va fi trimis ca ºi text.
tr: Otomatik yanýtlayýcý özellikleri.<p> Aþaðýdaki yazý alanlarýnda dizgi deðiþimi þu anahtar/deðer yerleþtirmeleri ile yapýlýr: <p><ul> <li><b>listname</b> - <em>mesaj listesinin ismini alýr</em> <li><b>listurl</b> - <em>listenin listinfo URL'sini alýr</em> <li><b>requestemail</b> - <em>listenin -request (istek) adresini alýr</em> <li><b>owneremail</b> - <em>listenin -owner (sahip) adresini alýr</em> </ul> <p>Her bir yazý alaný için, ya yazýyý doðrudan yazý kutusuna yazabilirsiniz, ya da yerel sisteminizden bir dosyayý yazý olarak göndermek için seçebilirsiniz.

source: Should Mailman send an auto-response to mailing list posters?
hr: Treba li Mailman slati automatski odgovor po¹iljateljima s mailing liste?
ro: Sã trimitã Mailman un rãspuns automat la expeditori?
tr: Mailman mesaj listesi göndericilerine bir otomatik yanýt göndersin mi?

source: Auto-response text to send to mailing list posters.
hr: Tekst automatskog odgovora koji æe se slati po¹iljateljima poruka.
ro: Textul automat de rãspuns ce va fi trimis expeditorilor listei.
tr: Mesaj listesi göndericilerine gönderilecek otomatik yanýt.

source: Should Mailman send an auto-response to emails sent to the -owner address?
hr: Treba li Mailman slati automatski odgovor na e-mailove poslane na -owner adresu?
ro: Sã trimitã Mailamn un rãspuns automat la mesajele trimise cãtre adresa -owner ?
tr: Mailman -owner adresine gönderilen e-postalara bir otomatik yanýt göndersin mi?

source: Auto-response text to send to -owner emails.
hr: Tekst automatskog odgovora koji æe se slati na -owner adresu.
ro: Rãspunsul automat returnat emailurilor trimise la adresa -owner.
tr: -owner e-postalarýna gönderilecek otomatik yanýt.

source: Yes, w/discard
hr: Da, w/odbaci
ro: Da, cu rejectare
tr: Evet ve gözardý et

source: Yes, w/forward
hr: Da, w/proslijedi
ro: Da, cu forward
tr: Evet ve ilet

source: Should Mailman send an auto-response to emails sent to the -request address? If you choose yes, decide whether you want Mailman to discard the original email, or forward it on to the system as a normal mail command.
hr: Treba li Mailman slati automatski odgovor na emailove poslane na -request adresu? Ako izaberete da, odluèite ¾elite li da Mailman odbaci izvorni e-mail ili da ga proslijedi sistemu kao normalnu mail komandu.
ro: Sã trimitã Mailman un rãspuns automat la emailurile trimise cãtre adresa -request? Dacã da, veþi decide dacã Mailman va ignora mesajul original, sau îl va înainta sistemului ca ºi comandã mail normalã.
tr: Mailman, -request adresine gönderilen e-postalara bir otomatik yanýt göndersin mi? Eðer evet'i seçerseniz, Mailman'in özgün mesajý gözardý mý edeceðine, yoksa sisteme normal bir mesaj komutu olarak mý ileteceðine karar verin.

source: Auto-response text to send to -request emails.
hr: Tekst automatskog odgovora koji æe biti poslan na -request e-mailove.
ro: Rãspunsul automat de trimis celor ce trimit mesaje la adresa -request.
tr: -response e-postalarýna gönderilecek otomatik yanýt.

source: Bounce processing
hr: Obraðivanje odbijenih poruka
ro: Procesarea eºecurilor de livrare (bounces)
tr: Geri Dönüþ Ýþleme

source: Bounce detection sensitivity
hr: Osjetljivost detektiranja odbijenih poruka
ro: Sensibilitatea detectorului de eºecuri (bounces)
tr: Geri dönüþ algýlama duyarlýlýðý

source: Should Mailman perform automatic bounce processing?
hr: Treba li Mailman automatski provoditi procesiranje odbijenih poruka?
ro: Sã asigure Mailman procesarea automatã a eºecurilor (bounces) de livrare?
tr: Mailman otomatik geri dönüþ iþlemesi yapsýn mý?

source: By setting this value to <em>No</em>, you disable all automatic bounce processing for this list, however bounce messages will still be discarded so that the list administrator isn't inundated with them.
hr: Postavljanjem ove vrijednosti na <em>Ne</em>, onemoguæujete automatsko procesiranje odbijenih poruka za ovu listu. Meðutim odbijene poruke æe i dalje biti odbaèene tako da administrator liste nije njima preplavljen.
ro: Setând aceastã valoare la <em>No</em>, veþi dezactiva toate procesãrile automate ale eºecurilor de livrare ale acestei listeº totuºi, mesajele nelivrate vor fi în continuare ignorate, astfel încât administratorul listei nu va fi inundat de acestea.
tr: Bu deðeri <em>Hayýr</em> olarak ayarlayarak, bu liste için otomatik geri dönüþ iþlemeyi devre dýþý býrakabilirsiniz, ancak geri dönen mesajlar yöneticileri uðraþtýrmamalarý için yine de gözardý edilecektir.

source: The maximum member bounce score before the member's subscription is disabled. This value can be a floating point number.
hr: Maksimalna vrijednost brojaèa odbijenih poruka prije nego je pretplata onemoguæena. Ova vrijednost mo¾e biti decimalni broj.
ro: Scorul maxim de eºec pentru membrul abonat, peste care abonamentul este dezactivat. Aceastã valoare poate fi un numãr real.
tr: Bir üyenin üyeliðinin devre dýþý kalmasý için ulaþýlacak en fazla geri dönüþ puaný. Bu deðer, tamsayý olmak zorunda deðildir.

source: Each subscriber is assigned a bounce score, as a floating point number. Whenever Mailman receives a bounce from a list member, that member's score is incremented. Hard bounces (fatal errors) increase the score by 1, while soft bounces (temporary errors) increase the score by 0.5. Only one bounce per day counts against a member's score, so even if 10 bounces are received for a member on the same day, their score will increase by just 1. This variable describes the upper limit for a member's bounce score, above which they are automatically disabled, but not removed from the mailing list.
ro: Fiecare abonat are asignat un scor al eºecurilor, ca un numãr real. Ori de câte ori Mailman primeºte o notificare de eºec de livrare, scorul abonatului creºte. Erorile fatale (hard bounces) cresc scorul cu 1 punct, în timp ce erorile temporare (soft bounces) incrementeazã scorul cu 0.5 puncte. Scorul eºecurilor este modificat doar o singurã datã pe zi, aºa cã ºi în cazul a 10 eºecuri fatale într-o zi, scorul va fi incrementat doar cu un punct. Aceastã variabilã descrie limita superioarã a scorului eºecurilor de livrare, peste care abonatul este automat dezactivat, dar nu dezabonat de la lista de discuþii.

source: The number of days after which a member's bounce information is discarded, if no new bounces have been received in the interim. This value must be an integer.
hr: Broj dana poslije kojih su informacije o odbijanju odbaèene za pojedinog èlana i to u sluèaju da nisu primljene nove odbijene poruke. Ova vrijednost mora biti cijeli broj.
ro: Numãrul de zile dupã care informaþiile relative la eºecurile de livrare (bounces) pentru un membru sunt ignorate, dacã nu au mai apãrut altele noi între timp. Aceastã valoare trebuie sã fie un întreg.
tr: Bir üyeden, geri dönüþ alýnmamasý sonucunda geri dönüþ bilgisinin gözardý edilmesi için geçmesi gereken gün sayýsý. Bu deðer bir tamsayý olmalýdýr.

source: How many <em>Your Membership Is Disabled</em> warnings a disabled member should get before their address is removed from the mailing list. Set to 0 to immediately remove an address from the list once their bounce score exceeds the threshold. This value must be an integer.
hr: Koliko upozorenja <em>Va¹e èlanstvo je onemoguæeno</em> treba primiti onemoguæeni èlan prije nego ¹to je njegova adresa uklonjena s mailing liste. Upi¹ite ovdje 0 da biste odmah uklonili adresu s liste onda kada njegov brojaè odbijenih poruka prema¹i dozvoljenu vrijednost. Ova vrijednost mora biti cijeli broj.
ro: Câte alerte de genul <em>Abonamentul dumneavoastrã este dezactivat</em> sã primeascã un abonat înainte ca adresa lui sã fie automat ºtearsã din lista de discuþii. Puneþi valoarea 0 pentru a ºterge adresa imediat ce pragul limitã al eºecurilor este depãºit. Aceastã valoare trebuie sã fie întreagã.
tr: Üyenin, üyeliði silinmeden önce kaç tane <em>Üyeliðiniz Devre Dýþý</em> mesajý alacaðý. Üyenin geri dönüþ puaný eþiði geçtiði anda listeden silinmesi için bunu 0 olarak ayarlayýn. Bu deðer bir tamsayý olmalýdýr.

source: The number of days between sending the <em>Your Membership Is Disabled</em> warnings. This value must be an integer.
hr: Broj dana izmeðu slanja <em>Va¹e èlanstvo je onemoguæeno </em> upozorenja. Ova vrijednost mora biti cijeli broj.
ro: Numãrul de zile dintre avertismentele <em>Abonamentul dumneavoastrã este dezactivat</em>. Trebuie sã fie o valoare întreagã.
tr: <em>Üyeliðiniz Devre Dýþý</em> mesajlarýnýn gönderileceði gün sýklýðý. Bu deðer bir tamsayý olmalýdýr.

source: Notifications
hr: Obavijesti
ro: Notificãri
tr: Bildirimler

source: Should Mailman send you, the list owner, any bounce messages that failed to be detected by the bounce processor? <em>Yes</em> is recommended.
hr: Treba li vam kao vlasniku liste Mailman slati poruke o odbijanju koje nije uspio detektirati procesor odbijenih poruka? <em>Da</em> se preporuèuje.
ro: Sã trimitã Mailman cãtre dumneavoastrã, proprietarul listei, orice mesaje de eºec ce nu au fost detectate de procesorul de alerte (bounce processor)? <em>Da</em> este recomandat.
tr: Mailman size, liste sahibine geri dönüþ iþleyici tarafýndan algýlanamayan mesajlarý göndersin mi? <em>Evet</em> seçeneði önerilir.
