Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Invalid confirmation string. Note that confirmation strings expire approximately %(days)s days after the initial subscription request. If your confirmation has expired, please try to re-submit your original request or message.
hr: Pogre¹an potvrdni tekst. Primijetite da potvrdni tekst istièe otprilike %(days)s dana poslije poèetnog zahtjeva za pretplatom. Ako je va¹a potvrda istekla, poku¹ajte ponovno poslati svoj izvorni zahtjev ili poruku.
ro: Cod de confirmare invalid. Luaþi aminte cã aceste coduri de confirmare expirã dupã aproximativ %(days)s days de la cererea iniþialã de abonare. Dacã v-a expirat codul de confirmare încercaþi sã retrimiteþi cererea originalã de abonare.
tr: Geçersiz onay dizgisi. Onay dizgilerinin süresi ilk üyelik isteðinden yaklaþýk %(days)s gün sonra dolar. Eðer onay süreniz dolduysa, lütfen üyeliðinizi tekrar yapmayý deneyiniz.

source: Your request has been forwarded to the list moderator for approval.
hr: Va¹ zahtjev je proslijeðen moderatoru liste na odobrenje.
ro: Cererea dumneavoastrã a fost înaintatã moderatorului listei pentru aprobare.
tr: Ýsteðiniz, onay için liste moderatörüne iletildi.

source: You are not currently a member. Have you already unsubscribed or changed your email address?
hr: Vi trenutno niste èlan. Da li ste veæ odjavljeni ili ste promijenili svoju e-mail adresu?
ro: ÃŽn prezent nu sunteþi un membru al acestei liste. V-aþi dezabonat deja sau v-aþi schimbat cumva adresa de email?
tr: Þu anda üye deðilsiniz. Listeden çýktýnýz mý veya e-posta adresinizi deðiþtirdiniz mi?

source: You were not invited to this mailing list. The invitation has been discarded, and both list administrators have been alerted.
hr: Vi niste bili pozvani na ovu mailing listu. Poziv je odbaèen, a oba administratora liste su obavije¹tena.
ro: Nu aþi fost invitat pe aceastã listã de discuþii. Invitaþia a fost anulatã, iar administratorii listei au fost alertaþi.
tr: Bu listeye davet edilmemiþtiniz. Davet gözardý edildi ve liste yöneticilerine uyarý gönderildi.

source: Bad approval password given. Held message is still being held.
hr: Upisana je pogre¹na potvrdna lozinka. Zadr¾ana poruka je i dalje zadr¾ana.
ro: Parolã de aprobare eronatã. Mesajul blocate este reþinut în continuare.
tr: Kötü onay þifresi verildi. Mesaj hala bekletiliyor.

source: Confirmation succeeded
hr: Potvrda je uspjela
ro: Confirmarea a avut loc
tr: Onay baþarýlý oldu.

source: echo [args] Simply echo an acknowledgement. Args are echoed back unchanged.
hr: echo [args] Jednostavno ispi¹i potvrdu. Argumenti su vraæeni nepromijenjeni.
ro: echo [args] Pur ºi simplu returneazã o confirmare. Argumentele [args] sunt returnate fãrã nici o modificare.
tr: echo [args] Basitçe bir ek bilgiyi yankýlar. Args deðiþmeden geri yankýlanýr.

source: end Stop processing commands. Use this if your mail program automatically adds a signature file.
hr: end Zaustavi procesiranje komandi. Ovo koristite ako va¹ mail program automatski dodaje datoteku s potpisom.
ro: end Opreºte procesarea comenzilor. Folosiþi asta în cazul în care programul dumneavoastrã de email adaugã automat un fiºier de semnãturã.
tr: end Komut iþlenmesini durdurur. Bunu eðer posta programýnýz otomatik olarak bir imza dosyasý ekliyorsa kullanýn.

source: help Print this help message.
hr: help Ispi¹i ovu pomoæ.
ro: ajutor Tipãreºte acest mesaj de ajutor.
tr: help Bu yardým mesajýný yazdýrýr.

source: You can access your personal options via the following url:
hr: Va¹im opcijama mo¾ete pristupiti preko sljedeæeg urla:
ro: Puteþi accesa opþiunile personale la urmãtoarea adresã URL:
tr: Kiþisel seçeneklerinize þu url'den ulaþabilirsiniz:

source: info Get information about this mailing list.
hr: info Informacije o ovoj mailing listi.
ro: info Obþineþi informaþii despre aceastã listã de discuþii.
tr: info Bu mesaj listesi ile ilgili bilgi alýr.

source: List name: %(listname)s
hr: Naziv liste: %(listname)s
ro: Numele listei: %(listname)s
tr: Liste ismi: %(listname)s

source: Description: %(description)s
hr: Opis: %(description)s
ro: Descriere: %(description)s
tr: Taným: %(description)s

source: Postings to: %(postaddr)s
hr: Slanje poruka na: %(postaddr)s
ro: Publicarea la: %(postaddr)s
tr: Mesajlarýn gideceði adres: %(postaddr)s

source: List Helpbot: %(requestaddr)s
hr: Pomoæni robot liste: %(requestaddr)s
ro: Robotul de ajutor: %(requestaddr)
tr: Liste Yardým Robotu: %(requestaddr)s

source: List Owners: %(owneraddr)s
hr: Vlasnici Liste: %(owneraddr)s
ro: Proprietarii listei: %(owneraddr)s
tr: Liste Sahipleri: %(owneraddr)s

source: More information: %(listurl)s
hr: Vi¹e informacija: %(listurl)s
ro: Mai multe informaþii: %(listurl)s
tr: Ek bilgi: %(listurl)s

source: The `join' command is synonymous with `subscribe'.
hr: `join' komanda je sinonim za `subscribe'.
ro: Comanda 'join' este sinonimã cu
tr: `join' komutu, `subscribe' ile eþanlamlýdýr.

source: The `leave' command is synonymous with `unsubscribe'.
hr: `leave' komanda je sinonim za `unsubscribe'.
ro: Comanda 'leave' este sinonimã cu 'unsubscribe'.
tr: `leave' komutu, `unsubscribe' ile eþanlamlýdýr.

source: lists See a list of the public mailing lists on this GNU Mailman server.
hr: lists Pogledaj listu javnih mailing lista na ovom GNU Mailman serveru.
ro: lists Afiºeazã o listã cu toate listele de discuþii publice de pe acest server GNU Mailman.
tr: lists Bu GNU Mailman sunucusundaki genel mesaj listesinin bir listesini gösterir.

source: Public mailing lists at %(hostname)s:
hr: Javne mailing liste na %(hostname)s:
ro: Listele de discuþii publice de la %(hostname)s:
tr: %(hostname)s üzerindeki genel mesaj listeleri:

source: %(i)3d. List name: %(realname)s
hr: %(i)3d. Naziv liste: %(realname)s
ro: %(i)3d. Numele listei: %(realname)s
tr: %(i)3d. Liste ismi: %(realname)s

source: Description: %(description)s
hr: Opis: %(description)s
ro: Descriere: %(description)s
tr: Taným: %(description)s

source: Requests to: %(requestaddr)s
hr: Zahtjevi na: %(requestaddr)s
ro: Cererile se trimit la: %(requestaddr)s
tr: Ýsteklerin gideceði adres: %(requestaddr)s

source: password [<oldpassword> <newpassword>] [address=<address>] Retrieve or change your password. With no arguments, this returns your current password. With arguments <oldpassword> and <newpassword> you can change your password. If you're posting from an address other than your membership address, specify your membership address with `address=<address>' (no brackets around the email address, and no quotes!). Note that in this case the response is always sent to the subscribed address.
hr: password [<oldpassword> <newpassword>] [address=<address>] Dobavi ili promjeni lozinku. Bez argumenata, ovo vraæa va¹u trenutnu lozinku. S argumentima <oldpassword> i <newpassword> mo¾ete promjeniti svoju lozinku. Ako ¹aljete poruke sa adrese koja je drugaèija od va¹e èlanske adrese, specificirajte svoju èlansku adresu s `address=<address>' (bez zagrada oko e-mail adrese, i bez navodnika!). Primijetite da je u ovom sluèaju odgovor uvijek poslan na pretplatnièku adresu.
ro: password [<parolaveche> <parolanoua>] [address=<adresaabonata>] Afiºeazã sau modificã parola dumneavoastrã. Fãrã argumente, va returna parola dumneavoastrã curentã. Folosind argumentele <parolaveche> ºi <parolanoua> puteþi schimba parola dumneavoastrã. dacã trimiteþi aceastã cerere de la o adresã alta decât cea de abonament, specificaþi adresa abonatã cu parametrul 'address=<adresaabonata>' (fãrã paranteze la adresaabonata ºi fãrã ghilimele!). Notaþi cã în acest caz, rãspunsul este întotdeauna trimis la adresa de abonament.
tr: password [<eskiþifre> <yeniþifre>] [address=<adres>] Þifrenizi alýr veya deðiþtirir. Herhangi bir argüman yoksa, þu andaki þifrenizi döndürür. <eskiþifre> ve <yeniþifre> argümanlarýyla þifrenizi deðiþtirebilirsiniz. Eðer üyelik adresiniz dýþýnda bir adresten mesaj gönderiyorsanýz, üyelik adresinizi `address=<address>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) olarak belirtin. Bu durumda yanýtýn her zaman üye olan adrese gideceðini unutmayýn.

source: Your password is: %(password)s
hr: Va¹a lozinka je: %(password)s
ro: Parola dumneavoastrã este: %(password)s
tr: Þifreniz: %(password)s

source: You are not a member of the %(listname)s mailing list
hr: Vi niste èlan %(listname)s mailing liste
ro: Nu sunteþi un membru al listei de discuþii %(listname)s
tr: %(listname)s mesaj listesine üye deðilsiniz

source: You did not give the correct old password, so your password has not been changed. Use the no argument version of the password command to retrieve your current password, then try again.
hr: Niste ispravno upisali staru lozinku, tako da va¹a lozinka nije promijenjena. Da biste primili va¹u trenutnu lozinku koristite komandu password bez argumenata, pa poku¹ajte ponovo.
ro: Nu aþi introdus corect vechea parolã, aºa cã parola dumneavoastrã nu a fost schimbatã. Folosiþi versiunea de comandã fãrã argumente pentru a obþine parola curentã, ºi apoi încercaþi din nou.
tr: Doðru eski þifreyi vermediniz, bu yüzden þifreniz deðiþtirilmedi. password komutunu argümansýz olarak kullanarak þu andaki þifrenizi alýn, sonra tekrar deneyin.

source: Usage:
hr: Kori¹tenje:
ro: Folosire:
tr: Kullaným:

source: The `remove' command is synonymous with `unsubscribe'.
hr: `remove' komanda je sinonim za `unsubscribe'.
ro: Comanda 'remove' este sinonimã cu 'unsubscribe'.
tr: `remove' komutu, `unsubscribe' ile eþanlamlýdýr.

source: set ... Set or view your membership options. Use `set help' (without the quotes) to get a more detailed list of the options you can change. Use `set show' (without the quotes) to view your current option settings.
hr: set ... Postavite ili pogledajte svoje èlanske opcije. Koristite `set help' (bez navodnika) da biste dobili detaljnju listu opcija koje mo¾ete promijeniti. Koristite `set show' (bez navodnika) da biste pogledali svoje trenutno stanje postavki.
ro: set ... Seteazã sau afiºeazã opþiunile dumneavoastrã de abonament. Folosiþi 'set help' (fãrã ghilimele) pentru a obþine o listã mai detaliatã a opþiunilor pe care le puteþi modifica. Folosiþi 'set show' (fãrã ghilimele) pentru a afiºa opþiunile curente.
tr: set ... Üyelik seçeneklerinizi ayarlar veya görüntüler. Deðiþtirebileceðiniz seçeneklerin daha ayrýntýlý bir listesini almak için `set help' (týrnaklar olmaksýzýn) komutunu kullanýn. Þu andaki seçenek ayarlarýnýzý görmek için `set show' (týrnaklar olmaksýzýn) komutunu kullanýn.

source: set help Show this detailed help. set show [address=<address>] View your current option settings. If you're posting from an address other than your membership address, specify your membership address with `address=<address>' (no brackets around the email address, and no quotes!). set authenticate <password> [address=<address>] To set any of your options, you must include this command first, along with your membership password. If you're posting from an address other than your membership address, specify your membership address with `address=<address>' (no brackets around the email address, and no quotes!). set ack on set ack off When the `ack' option is turned on, you will receive an acknowledgement message whenever you post a message to the list. set digest plain set digest mime set digest off When the `digest' option is turned off, you will receive postings immediately when they are posted. Use `set digest plain' if instead you want to receive postings bundled into a plain text digest (i.e. RFC 1153 digest). Use `set digest mime' if instead you want to receive postings bundled together into a MIME digest. set delivery on set delivery off Turn delivery on or off. This does not unsubscribe you, but instead tells Mailman not to deliver messages to you for now. This is useful if you're going on vacation. Be sure to use `set delivery on' when you return from vacation! set myposts on set myposts off Use `set myposts off' to not receive copies of messages you post to the list. This has no effect if you're receiving digests. set hide on set hide off Use `set hide on' to conceal your email address when people request the membership list. set duplicates on set duplicates off Use `set duplicates off' if you want Mailman to not send you messages if your address is explicitly mentioned in the To: or Cc: fields of the message. This can reduce the number of duplicate postings you will receive. set reminders on set reminders off Use `set reminders off' if you want to disable the monthly password reminder for this mailing list.
hr: set help Prika¾i ovu detaljnu pomoæ. set show [address=<address>] Pogledajte trenutno stanje svojih postavki. Ako ¹aljete poruke s adrese koja je drugaèija od va¹e èlanske adrese, specificirajte èlansku adresu s `address=<address>' (bez zagrada oko e-maila, i bez navodnika! set authenticate <password> [address=<address>] Da biste postavili bilo koju opciju, morate prvo upisati ovu komandu zajedno sa svojom èlanskom lozinkom. Ako ¹aljete poruke s adrese koja je drugaèija od va¹e èlanske adrese, specificirajte svoju èlansku adresu s `address=<address>' (bez zagrada oko e-mail adrese, i bez navodnika!). Primijetite da je u ovom sluèaju odgovor uvijek poslan na pretplatnièku adresu. set ack on set ack off Kada je opcija `ack' ukljuèena, primit æete poruku s potvrdom uvijek kad po¹aljete poruku na listu. set digest plain set digest mime set digest off Kada je `digest' opcija iskljuèena, primit æete poruke èim one budu poslane. Koristite `set digest plain' ako ¾elite primati poruke umotane u obièan tekstualni digest (npr. RFC 1153 digest) Koristite `set digest mime' ako ¾elite primati poruke umotane zajedno u MIME digest. set delivery on set delivery off Ukljuèi ili iskljuèi dostavu. Ovo vas neæe odjaviti, nego samo kazuje Mailmanu da vam za sada ne dostavlja poruke. Navedeno je korisno ako idete na godi¹nji odmor. Budite sigurni da koristite `set delivery on' kada se vratite s odmora! set myposts on set myposts off Koristite `set myposts off' da ne primate kopije poruka koje po¹aljete na listu. Ovo nema uèinka ako primate digest poruke. set hide on set hide off Koristite `set hide on' da biste sakrili svoju e-mail adresu kada ljudi pregledavaju èlansku listu. set duplicates on set duplicates off Koristite `set duplicates off' ako ne ¾elite da vam Mailman ¹alje poruke koje sadr¾e va¹u adresu u poljima To: ili Cc: Ovo mo¾e smanjiti broj duplih poruka koje æete primiti. set reminders on set reminders off Koristite `set reminders off' ako ¾elite onemoguæiti mjeseèni podsjetnik lozinke za ovu mailing listu.
ro: set help afiºeazã acest text de ajutor. set show [address=<adresa>] afiºeazã opþiunile dumneavoastrã curente. Dacã trimiteþi comanda de la o altã adresã decât cea abonatã, specificaþi adresa de abonament folosind parametrul 'address=<adresa>' (fãrã ghilimele ºi fãrã paranteze ascuþite!) set authenticate <parola> [address=<adresa>] pentru a face orice modificãri, trebuie sã includeþi mai întâi acestã comandã împreunã cu parola dumneavoastrã de acces. Dacã trimiteþi comanda de la o altã adresã decât cea abonatã, specificaþi adresa de abonament folosind parametrul 'address=<adresa>' (fãrã ghilimele ºi fãrã paranteze ascuþite!) set ack on set ack off
tr: set help Ayrýntýlý yardýmý gösterir. set show [address=<adres>] Þu andaki seçenek ayarlarýnýzý gösterir. Üyelik adresiniz dýþýnda bir adresten bu komutu gönderiyorsanýz, üyelik adresinizi `address=<adres>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) þeklinde belirtin. set authenticate <þifre> [address=<adres>] Ayarlarýnýzdan herhangi birini deðiþtirmek için önce bu komutu, üyelik þifrenizle beraber yazmanýz gerekir. Üyelik adresiniz dýþýnda bir adresten bu komutu gönderiyorsanýz, üyelik adresinizi `address=<adres>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) þeklinde belirtin. set ack on set ack off `ack' (bilgi) seçeneði açýk olduðunda listeye bir mesaj gönderdiðiniz zaman bir bilgilendirme mesajý alýrsýnýz. set digest plain set digest mime set digest off `digest' (toplu) seçeneði kapalý olduðunda mesajlar gönderildiði an alýrsýnýz. Gönderilen mesajlarý düz yazý ve toplu olarak almak istiyorsanýz (yani RFC 1153 toplu) `set digest plain' komutunu kullanýn. MIME toplu mesajlar istiyorsanýz `set digest mime' komutunu kullanýn. set delivery on set delivery off Size gönderimi açýp kapatýr. Bu, sizi listeden çýkarmaz ama Mailman'in þimdilik size mesaj göndermemesini saðlar. Tatile çýktýðýnýzda çok yararlý bir ayardýr. Tatilden döndüðünüzde `set delivery on' komutunu kullanarak tekrar mesaj almaya baþlamayý unutmayýn! set myposts on set myposts off `set myposts off' komutu ile listeye kendi gönderdiðiniz mesajlarý almazsýnýz. Eðer toplu mesaj alýyorsanýz bu ayarýn bir etkisi yoktur set hide on set hide off `set hide on' komutu ile kiþiler üyelik listesini istediðinde adresinizin gizlenmesini saðlayabilirsiniz. set duplicates on set duplicates off Alýcý veya Cc: alanýnda adresiniz ayrýca belirtildiyse Mailman'in size bu mesajlarý göndermemesini saðlamak için `set duplicates off' komutunu kullanabilirsiniz. Bu þekilde aldýðýnýz kopya mesajlarýn sayýsý azalabilir. set reminders on set reminders off Bu mesaj listesi için aylýk þifre hatýrlatýcýlarý devre dýþý býrakmak için `set reminders off' komutunu kullanýn.

source: Bad set command: %(subcmd)s
hr: Krivo postavljena komanda: %(subcmd)s
ro: Set de comenzi eronate: %(subcmd)s
tr: Kötü set komutu: %(subcmd)s

source: Your current option settings:
hr: Va¹e trenutne postavke:
ro: Opþiunile dumneavoastrã actuale:
tr: Þu andaki seçenek ayarlarýnýz:

source: off
hr: iskljuèeno
ro: anulat(ã)

source: on
hr: ukljuèeno
ro: activat(ã)

source: digest plain
hr: obièan digest
ro: volum de rezumate

source: digest mime
hr: mime digest
ro: rezumat mime

source: digest off
hr: digest iskljuèen
ro: rezumat dezactivat

source: delivery on
hr: dostava ukljuèena
ro: livrare activatã

source: delivery off
hr: dostava iskljuèena
ro: livrare dezactivatã

source: by you
hr: od vas
ro: de cãtre dumneavoastrã
tr: sizin tarafýnýzdan

source: by the admin
hr: od strane administratora
ro: de cãtre administrator
tr: yönetici tarafýndan

source: due to bounces
hr: zbog odbijanja
ro: datoritã eºecurilor de livrare
tr: geri dönmeler sonucunda

source: %(status)s (%(how)s on %(date)s)
hr: %(status)s (%(how)s na %(date)s)
ro: %(status)s (%(how)s la %(date)s)

source: hide %(onoff)s
hr: sakrij %(onoff)s
ro: ascunde %(onoff)s

source: You did not give the correct password
hr: Niste unjeli toènu lozinku
ro: Nu aþi furnizat parola corectã
tr: Doðru þifreyi vermediniz

source: Bad argument: %(arg)s
hr: Krivi argument: %(arg)s
ro: Argument eronat: %(arg)s
tr: Kötü argüman: %(arg)s

source: Not authenticated
hr: Niste autenticirani
ro: Neautentificat
tr: Yetkilendirme baþarýsýz

source: ack option set
hr: ack opcija postavljena
ro: opþiunea ack a fost setatã
tr: ack seçeneði ayarlandý

source: digest option set
hr: digest opcija postavljena
ro: opþiunea de rezumat a fost setatã
tr: digest seçeneði ayarlandý

source: delivery enabled
hr: dostava ukljuèena
ro: livrare activatã
tr: gönderim etkinleþtirildi

source: delivery disabled by user
hr: korisnik je onemoguæio dostavu
ro: livrare dezactivatã de utilizator
tr: gönderim kullanýcý tarafýndan devre dýþý býrakýldý

source: myposts option set
hr: opcija moje poruke postavljena
ro: opþiunea myposts a fost setatã
tr: myposts seçeneði ayarlandý

source: hide option set
hr: opcija sakrij postavljena
ro: opþiunea hide a fost setatã
tr: hide seçeneði ayarlandý

source: duplicates option set
hr: opcija duplikati postavljena
ro: opþiunea duplicates a fost setatã
tr: duplicates seçeneði ayarlandý

source: reminder option set
hr: opcija podsjetnik postavljena
ro: opþiunea reminder a fost setatã
tr: reminder seçeneði ayarlandý

source: stop is synonymous with the end command.
hr: stop je sinonim za end komandu.
ro: stop este comandã sinonimã cu end.
tr: stop, end komutu ile eþanlamlýdýr.

source: subscribe [password] [digest|nodigest] [address=<address>] Subscribe to this mailing list. Your password must be given to unsubscribe or change your options, but if you omit the password, one will be generated for you. You may be periodically reminded of your password. The next argument may be either: `nodigest' or `digest' (no quotes!). If you wish to subscribe an address other than the address you sent this request from, you may specify `address=<address>' (no brackets around the email address, and no quotes!)
hr: subscribe [password] [digest|nodigest] [address=<address>] Pretplatite se na ovu mailing listu. Da biste mogli biti odjavljeni ili da biste mogli mijenjati va¹e postavke, morate upisati lozinku, a ukoliko je izostavite, lozinka æe vam biti generirana. Povremeno mo¾ete biti obavije¹teni o tome koja je va¹a lozinka. Sljedeæi argument mo¾e biti ili: `nodigest' ili `digest' (bez navodnika!). Ako ¾elite pretplatiti adresu dugaèiju od one s koje ste uputili zahtjev mo¾ete specificirati adresu s `address=<address>' (bez zagrada oko e-mail adrese, i bez navodnika!)
ro: subscribe [parola] [digest|nodigest] [address=<adresamea>] Vã abonaþi la aceastã listã. Trebuie sã introduceþi o parolã, ce va fi folositã în cazul modificãrii opþiunilor sau a dezabonãrii, dar dacã omiteþi parola, va fi automat generatã pentru dumneavoastrã. Puteþi solicita un mesaj periodic de reamintire a parolei. Urmãtorul argument este 'nodigest' sau 'digest' (fãrã ghilimele!). Puteþi face abonamentul pe o altã adresã decât cea de la care trimiteþi aceastã cerere, ºi în acest caz trebuie sã specificaþi 'address=<adresamea>' (fãrã paranteze la adresa de email ºi fãrã ghilimele!)
tr: subscribe [þifre] [digest|nodigest] [address=<adres>] Bu, mesaj listesine üye olmanýzý saðlar. Seçeneklerinizi deðiþtirmek veya listeden çýkmak için bir þifre vermeniz gerekir, fakat eðer þifre vermezseniz sizin için bir tane oluþturulacaktýr. Belirli aralýklarla þifrenizin size hatýrlatýlmasýný da saðlayabilirsiniz. Bir sonraki argüman `nodigest' (ayrý ayrý mesajlar) veya `digest' (toplu mesajlar) olabilir. Bu formu gönderdiðiniz adres dýþýnda bir adresi üye yapýyorsanýz üyelik yapacaðýnýz adresini `address=<adres>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) þeklinde belirtin.

source: Bad digest specifier: %(arg)s
hr: Krivi digest specifikator: %(arg)s
ro: Parametru eronat de specificare a rezumatului: %(arg)s
tr: Kötü digest belirtici: %(arg)s

source: No valid address found to subscribe
hr: Nije pronaðena ispravna adresa za pretplatu
ro: Nu am gãsit o adresã validã pentru abonare
tr: Üye yapmak için geçerli adres bulunamadý

source: The email address you supplied is banned from this mailing list. If you think this restriction is erroneous, please contact the list owners at %(listowner)s.
hr: E-mail adresa koju ste unijeli iskljuèena je s ove mailing liste. Ako mislite da je ova restrikcija preo¹tra, obratite se vlasniku liste na %(listowner)s.
ro: Adresa de email pe care aþi specificat-o este interzisã pe aceastã listã. Dacã credeþi cã aceastã restricþie este eronatã, vã rugãm sã contactaþi proprietarii listei la adresa %(listowner)s.
tr: Verdiðiniz e-posta adresinin bu listeye üye olmasý yasaklanmýþ. Eðer bu kýsýtlamanýn hatalý olduðunu düþünüyorsanýz, %(listowner)s adresinden liste yöneticileriyle baðlantý kurabilirsiniz.

source: Mailman won't accept the given email address as a valid address. (E.g. it must have an @ in it.)
hr: Mailman neæe prihvatiti navedenu e-mail adresu kao ispravnu adresu. (Npr. ona mora sadr¾avati @.)
ro: Mailman nu va accepta adresa furnizatã ca ºi adresã validã. (De.ex. trebuie sã aibã un @ inclus.)
tr: Mailman verilen adresi geçerli bir adres olarak kabul etmeyecek. (Örneðin bir @ karakteri içermeli.)
