Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: Your confirmation is required in order to continue with the subscription request to the mailing list <em>%(listname)s</em>. Your subscription settings are shown below; make any necessary changes and hit <em>Subscribe to list ...</em> to complete the confirmation process. Once you've confirmed your subscription request, the moderator must approve or reject your membership request. You will receive notice of their decision. <p>Note: your password will be emailed to you once your subscription is confirmed. You can change it by visiting your personal options page. <p>Or, if you've changed your mind and do not want to subscribe to this mailing list, you can hit <em>Cancel my subscription request</em>.
hr: Potrebna je va¹a potvrda da bi se nastavilo sa obradom zahtjeva za pretplatom na mailing listu <em>%(listname)s</em>. Va¹e postavke vezane uz pretplatu su prikazane dolje; napravite potrebne izmjene i stisnite <em>Pretplati se na listu ...</em> da biste okonèali proces pretplate. Jednom kada ste potvrdili svoj pretplatnièki zahtjev, moderator mora odobriti ili odbaciti va¹ pretplatnièki zahtjev. Primit æete obavijest o njegovoj odluci. <p>Primjetite: va¹a lozinka bit æe vam poslana mailom onda kada ona bude potvrðena. Lozinku mo¾ete promjeniti posjetom svoje osobne stranice sa postavkama. <p>Ili, ako ste se predomislili i ne ¾elite se pretplatiti na mailing listu, stisnite <em>Zanemari moj pretplatnièki zahtjev</em>.
ro: Este necesarã confirmarea dumneavoastrã pentru a continua cu cerera de abonare la lista de discuþii <em>%(listname)s</em>. Preferinþele dumneavoastrã de abonament sunt prezentate mai jos; faceþi modificãrile necesare ºi apãsaþi butonul <em>Aboneazã-mã la lista ...</em> pentru a completa procesul de confirmare. De îndatã ce aþi confirmat cererea de abonare, moderatorul trebuie sã aprobe sau sã respingã cererea dumneavoastrã de abonare. Veþi primi o notã ce confirmare a deciziei luate. <p>Notã: parola de acces vã va fi trimisã prin email de îndatã ce abonarea dumneavoastrã este confirmatã. Veþi putea modifica parola vizitând pagina de opþiuni personale. <p>Sau, dacã v-aþi rãzgândit ºi nu mai doriþi sã vã abonaþi la aceastã listã de discuþii, puteþi apãsa butonul <em>Anuleazã-mi cererea de abonare</em>.
tr: <em>%(listname)s</em> mesaj listesine üyelik isteðinizi devam ettirmek için onayýnýz gerekiyor. Üyelik ayarlarýnýz aþaðýda görüntüleniyor; gerekli ayarlarý yaparak <em>... Listesine Üye Ol</em> düðmesine týklayýn ve onay iþlemini tamamlayýn. Üyelik isteðinizi onayladýðýnýz zaman moderatörün üyelik isteðinizi kabul veya reddetmesi gerekiyor. Moderatör kararýnýn bildirimi size gönderilecektir. <p>Not: Üyeliðiniz onaylandýðýnda þifreniz size e-posta ile gönderilecektir. Þifrenizi kiþisel seçenekler sayfasýnda deðiþtirebilirsiniz. <p>Veya bu listeye artýk üye olmak istemiyorsanýz <em>Üyelik isteðimi iptal et</em> düðmesine týklayarak üyelikten vazgeçebilirsiniz.

source: Your email address:
hr: Va¹a e-mail adresa:
ro: Adresa de email:
tr: E-posta adresiniz:

source: Your real name:
hr: Va¹e stvarno ime:
ro: Numele real:
tr: Adýnýz:

source: Receive digests?
hr: Primati digeste?
ro: Doriþi rezumate zilnice?
tr: Toplu gönderim istiyor musunuz?

source: Preferred language:
hr: Preferirani jezik:
ro: Limba preferatã:
tr: Tercih ettiðiniz dil:

source: Cancel my subscription request
hr: Zanemari moj zahtjev za pretplatom
ro: Anuleazã-mi cererea de abonare
tr: Üyelik isteðimi iptal et

source: Subscribe to list %(listname)s
hr: Pretplatite se na listu %(listname)s
ro: Mã abonez la lista %(listname)s
tr: %(listname)s listesine üye ol

source: You have canceled your subscription request.
hr: Zanemarili ste svoj zahtjev za pretplatom.
ro: Aþi anulat cererea de abonare.
tr: Üyelik isteðinizi iptal ettiniz.

source: Awaiting moderator approval
hr: Oèekujem odobrenje moderatora
ro: ÃŽn aºteptarea aprobãrii moderatorului
tr: Moderatör onayý bekleniyor

source: You have successfully confirmed your subscription request to the mailing list %(listname)s, however final approval is required from the list moderator before you will be subscribed. Your request has been forwarded to the list moderator, and you will be notified of the moderator's decision.
hr: Uspje¹no ste potvrdili svoj zahtjev za pretplatom na mailing listu %(listname)s, meðutim prije nego budete pretplaæeni, konaèno odobrenje mora dati moderator liste. Va¹ zahtjev je prosljeðen moderatoru liste, tako da æete biti obavje¹teni o njegovoj odluci.
ro: Aþi confirmat cu suuces cererea de abonare la lista de discuþii %(listname)s totuºi, este necesarã aprobarea finalã a moderatorului listei, înainte de a fi abonat. Cererea dumneavoastrã a fost trimisã moderatorului listei, ºi veþi primi o notificare despre decizia luatã.
tr: %(listname)s listesine üyelik isteðinizi baþarýyla onayladýnýz fakat üye olabilmeniz için liste moderatörünün de onayý gerekiyor. Ýsteðiniz liste moderatörüne iletildi ve onun kararý size bildirilecek.

source: Invalid confirmation string. It is possible that you are attempting to confirm a request for an address that has already been unsubscribed.
hr: Pogre¹an potvrdni tekst. Moguæe je da poku¹avate potvrditi zahtjev za adresom koja je veæ odjavljena sa liste.
ro: Cod de confirmare invalid. S-ar putea sã fi încercat sã confirmaþi o cerere pentru o adresã care a fost deja dezabonatã.
tr: Geçersiz onay dizgisi. Muhtemelen zaten listeden çýkmýþ olan bir adres için yapýlmýþ bir isteði onaylamaya çalýþýyorsunuz.

source: You are already a member of this mailing list!
hr: Vi ste veæ èlan ove mailing liste!
ro: Sunteþi deja membru al acestei liste de discuþii!
tr: Þu anda zaten bu listenin bir üyesisiniz!

source: You were not invited to this mailing list. The invitation has been discarded, and both list administrators have been alerted.
hr: Niste pozvani na ovu mailing listu. Poziv je odbaèen, a oba administratora liste su upozorena.
ro: Nu aþi fost invitat pe aceastã listã de discuþii. Invitaþia a fost anulatã, ºi, de asemena, au fost alertaþi administratorii listei.
tr: Bu listeye davet edilmemiþtiniz. Davet gözardý edildi ve liste yöneticilerine uyarý gönderildi.

source: Subscription request confirmed
hr: Zahtjev za pretplatom je potvrðen
ro: Cererea de abonare a fost confirmatã
tr: Üyelik isteði onaylandý

source: You have successfully confirmed your subscription request for "%(addr)s" to the %(listname)s mailing list. A separate confirmation message will be sent to your email address, along with your password, and other useful information and links. <p>You can now <a href="%(optionsurl)s">proceed to your membership login page</a>.
hr: Uspje¹no ste potvrdili svoj zahtjev za pretplatom za "%(addr)s" na %(listname)s mailing listu. Druga potvrdna poruka biti æe poslana na va¹u e-mail adresu, zajedno sa va¹om lozinkom, kao i drugim korisnim informacijama i linkovima. <p>Sada mo¾ete <a href="%(optionsurl)s">otiæi na svoju èlansku stranicu za prijavu</a>.
ro: Aþi confirmat cu succes cererea de abonarepentru "%(addr)s" la lista de discuþii %(listname)s. Un mesaj separat de confirmare va fi trimis la adresa dumneavoastrã de email, împreunã cu parola de acces ºi alte informaþii ºi utile. <p>Acum puteþi <a href="%(optionsurl)s">accesa pagina de autentificare</a>.
tr: "%(addr)s" adresi için %(listname)s mesaj listesine üyelik isteðinizi baþarýyla onayladýnýz. Ayrý bir onay mesajý e-posta adresinize gönderilecek. Bu mesajda þifrenizle beraber yararlý bilgi ve linkleri bulabilirsiniz. <p>Þimdi <a href="%(optionsurl)s">üyelik giriþ sayfanýza gidebilirsiniz</a>.

source: You have canceled your unsubscription request.
hr: Zanemarili ste svoj zahtjev za odjavom.
ro: Aþi anulat cererea de dezabonare.
tr: Üyelikten çýkma isteðinizi iptal ettiniz.

source: Unsubscription request confirmed
hr: Zahtjev za odjavom je povtrðen
ro: Cererea de dezabonare a fost confirmatã
tr: Üyelikten çýkma isteði onaylandý

source: You have successfully unsubscribed from the %(listname)s mailing list. You can now <a href="%(listinfourl)s">visit the list's main information page</a>.
hr: Uspje¹no ste odjavljeni sa %(listname)s mailing liste. Sada mo¾ete <a href="%(listinfourl)s">posjetiti glavnu stranicu sa informacijama o listi</a>.
ro: Aþi pãrãsit cu succes lista de discuþii %(listname)s Acum puteþi <a href="%(listinfourl)s">vizita pagina principalã de informaþii a listei</a>.
tr: %(listname)s mesaj listesinden baþarýyla çýktýnýz. Þimdi <a href="%(listinfourl)s">listenin ana bilgi sayfasýný ziyaret edebilirsiniz</a>.

source: Confirm unsubscription request
hr: Potvrdi zahtjev za odjavom
ro: Confirmaþi cererea de dezabonare
tr: Üyelikten çýkma isteðini onaylayýn

source: <em>Not available</em>
hr: <em>Nije dostupno</em>
ro: <em>Nu este disponibil</em>
tr: <em>Kullanýlabilir deðil</em>

source: Unsubscribe
hr: Odjava
ro: Dezabonare
tr: Üyelikten çýk

source: Cancel and discard
hr: Zanemari i odbaci
ro: Anuleazã ºi ignorã
tr: Vazgeç ve gözardý et

source: You have canceled your change of address request.
hr: Zanemarili ste zahtjev za promjenom svoje adrese.
ro: Aþi anulat cererea de modificare a adresei.
tr: Adresinizin deðiþtirilmesi isteðinizden vazgeçtiniz.

source: Change of address request confirmed
hr: Zahtjev za promjenom adrese je potvrðen
ro: Cererea de modificare a adresei a fost confirmatã
tr: Adres deðiþikliði isteði onaylandý

source: You have successfully changed your address on the %(listname)s mailing list from <b>%(oldaddr)s</b> to <b>%(newaddr)s</b>. You can now <a href="%(optionsurl)s">proceed to your membership login page</a>.
hr: Uspje¹no ste promjenili svoju adresu na %(listname)s mailing listi iz <b>%(oldaddr)s</b> u <b>%(newaddr)s</b>. Sada mo¾ete <a href="%(optionsurl)s">otiæi na svoju èlansku, poèetnu stranicu.</a>.
ro: Aþi modificat cu succes adresa de email abonatã la lista %(listname)s din <strongb>%(oldaddr)s</strong> în <strong>%(newaddr)s</strong>. Puteþi trece acum la <a href="%(optionsurl)s">pagina de acces a secþiunii de abonament.</a>.
tr: %(listname)s mesaj listesindeki adresinizi <b>%(oldaddr)s</b> adresinden <b>%(newaddr)s</b> adresine baþarýyla deðiþtirdiniz. Þimdi <a href="%(optionsurl)s">üyelik giriþ sayfanýza gidebilirsiniz</a>.

source: Confirm change of address request
hr: Potvrdi zahtjev za promjenom adrese
ro: Confirmaþi cererea de modificare a adresei
tr: Adres deðiþikliði isteðini onaylayýn

source: globally
hr: opæenito
ro: global
tr: global olarak

source: Your confirmation is required in order to complete the change of address request for the mailing list <em>%(listname)s</em>. You are currently subscribed with <ul><li><b>Real name:</b> %(fullname)s <li><b>Old email address:</b> %(oldaddr)s </ul> and you have requested to %(globallys)s change your email address to <ul><li><b>New email address:</b> %(newaddr)s </ul> Hit the <em>Change address</em> button below to complete the confirmation process. <p>Or hit <em>Cancel and discard</em> to cancel this change of address request.
hr: Da biste zavr¹ili proces promjene adrese za mailing listu <em>%(listname)s</em> potrebna je va¹a potvrda. Trenutno ste pretplaæeni sa <ul><li><b>Stvarno ime:</b> %(fullname)s <li><b>Stara e-mail adresa:</b> %(oldaddr)s </ul> i zatra¾ili ste %(globallys)s promjenu svoje e-mail adrese u <ul><li><b>Nova e-mail adresa:</b> %(newaddr)s </ul> Kliknite na <em>Promjeni adresu</em> gumb da biste zavr¹ili proces potvrde. <p>Ili stisnite <em>Zanemari odbaci</em> da biste zanemarili ovu promjenu adrese
ro: Este necesarã confirmarea dumneavoastrã pentru a completa cererea de modificare a adresei la lista de discuþii <em>%(listname)s</em>. În prezent sunteþi abonat cu urmãtoarele date: <ul><li><b>Numele real:</b> %(fullname)s <li>Vechea adresã de e-mail:</b> %(oldaddr)s </ul> ºi aþi cerut modificarea %(globallys)s a adresei de e-mail în <ul><li><b>Noua adresã de e-mail:</b> %(newaddr)s </ul> Apãsaþi butonul <em>Modificã adresa</em> de mai jos pentru a completa procesul de confirmare. Sau apãsaþi butonul <em>Renunþã ºi anuleazã</em> pentru a anula cererea de modificare a adresei.
tr: <em>%(listname)s</em> mesaj listesindeki adresinizin deðiþikliðinin tamamlanmasý için onayýnýz gerekiyor. Þu anda listeye þu bilgilerle üyesiniz: <ul><li><strong>Ýsim:</strong> %(fullname)s <li><strong>Eski e-posta adresi:</strong> %(oldaddr)s </ul> Aþaðýdaki <em>Adresi Deðiþtir</em> düðmesine týklayarak onay iþlemini tamamlayýn. <p>Veya <em>Vazgeç ve gözardý et</em> düðmesine týklayarak bu adres deðiþikliði isteðini iptal edin.

source: Change address
hr: Promjeni adresu
ro: Modificã adresa
tr: Adresi deðiþtir

source: Continue awaiting approval
hr: Nastavi oèekivano odobrenje
ro: Continuã aprobarea în aºteptare
tr: Onay beklemeye devam et

source: Okay, the list moderator will still have the opportunity to approve or reject this message.
hr: U redu, moderator liste æe i dalje imati ¹ansu da odobri ili odbaci ovu poruku.
ro: Bine, bine, moderatorul listei încã va mai avea posibilitatea de a aproba sau respinge acest mesaj.
tr: Tamam, liste moderatörü hala bu mesajý kabul etme veya reddetme imkanýna sahip.

source: Sender discarded message via web.
hr: Po¹iljatelj je odbacio poruku koristeæi web.
ro: Expeditorul a anulat mesajul prin intermediul paginii web.
tr: Gönderici mesajý web üzerinden gözardý etti.

source: The held message with the Subject: header <em>%(subject)s</em> could not be found. The most likely reason for this is that the list moderator has already approved or rejected the message. You were not able to cancel it in time.
hr: Zadr¾ana poruka sa Naslovom: <em>%(subject)s</em> u zaglavlju nije pronaðena. Vjerovatno je tome razlog taj ¹to je moderator liste veæ odobrio ili odbacio poruku. Niste bili u moguænosti zanemariti istu na vrijeme.
ro: Mesajul reþinut avãnd subiectul: <em>%(subject)s</em> nu a putut fi gãsit. Cel mai probabil motiv este cã moderatorul listei a aprobat sau respins deja acest mesaj. Nu aþi reuºit anularea lui la timp.
tr: Konu: baþlýðý <em>%(subject)s</em> olan, bekletilen mesaj bulunamadý. Bunun en muhtemel sebebi liste moderatörünün mesajý onaylamýþ veye reddetmiþ olmasýdýr. Mesajý göndermekten zamanýnda vazgeçemediniz.

source: Posted message canceled
hr: Poslana poruka je zanemarena
ro: Mesajul publicat a fost anulat
tr: Gönderilen mesajdan vazgeçildi

source: You have successfully canceled the posting of your message with the Subject: header <em>%(subject)s</em> to the mailing list %(listname)s.
hr: Uspje¹no ste zanemarili slanje svoje poruke sa Subject: <em>%(subject)s</em> zaglavljem na mailing listu %(listname)s.
ro: Aþi anulat cu succes publicarea mesajului cu subiectul: <em>%(subject)s</em> pe lista de discuþii %(listname)s.
tr: %(listname)s listesine Konu: baþlýðý <em>%(subject)s</em> olan mesajýnýzýn gönderiminden baþarýyla vazgeçtiniz.

source: Cancel held message posting
hr: Zanemari zadr¾anu poslanu poruku
ro: Anuleazã publicarea mesajului
tr: Bekleyen mesajýn gönderiminden vazgeç

source: The held message you were referred to has already been handled by the list administrator.
hr: Zadr¾ana poruka na koju ste se referencirali je veæ obraðena od strane administratora liste.
ro: Mesajul reþinut la care vã referiþi a fost deja procesat de cãtre administratorul listei.
tr: Ýstediðiniz bekletilen mesaj, liste yöneticisi tarafýndan zaten incelendi.

source: Your confirmation is required in order to cancel the posting of your message to the mailing list <em>%(listname)s</em>: <ul><li><b>Sender:</b> %(sender)s <li><b>Subject:</b> %(subject)s <li><b>Reason:</b> %(reason)s </ul> Hit the <em>Cancel posting</em> button to discard the posting. <p>Or hit the <em>Continue awaiting approval</em> button to continue to allow the list moderator to approve or reject the message.
hr: Potrebna je va¹a potvrda da biste zanemarili slanje svoje poruke na mailing listu <em>%(listname)s</em>: <ul><li><b>Po¹iljatelj:</b> %(sender)s <li><b>Naslov:</b> %(subject)s <li><b>Razlog:</b> %(reason)s </ul> Kliknite na <em>Zanemari slanje</em> gumb da biste izbjegli slanje poruke. <p>Ili stisnite na <em>Nastavi odobrenje na èekanju</em> gumb da biste dali moderatoru liste moguænost da odobri ili odbaci poruku.
ro: Este necesarã confirmarea dumneavoastrã pentru a putea anula publicarea mesajului trimis cãtre lista <em>%(listname)s</em>: <ul><li><b>Expeditor:</b> %(sender)s <li><b>Subiect:</b> %(subject)s <li><b>Motiv:</b> %(reason)s </ul> Apãsaþi butonul <em>Anuleazã publicarea</em> pentru a nu mai publica acest mesaj pe listã. <p>Sau apãsaþi butonul <em>Aºteaptã aprobarea</b> pentru a continua ºi a permite moderatorului listei sã aprobe sau sã respingã mesajul.
tr: <em>%(listname)s</em> listesine mesajýnýzýn gönderiminden vazgeçmek için onayýnýz gerekiyor: <ul><li><b>Gönderen:</b> %(sender)s <li><b>Konu:</b> %(subject)s <li><b>Neden:</b> %(reason)s </ul> Mesajýn gönderiminden vazgeçmek için <em>Gönderimden vazgeç</em> düðmesine týklayýn. <p>Veya <em>Onay beklemeye devam et</em> düðmesine týklayarak liste moderatörünün mesajý onaylamasý veya reddetmesini beklemeye devam edin.

source: Cancel posting
hr: Zanemari slanje poruke
ro: Anuleazã publicarea
tr: Gönderimden vazgeç

source: You have canceled the re-enabling of your membership. If we continue to receive bounces from your address, it could be deleted from this mailing list.
hr: Zanemarili ste ponovno ukljuèivanje svoga èlanstva. Ako mi i dalje od vas budemo primali odbijene poruke, adresa bi mogla biti obrisana sa ove mailing liste.
ro: Aþi anulat re-activarea abonamentului dumneavoastrã. Dacã vom continua sã primim eºecuri de livrare a mesajelor la adresa dumneavoastrã (bounces), s-ar putea s-o ºtergem de pe aceastã listã de discuþii.
tr: Üyeliðinizin yeniden etkinleþtirilmesinden vazgeçtiniz. Eðer adresinizden geri dönen mesaj almaya devam edersek, mesaj listesinden silinebilir.

source: Membership re-enabled.
hr: Èlanstvo je obnovljeno.
ro: Abonamentul a fost reactivat.
tr: Üyelik yeniden etkinleþtirildi.

source: You have successfully re-enabled your membership in the %(listname)s mailing list. You can now <a href="%(optionsurl)s">visit your member options page</a>.
hr: Uspje¹no ste obnovili èlanstvo na %(listname)s mailing listi. Sada mo¾ete <a href="%(optionsurl)s">posjetiti svoju èlansku stranicu sa postavkama.</a>.
ro: Aþi re-activat cu succes abonamentul dumneavoastrã la lista de discuþii %(listname)s. Acum puteþi <a href="%(optionsurl)s">accesa pagina de autentificare</a>.
tr: %(listname)s mesaj listesindeki üyeliðinizi baþarýyla yeniden etkinleþtirdiniz. Þimdi <a href="%(optionsurl)s">Üyelik seçenek sayfanýza gidebilirsiniz.</a>.

source: Re-enable mailing list membership
hr: Obnovi èlanstvo na mailing listi
ro: Reactiveazã abonamentul la lista de discuþii
tr: Mesaj listesi üyeliðimi yeniden etkinleþtir

source: We're sorry, but you have already been unsubscribed from this mailing list. To re-subscribe, please visit the <a href="%(listinfourl)s">list information page</a>.
hr: ®ao nam je, ali Vi ste veæ odjavljeni sa ove mailing liste. Da biste se ponovno pretplatili, posjetite <a href="%(listinfourl)s">informacijsku stranicu liste</a>.
ro: Ne pare rãu, dar deja aþi fost dezabonat de la aceastã listã de discuþii Pentru a vã reabona, vizitaþi <a href="%(listinfourl)s">pagina de informaþii generale</a> a listei.
tr: Üzgünüz fakat bu mesaj listesinden zaten çýkarýlmýþsýnýz. Yeniden üye olmak için <a href="%(listinfourl)s">liste bilgi sayfasýný</a> ziyaret edin.

source: <em>not available</em>
hr: <em>nije dostupno</em>
ro: <em>nu este disponibil(ã)</em>
tr: <em>kullanýlabilir deðil</em>

source: Your membership in the %(realname)s mailing list is currently disabled due to excessive bounces. Your confirmation is required in order to re-enable delivery to your address. We have the following information on file: <ul><li><b>Member address:</b> %(member)s <li><b>Member name:</b> %(username)s <li><b>Last bounce received on:</b> %(date)s <li><b>Approximate number of days before you are permanently removed from this list:</b> %(daysleft)s </ul> Hit the <em>Re-enable membership</em> button to resume receiving postings from the mailing list. Or hit the <em>Cancel</em> button to defer re-enabling your membership.
hr: Va¹e èlanstvo na %(realname)s mailing listi je trenutno onemoguæeno zbog prekomjernog odbijanja poruka. Da biste ponovno omoguæili dostavu poruka na svoju adresu potrebna je va¹a potvrda. Imamo sljedeæe informacije: <ul><li><b>Èlanska adresa:</b> %(member)s <li><b>Èlansko ime:</b> %(username)s <li><b>Zadnje odbijanje poruke primljeno:</b> %(date)s <li><b>Pribli¾an broj dana prije nego budete trajno obrisani sa ove liste:</b> %(daysleft)s </ul> Kliknite na <em>Obnovi èlanstvo</em> gumb da biste nastavili primati poruke sa mailing liste. Ili stisnite <em>Zanemari</em> gumb da biste odustali od istog.
ro: Abonamentul dumneavoastrã la lista de discuþii %(realname)s este în acest moment dezactivat din cauza eºecurilor de livrare (bounces) excesive. Este necesarã confirmarea dumneavoastrã pentru a reactiva livrarea mesajelor la adresa dumneavoastrã. Urmãtoarele informaþii suplimentare sunt disponibile: <ul> <li><b>Adresa:</b> %(member)s <li><b>Numele:</b> %(username)s <li><b>Data ultimului eºec:</b> %(date)s <li><b>Numãrul de zile (aproximativ) pânã când veþi fi ºters definitiv din aceastã listã:</b> %(daysleft)s </ul> Apãsaþi pe butonul <em>Reactiveazã</em> pentru reactivarea abonamentului.
tr: %(realname)s mesaj listesindeki üyeliðiniz þu anda çok fazla geri dönüþ sebebiyle etkin deðil. Adresinize gönderimi etkinleþtirmek için onayýnýz gerekiyor. Sizinle ilgili þu bilgilere sahibiz: <ul><li><strong>Üye adresi:</strong> %(member)s <li><strong>Üye ismi:</strong> %(username)s <li><strong>Son geri dönen mesaj tarihi:</strong> %(date)s <li><strong>Bu listeden kalýcý olarak silimenize kadar kalan yaklaþýk gün:</strong> %(daysleft)s </ul> <em>Üyeliðimi yeniden etkinleþtir</em> düðmesine týklayarak bu mesaj listesinden mesaj almaya devam edebilirsiniz. Veya <em>Vazgeç</em> düðmesine týklayarak üyeliðinizi yeniden etkinleþtirmeyi erteleyebilirsiniz.

source: Re-enable membership
hr: Obnovi èlanstvo
ro: Reactiveazã
tr: Üyeliðimi yeniden etkinleþtir

source: Cancel
hr: Zanemari
ro: Renunþã
tr: Vazgeç

source: Bad URL specification
hr: Kriva specifikacija URLa
ro: Specificare URL eronatã
tr: Kötü URL tanýmlamasý

source: Return to the
hr: Vrati se na
ro: ÃŽnapoi la
tr: Þuraya geri dön:

source: general list overview
hr: opæeniti pregled liste
ro: informaþii generale despre listã
tr: genel liste tanýtým sayfasý

source: <br>Return to the
hr: <br>Vrati se na
ro: <br>ÃŽnapoi la
tr: <br>Þuraya geri dön:

source: administrative list overview
hr: administracijski pregled liste
ro: meniul general administrativ al listei
tr: yönetimsel liste tanýtým sayfasý

source: List name must not include "@": %(safelistname)s
hr: Naziv liste ne smije ukljuèivati "@": %(safelistname)s
ro: Numele listei nu poate include "@": %(listname)s
tr: Liste ismi "@" karakterini içeremez: %(safelistname)s

source: List already exists: %(safelistname)s
hr: Lista veæ postoji: %(safelistname)s
ro: Lista %(listname)s existã deja!
tr: Bu liste zaten var: %(safelistname)s

source: You forgot to enter the list name
hr: Zaboravili ste unijeti naziv liste
ro: Aþi uitat sã introduceþi numele listei
tr: Liste ismi girmeyi unuttunuz

source: You forgot to specify the list owner
hr: Zaboravili ste navesti vlasnika liste
ro: Aþi uitat sã specificaþi proprietarul acestei liste
tr: Liste sahibini belirtmeyi unuttunuz
