Repository: apple-open-source/macos
Catalog: mailman/mailman/messages/*/LC_MESSAGES/mailman.po
Languages: hr, ro, tr

source: WARNING: Ignoring duplicate pending ID: %(id)s.
ro: ATENÞIE: Ignor ID duplicat în aºteptare: %(id)s.

source: getting rid of old source files
ro: scap de vechile fiºierele sursã

source: no lists == nothing to do, exiting
ro: nu sunt liste == nimic de fãcut, gata

source: fixing all the perms on your old html archives to work with b6 If your archives are big, this could take a minute or two...
ro: refac toate permisiunile la vechile arhive html, pentru a putea funcþiona cu b6 Dacã arhivele sunt mari, aceasta va dura un minut sau douã...

source: done
ro: gata

source: Updating mailing list: %(listname)s
ro: Actualizez lista de discuþii: %(listname)s

source: Updating Usenet watermarks
ro: Actualizez watermark-urile Usenet

source: - nothing to update here
ro: - nimic de actualizat aici

source: - usenet watermarks updated and gate_watermarks removed
ro: - watermark-urile usenet au fost actualizate ºi gate_watermark-urile ºterse

source: NOTE NOTE NOTE NOTE NOTE You are upgrading an existing Mailman installation, but I can't tell what version you were previously running. If you are upgrading from Mailman 1.0b9 or earlier you will need to manually update your mailing lists. For each mailing list you need to copy the file templates/options.html lists/<listname>/options.html. However, if you have edited this file via the Web interface, you will have to merge your changes into this file, otherwise you will lose your changes. NOTE NOTE NOTE NOTE NOTE
ro: NOTÃ NOTÃ NOTÃ NOTÃ NOTÃ Sunteþi pe cale sã actualizaþi o instalare existentã Mailman, dar nu pot preciza exactce versiune era instalatã anterior. dacã actualizaþi de la Mailman 1.0b9 sau anterior, va trebui sã actualizaþi manual listele dumneavoastrã. Pentru fiecare listã de discuþii va trebui sã copiaþi fiºierele templates/options.html lists/<numelistã>/options.html. Oricum, dacã aþi modificat acest fiºier prin intermediul interfeþei Web, va trebui sã combinaþi toate modificãrile în acest fiºier, cãci altfel la veþi pierde. NOTÃ NOTÃ NOTÃ NOTÃ NOTÃ

source: No updates are necessary.
ro: Nu sunt necesare actualizãri.

source: Downgrade detected, from version %(hexlversion)s to version %(hextversion)s This is probably not safe. Exiting.
ro: Am detectat o involuþie de la versiunea %(hexlversion)s la versiunea %(hextversion)s Probabil cã acest lucru nu este cel mai indicat. Termin.

source: Upgrading from version %(hexlversion)s to %(hextversion)s
ro: Actualizez de la versiunea %(hexlversion)s la %(hextversion)s

source: ERROR: The locks for some lists could not be acquired. This means that either Mailman was still active when you upgraded, or there were stale locks in the %(lockdir)s directory. You must put Mailman into a quiescent state and remove all stale locks, then re-run "make update" manually. See the INSTALL and UPGRADE files for details.
ro: EROARE: Blocajele pentru unele liste nu au putut fi achiziþionate. Asta înseamnã cã ori Mailman era încã activ când aþi fãcut actualizarea, ori mai erau câteva blocaje uitate în directorul %(lockdir)s Trebuie sã aduceþi Mailman într-o stare latentã (quiescent state) ºi sã ºtergeþi toate blocajele rãmase, iar apoi sã re-rulaþi "make update" manual. Urmãriþi ºi fiºierele INSTALL ºi respectiv UPGRADE pentru detalii.

source: Print the Mailman version.
ro: Tipãreºte versiunea Mailman.

source: Using Mailman version:
ro: Foloseºte Mailman versiunea:

source: Unlocking (but not saving) list: %(listname)s
ro: Deblochez (dar nu salvez) lista: %(listname)s

source: Finalizing
ro: Finalizez

source: Loading list %(listname)s
ro: Încarc lista %(listname)s

source: (locked)
ro: (blocat)

source: (unlocked)
ro: (deblocat)

source: Unknown list: %(listname)s
ro: Listã necunoscutã: %(listname)s

source: No list name supplied.
ro: Lipseºte numele listei.

source: Importing %(module)s...
ro: Importez %(module)s...

source: Running %(module)s.%(callable)s()...
ro: Rulez %(module)s.%(callable)s()...

source: The variable `m' is the %(listname)s MailList instance
ro: Parametrul 'm' este instanþa listei %(listname)s

source: Increment the digest volume number and reset the digest number to one. Usage: %(PROGRAM)s [options] [listname ...] Options: --help/-h Print this message and exit. The lists named on the command line are bumped. If no list names are given, all lists are bumped.
ro: Incrementeazã numãrul volumului ºi reseteazã numãrul ediþiei la unu. Folosire: %(PROGRAM)s [opþiuni] [numelistã ...] Opþiuni: --help/-h Afiºeazã acest mesaj de ajutor ºi terminã execuþia. Listele indicate în linia de comandã sunt prelucrate. Dacã nu indicaþi nici un nume de listã, atunci toate listele vor fi prelucrate.

source: Check for pending admin requests and mail the list owners if necessary. Usage: %(PROGRAM)s [options] Options: -h/--help Print this message and exit.
ro: Verificã existenþa cererilor administrative ºi notificã proprietarii listei dacã e necesar. Folosire: %(PROGRAM)s [opþiuni] Opþiuni: -h/--help Afiºeazã acest mesaj de ajutor ºi terminã execuþia.

source: Notice: %(discarded)d old request(s) automatically expired.
ro: Notã: %(discarded)d mesajele vechi expirate automat.

source: %(count)d %(realname)s moderator request(s) waiting
ro: %(count)d %(realname)s cereri moderate în aºteptare

source: Pending subscriptions:
ro: Cereri de abonare în aºteptare:

source: Pending posts:
ro: Publicãri în aºteptare:

source: From: %(sender)s on %(date)s Subject: %(subject)s Cause: %(reason)s
ro: De la: %(sender)s în %(date)s Subiect: %(subject)s Motiv: %(reason)s

source: [disabled by periodic sweep and cull, no message available]
ro: [dezactivatã de întreþinerea periodicã, nu sunt mesaje disponibile]

source: Poll the NNTP servers for messages to be gatewayed to mailing lists. Usage: gate_news [options] Where options are --help -h Print this text and exit.
ro: Sondeazã serverele NNTP pentru mesaje de trimis spre listele de discuþii. Folosire: gate_news [opþiuni] Unde opþiunile sunt --help -h afiºeazã acest mesaj de ajutor ºi terminã execuþia

source: Send password reminders for all lists to all users. This program scans all mailing lists and collects users and their passwords, grouped by the list's host_name if mm_cfg.VIRTUAL_HOST_OVERVIEW is true. Then one email message is sent to each unique user (per-virtual host) containing the list passwords and options url for the user. The password reminder comes from the mm_cfg.MAILMAN_SITE_LIST, which must exist. Usage: %(PROGRAM)s [options] Options: -l listname --listname=listname Send password reminders for the named list only. If omitted, reminders are sent for all lists. Multiple -l/--listname options are allowed. -h/--help Print this message and exit.
ro: Trimite mesaje de reamintire a parolelor pentru toate listele ºi pentru toþi utilizatorii. Acest program scaneazã toate listele de discuþii, colecteazã utilizatorii ºi parolele lor, grupaþi dupã parametrul de listã host_name dacã mm_cfg.VIRTUAL_HOST_OVERVIEW este adevãrat. Apoi este trimis câte un mesaj la fiecare utilizator (pentru fiecare domeniu virtual), conþinând parolele listei ºi adresele URL de opþiuni pentru utilizator Mesajul de reamintire a parolei este trimis de la mm_cfg.MAILMAN_SITE_LIST, care trebuie sã existe. Folosire: %(PROGRAM)s [opþiuni] Opþiuni: -l listname --listname=listname Trimite mesaje de reamintire a parolei nuami pentru lista indicatã. Dacã este omis, mesajele vor fi trimise pentru toate listele. Sunt permise opþiuni multiple -l/--listname. -h/--help Afiºeazã acest mesaj de ajutor ºi terminã execuþia.

source: Password // URL
ro: Parola // URL

source: %(host)s mailing list memberships reminder
ro: Mesaj de reamintire a datelor listei de discuþii de la %(host)s

source: Re-generate the Pipermail gzip'd archive flat files. This script should be run nightly from cron. When run from the command line, the following usage is understood: Usage: %(program)s [-v] [-h] [listnames] Where: --verbose -v print each file as it's being gzip'd --help -h print this message and exit listnames Optionally, only compress the .txt files for the named lists. Without this, all archivable lists are processed.
ro: Regenereazã fiºierele arhivã (gzip) Pipermail. Acest script ar trebui sã ruleze noaptea din cron. Când este rulat din linia de comandã, urmãtorul format este recunoscut: Folosire: %(program)s [-v] [-h] [numeliste] Unde: --verbose -v afiºeazã fiecare fiºier ce este comprimat --help -h afiºeazã acest mesaj de ajutor ºi terminã execuþia listnames Opþional, comprimã doar fiºierele .txt pentru listele date. Fãrã acest parametru, toate listele ce pot fi arhivate sunt procesate.

source: Dispatch digests for lists w/pending messages and digest_send_periodic set. Usage: %(PROGRAM)s [options] Options: -h / --help Print this message and exit. -l listname --listname=listname Send the digest for the given list only, otherwise the digests for all lists are sent out.
ro: Distribuie volumele pentru listele cu mesaje în aºteptare ºi parametrul digest_send_periodic activat. Folosire: %(PROGRAM)s [opþiuni] Opþiuni: -h / --help Afiºeazã acest mesaj de ajutor ºi terminã execuþia. -l listname --listname=listname Trimite volumele de rezumate numai din lista datã; altfel sunt trimise volumele restante de rezumate pentru toate listele.

source: Text%(sz)s
hr: Tekst%(sz)s
tr: Yazý%(sz)s

source: August
hr: Kolovoz
tr: Aðustos

source: Moderator
tr: Moderatör

source: Administrator
tr: Yönetici

source: Edit the public HTML pages
tr: Genel HTML sayfalarýný düzenle

source: Accept
hr: Prihvati
tr: Onayla

source: <br><em><strong>Note:</strong> setting this value performs an immediate action but does not modify permanent state.</em>
hr: <br><em><strong>Obavijest:</strong> postavljanje ove vrijednosti uzrokuje trenutnu akciju, ali ne mijenja fiksna stanja.</em>
tr: <br><em><strong>Not:</strong> bu deðeri ayarlamak acil bir eylem uygular fakat kalýcý durumu deðiþtirmez.</em>

source: mod
tr: onay

source: U
tr: K

source: A
tr: O

source: B
tr: G

source: Your confirmation is required in order to complete the subscription request to the mailing list <em>%(listname)s</em>. Your subscription settings are shown below; make any necessary changes and hit <em>Subscribe</em> to complete the confirmation process. Once you've confirmed your subscription request, you will be shown your account options page which you can use to further customize your membership options. <p>Note: your password will be emailed to you once your subscription is confirmed. You can change it by visiting your personal options page. <p>Or hit <em>Cancel my subscription request</em> if you no longer want to subscribe to this list.
hr: Potrebna je va¹a potvrda da bi se zavr¹io zahtjev za pretplatom na mailing listu <em>%(listname)s</em>. Va¹e postavke vezane uz pretplatu su prikazane dolje; napravite potrebne izmjene i stistnite <em>Pretplati</em> da biste okonèali postupak potvrde. Jednom kada ste potvrdili va¹ pretplatnièki zahtjev, bit æe vam predoèena va¹a korisnièka stranica sa opcijama, koju mo¾ete koristiti za detaljno pode¹avanje va¹ih èlanskih postavki. <p>Primijetite: va¹a lozinka bit æe vam poslana mailom onda kada ona bude potvrðena. Lozinku mo¾ete promjeniti posjetom svoje osobne stranice sa postavkama. <p>Ili stistnite <em>Zanemari i odbaci</em> da biste zanemarili ovaj pretplatnièki zahtjev.
tr: <em>%(listname)s</em> mesaj listesine üyelik isteðinizi tamamlayabilmek için onayýnýz gerekiyor. Üyelik ayarlarýnýz aþaðýda görüntüleniyor; gerekli ayarlarý yaparak <em>Üye Ol</em> düðmesine týklayýn ve onay iþlemini tamamlayýn. Üyelik isteðinizi onayladýðýnýz zaman hesap seçenekleri sayfanýza gönderileceksiniz, bu sayfada üyelik seçeneklerinizi özelleþtirebilirsiniz. <p>Not: Üyeliðiniz onaylandýðýnda þifreniz size e-posta ile gönderilecektir. Þifrenizi kiþisel seçenekler sayfasýnda deðiþtirebilirsiniz. <p>Veya bu listeye artýk üye olmak istemiyorsanýz <em>Üyelik isteðimi iptal et</em> düðmesine týklayarak üyelikten vazgeçebilirsiniz.

source: Your confirmation is required in order to complete the unsubscription request from the mailing list <em>%(listname)s</em>. You are currently subscribed with <ul><li><b>Real name:</b> %(fullname)s <li><b>Email address:</b> %(addr)s </ul> Hit the <em>Unsubscribe</em> button below to complete the confirmation process. <p>Or hit <em>Cancel and discard</em> to cancel this unsubscription request.
hr: Da biste zavr¹ili zahtjev za odjavom sa mailing liste potrebna je <em>%(listname)s</em> va¹a potvrda. Trenutno ste pretplaæeni na <ul><li><b>Stvarno ime:</b> %(fullname)s <li><b>Email adresa:</b> %(addr)s </ul> Kliknite na <em>Odjava</em> gumb da biste potvrdili cijeli proces. <p>Ili stisnite <em>Zanemari i odbaci</em> da biste zanemarili ovaj zahtjev za pretplatom.
tr: <em>%(listname)s</em> mesaj listesinden çýkmak için onayýnýz gerekiyor. Þu anda listeye þu bilgilerle üyesiniz: <ul><li><b>Ad:</b> %(fullname)s <li><b>E-posta adresi:</b> %(addr)s </ul> Aþaðýda <em>Üyelikten çýk</em> düðmesine týklayarak onay iþlemini tamamlayýn. <p>Veya <em>Vazgeç ve gözardý et</em> düðmesine týklayarak bu listeden çýkma isteðinizi iptal edin.

source: <missing>
tr: <eksik>

source: who See everyone who is on this mailing list.
tr: who Bu mesaj listesine üye olan herkesi gösterir.

source: who password [address=<address>] See everyone who is on this mailing list. The roster is limited to list members only, and you must supply your membership password to retrieve it. If you're posting from an address other than your membership address, specify your membership address with `address=<address>' (no brackets around the email address, and no quotes!)
tr: who password [address=<adres>] Bu mesaj listesine üye olan herkesi gösterir. Ýsim listesi sadece liste üyelerine görünür durumda olduðu için üyelik þifrenizi de vermeniz gereklidir. Listeye üye olduðunuz adres dýþýnda bir adresten bu komutu gönderiyorsanýz üyelik adresinizi `address=<adres>' (e-posta adresi etrafýndaki ayraçlar ve týrnaklar olmaksýzýn) þeklinde belirtin.

source: public
hr: javno
tr: genel

source: Auto-responder
hr: Automatski odgovor
tr: Otomatik Yanýtlayýcý

source: Number of days between auto-responses to either the mailing list or -request/-owner address from the same poster. Set to zero (or negative) for no grace period (i.e. auto-respond to every message).
hr: Broj dana izmeðu automatskog odgovora na mailing listu ili -request/-owner adresu od strane istog po¹iljatelja. Postavite opciju na nulu (ili negativnu vrijednost) za neogranièeno razdoblje (npr. za automatski odgovor na svaku poruku).
tr: Mesaj listesine veya -request/-owner adresine ayný göndericiden gelen mesajlara yapýlacak otomatik yanýtlamalar arasýndaki gün sayýsý. Gecikme dönemi olmamasý için sýfýr (veya negatif) olarak ayarlayýn. (yani her gelen mesaj yanýtlansýn).

source: These policies control the automatic bounce processing system in Mailman. Here's an overview of how it works. <p>When a bounce is received, Mailman tries to extract two pieces of information from the message: the address of the member the message was intended for, and the severity of the problem causing the bounce. The severity can be either <em>hard</em> or <em>soft</em> meaning either a fatal error occurred, or a transient error occurred. When in doubt, a hard severity is used. <p>If no member address can be extracted from the bounce, then the bounce is usually discarded. Otherwise, each member is assigned a <em>bounce score</em> and every time we encounter a bounce from this member we increment the score. Hard bounces increment by 1 while soft bounces increment by 0.5. We only increment the bounce score once per day, so even if we receive ten hard bounces from a member per day, their score will increase by only 1 for that day. <p>When a member's bounce score is greater than the <a href="?VARHELP=bounce/bounce_score_threshold">bounce score threshold</a>, the subscription is disabled. Once disabled, the member will not receive any postings from the list until their membership is explicitly re-enabled (either by the list administrator or the user). However, they will receive occasional reminders that their membership has been disabled, and these reminders will include information about how to re-enable their membership. <p>You can control both the <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings">number of reminders</a> the member will receive and the <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings_interval" >frequency</a> with which these reminders are sent. <p>There is one other important configuration variable; after a certain period of time -- during which no bounces from the member are received -- the bounce information is <a href="?VARHELP=bounce/bounce_info_stale_after">considered stale</a> and discarded. Thus by adjusting this value, and the score threshold, you can control how quickly bouncing members are disabled. You should tune both of these to the frequency and traffic volume of your list.
hr: Ove postavke kontroliraju automatsko odbijanje poruka u Mailmanu. Evo pregleda kako to sve radi. <p>Kada je primljena odbijena poruka, Mailman poku¹ava izdvojiti dva dijela informacije iz poruke: adresu èlana kojem je poruka bila namjenjena i velièinu problema koji je izazvao odbijanje. Velièina problema mo¾e biti <em>velika</em> ili <em>mala</em>, ¹to znaèi da se dogodila fatalna ili privremena gre¹ka. Kada je u nedoumici, Mailman smatra da se dogodio veliki problem. <p>Ako iz odbijene poruke ne mo¾e biti izdvojena nikakva èlanska adresa, onda je odbijena poruka obièno uni¹tena. U suprotnom, svakom èlanu je dodijeljen <em>brojaè odbijanja</em> tako da svaki put kada je detektirano odbijanje za tog èlana, poveæavamo brojaè. Problematiène poruke (veliki problem) poveæavaju brojaè za 1, dok one s manjim stupnjem problema poveæavaju brojaè za 0.5. Brojaè poveæavamo samo jednom dnevno, tako da i ako primimo deset problematiènih odbijanja od èlana dnevno, njegov æe se brojaè poveæati samo za 1. <p>Kada je brojaè odbijanja za èlana veæi od <a href="?VARHELP=bounce/bounce_score_threshold">postavljenog brojaèa odbijanja </a>, pretplata je onemoguæena. Tada èlan neæe dobijati nikakve poruke s liste sve dok se njegovo èlanstvo eksplicitno ponovno ne obnovi (od strane administartora liste ili korisnika). Ipak, on æe povremeno primati podsjetnike da je njegovo èlanstvo onemoguæeno, a ti podsjetnici æe ukljuèivati informacije o tome kako da se ponovno obnovi njegovo èlanstvo. <p>Vi mo¾ete kontrolirati i <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings">broj podsjetnika</a> koje æe èlan primiti i <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings_interval" >intervale</a> u kojima su ti podsjetnici poslani. <p>Postoji jedna va¾na konfiguracijska varijabla; nakon odreðenog vremenskog perioda -- tijekom kojeg nisu primljena odbijanja -- informacija o odbijanju se <a href="?VARHELP=bounce/bounce_info_stale_after"> smatra starom</a> i odbaèenom. Namje¹tanjem ove vrijednosti i postavljenog brojaèa odbijanja, mo¾ete kontrolirati kako brzo su èlanovi odbijenih poruka onemoguæeni. Obadvije vrijednosti biste trebali podesiti tako da odgovaraju frekvenciji i prometu na va¹oj listi.
tr: Bu ilkeler Mailman'in otomatik geri dönüþ sistemini kontrol eder. Nasýl çalýþtýðýyla ilgili birkaç açýklama: <p>Bir geri dönüþ alýndýðý zaman, Mailman mesajdan iki bilgiyi almaya çalýþýr: mesajýn gönderildiði üye ve geri dönüþe neden olan sorunun önemi. Önem ya <em>büyük</em> ya da <em>küçük</em> olabilir. Yani sorun ya ciddi bir hatadan kaynaklanmaktadýr ya da geçici bir hata olmuþtur. Önemin tespit edilemediði durumlarda büyük önem kullanýlýr. <p>Eðer geri dönen mesajdan bir üye adresi alýnamazsa, geri dönüþ genellikle gözardý edilir. Aksi halde, her üyeye bir <em>geri dönüþ puaný</em> verilir ve bu üyeden gelen her geri dönüþ ile bu puan artýrýlýr. Büyük öneme sahip geri dönüþler 1 puan, küçük öneme sahip geri dönüþler 0.5 puan artýrýr. Geri dönüþ puaný günde sadece 1 kez artýrýlýr, yani bir üyeden günde on geri dönüþ oluyorsa, o gün için puanlarý sadece 1 artýrýlýr. <p>Bir üyenin geri dönüþ puaný <a href="?VARHELP=bounce/bounce_score_threshold">geri dönüþ puan eþiði</a>'nden büyükse, üyelik devre dýþý býrakýlýr. Bu durumda, üyeliði tekrar etkinleþtirilmeden (kendisi veya bir yönetici tarafýndan) üye listeden herhangi bir mesaj almaz. Ancak ara sýra üyeliðinin devre dýþý býrakýldýðýyla ilgili hatýrlatýcýlar alýr ve bu hatýrlatýcýlarda üyeliðini tekrar nasýl etkinleþtireceðiyle ilgili bilgiler bulunur. <p>Hem üyenin alacaðý <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings">hatýrlatma sayýsýný</a> hem de bu hatýrlatmalarýn gönderileceði <a href="?VARHELP=bounce/bounce_you_are_disabled_warnings_interval" >sýklýðý</a> kontrol edebilirsiniz. <p>Ayrýca, önemli bir yapýlandýrma deðiþkeni daha vardýr; belli bir süre sonrasýnda --üye adresinden hiç geri dönüþ olmadýðý bir süre-- geri dönüþ bilgisi <a href="?VARHELP=bounce/bounce_info_stale_after">eski sayýlýr</a> ve gözardý edilir. Bu deðeri ve puan eþiðini ayarlayarak adreslerinden geri dönüþ olan üyelerin ne kadar zamanda üyeliklerinin devre dýþý kalacaðýný ayarlayabilirsiniz. Bu iki deðeri de listenizin trafik sýklýðý ve hacmine uygun olarak ayarlamanýz gerekir.

source: Policies concerning the content of list traffic. <p>Content filtering works like this: when a message is received by the list and you have enabled content filtering, the individual attachments are first compared to the <a href="?VARHELP=contentfilter/filter_mime_types">filter types</a>. If the attachment type matches an entry in the filter types, it is discarded. <p>Then, if there are <a href="?VARHELP=contentfilter/pass_mime_types">pass types</a> defined, any attachment type that does <em>not</em> match a pass type is also discarded. If there are no pass types defined, this check is skipped. <p>After this initial filtering, any <tt>multipart</tt> attachments that are empty are removed. If the outer message is left empty after this filtering, then the whole message is discarded. Then, each <tt>multipart/alternative</tt> section will be replaced by just the first alternative that is non-empty after filtering. <p>Finally, any <tt>text/html</tt> parts that are left in the message may be converted to <tt>text/plain</tt> if <a href="?VARHELP=contentfilter/convert_html_to_plaintext" >convert_html_to_plaintext</a> is enabled and the site is configured to allow these conversions.
tr: Liste trafiði içeriði ile ilgili ilkeler. <p>Ýçerik filtreleme þu þekilde çalýþýr: listeye bir mesaj geldiðinde ve içerik filtrelemeyi etkinleþtirdiðinizde, önce her bir eklenti <a href="?VARHELP=contentfilter/filter_mime_types">filtre türleriyle</a> karþýlaþtýrýlýr. Eðer eklenti türü filtre türlerinden biriyle eþleþiyorsa, gözardý edilir. <p>Sonra, eðer <a href="?VARHELP=contentfilter/pass_mime_types">geçecek türler</a> tanýmlandýysa, geçecek türle <em>eþleþmeyen</em> eklentiler de gözardý edilir. Herhangi bir geçecek tür tanýmlanmadýysa bu denetim atlanýr. <p>Bu baþlangýç filtrelemesinden sonra boþ olan tüm <tt>multipart</tt> eklentiler silinir. Eðer bu filtrelemenin sonucunda ana mesaj boþ kaldýysa, tüm mesaj gözardý edilir. Sonra, her <tt>multipart/alternative</tt> bölümü, filtreleme sonrasýnda boþ kalmayan ilk seçenek (alternative) ile deðiþtirilir. <p>En son olarak, eðer <a href="?VARHELP=contentfilter/convert_html_to_plaintext" >convert_html_to_plaintext</a> etkinse ve site bu dönüþtürmeleri destekliyorsa, mesajda kalan her <tt>text/html</tt> bölümü <tt>text/plain</tt> þekline dönüþtürülür.
