Repository: apple-open-source/macos
Catalog: fetchmail/fetchmail/po/*.po
Languages: sk

source: (default)
sk: (implicitná hodnota)

source: Messages will be appended to %s as BSMTP
sk: Správy budú pripojené k %s ako BSMTP

source: Messages will be delivered with "%s".
sk: Správy budú doruèené s "%s".

source: Messages will be %cMTP-forwarded to:
sk: Správy budú %cMTP-dopravené na:

source: Host part of MAIL FROM line will be %s
sk: Hos»ová èas» z MAIL FROM riadku bude %s

source: Address to be put in RCPT TO lines shipped to SMTP will be %s
sk: Adresa, ktorá sa pou¾ije v RCPT TO a bude doruèená v SMTP bude %s

source: Recognized listener spam block responses are:
sk: Rozpoznané SPAM-blokované odpovede prijímaèa sú:

source: Spam-blocking disabled
sk: SPAM-blokovanie vypnuté

source: Server connection will be brought up with "%s".
sk: Spojenie so servrom bude aktivované s "%s".

source: No pre-connection command.
sk: Príkaz spú¹»aný pred spojením neexistuje.

source: Server connection will be taken down with "%s".
sk: Spojenie so servrom bude ukonèené s "%s".

source: No post-connection command.
sk: Príkaz spú¹»aný po spojení neexistuje.

source: No localnames declared for this host.
sk: Nie sú definované ¾iadne lokálne názvy pre tohto hostiteµa.

source: Multi-drop mode:
sk: Multi-drop mód:

source: Single-drop mode:
sk: Single-drop mód:

source: %d local name(s) recognized.
sk: %d rozpoznaných lokálnych názvov.

source: DNS lookup for multidrop addresses is %s.
sk: DNS vyhµadávanie pre multi-drop adresy je %s.

source: Server aliases will be compared with multidrop addresses by
sk: Prezývky servra budú porovnávané s multi-drop adresami pomocou

source: IP address.
sk: IP adries.

source: name.
sk: mien.

source: Envelope-address routing is disabled
sk: Smerovanie adries obálok nie je aktivované

source: Envelope header is assumed to be: %s
sk: Predpokladá sa záhlavie obálky: %s

source: Received
sk: Prijaté

source: Number of envelope header to be parsed: %d
sk: Poèet záhlaví obálok na analýzu: %d

source: Prefix %s will be removed from user id
sk: Prefix %s bude odstránený z pou¾ívateµovho id

source: No prefix stripping
sk: ®iadne odstránenie prefixu

source: Predeclared mailserver aliases:
sk: Preddeklarované prezývky po¹tového servra:

source: Local domains:
sk: Lokálne domény:

source: Connection must be through interface %s.
sk: Spojenie musí by» realizované pomocou rozhrania %s.

source: No interface requirement specified.
sk: Neboli ¹pecifikované ¾iadne po¾iadavky na rozhranie.

source: Polling loop will monitor %s.
sk: Dotazovací cyklus s monitorom %s.

source: No monitor interface specified.
sk: Nebolo ¹pecifikované ¾iadne monitorovacie rozhranie.

source: Server connections will be made via plugin %s (--plugin %s).
sk: Spojenie so servrom bude realizované pomocou plugin-u %s (--plugin %s).

source: No plugin command specified.
sk: Nebol ¹pecifikovaný ¾iadny príkaz pre plugin.

source: Listener connections will be made via plugout %s (--plugout %s).
sk: Spojenia s prijímaèom budú realizované pomocou plugout-u %s (--plugout %s).

source: No plugout command specified.
sk: Nebol ¹pecifikovaný ¾iadny príkaz pre plugout.

source: No UIDs saved from this host.
sk: Neboli ulo¾ené ¾iadne UID-y z tohoto hostiteµa.

source: %d UIDs saved.
sk: %d UID-ov ulo¾ených.

source: Poll trace information will be added to the Received header.
sk: Informácia o trase dotazu bude pridaná do záhlavia Received.

source: No poll trace information will be added to the Received header. .
sk: Do záhlavia Received nebude pridaná ¾iadna informácia o trase s»ahovania. .

source: Pass-through properties "%s".
sk: Vlastnosti prechodu "%s".

source: alloca failed
sk: alloca neúspe¹né

source: ERROR: no support for getpassword() routine
sk: CHYBA: ¾iadna podpora pre rutinu getpassword()

source: Caught SIGINT... bailing out.
sk: SIGINT obdr¾ané... konèím.

source: Couldn't get service name for [%s]
sk: Nemô¾em získa» názov slu¾by pre [%s]

source: Using service name [%s]
sk: Pou¾ívam názov slu¾by [%s]

source: Sending credentials
sk: Posielam osobné údaje

source: Error exchanging credentials
sk: Chyba pri výmene osobných údajov

source: Couldn't unwrap security level data
sk: Nemô¾em rozbali» dáta bezpeènostnej úrovne

source: Credential exchange complete
sk: Výmena osobných údajov kompletná

source: Server requires integrity and/or privacy
sk: Server po¾aduje integritu a/alebo súkromie

source: Unwrapped security level flags: %s%s%s
sk: Rozbalené príznaky bezpeènostnej úrovne: %s%s%s

source: Maximum GSS token size is %ld
sk: Maximálna veµkos» GSS symbolu je %ld

source: Error creating security level request
sk: Chyba pri vytváraní ¾iadosti bezpeènostnej úrovne

source: Releasing GSS credentials
sk: Uvoµòujem osobné údaje GSS

source: Error releasing credentials
sk: Chyba pri uvoµòovaní osobných údajov

source: fetchmail: thread sleeping for %d sec.
sk: fetchmail: vlákno uspaté na %d sekúnd.

source: Protocol identified as IMAP4 rev 1
sk: Protokol identifikovaný ako IMAP4 rev 1

source: Protocol identified as IMAP4 rev 0
sk: Protokol identifikovaný ako IMAP4 rev 0

source: Protocol identified as IMAP2 or IMAP2BIS
sk: Protokol identifikovaný ako IMAP2 alebo IMAP2BIS

source: will idle after poll
sk: bude neèinný po stiahnutí

source: Required OTP capability not compiled into fetchmail
sk: Po¾adovaná funkcia OTP nebola prelo¾ená do fetchmail-u

source: Required NTLM capability not compiled into fetchmail
sk: Po¾adovaná funkcia NTLM nebola prelo¾ená do fetchmail-u

source: Required LOGIN capability not supported by server
sk: Po¾adovaná funkcia LOGIN nie je podporovaná servrom

source: expunge failed
sk: vymazanie zlyhalo

source: re-poll failed
sk: stiahnutie zlyhalo

source: %d messages waiting after re-poll
sk: %d správ èaká po stiahnutí

source: mailbox selection failed
sk: výber po¹tového prieèinka zlyhal

source: %d messages waiting after first poll
sk: %d správ èaká po prvom stiahnutí

source: %d messages waiting after expunge
sk: %d správ èaká po prvom vymazaní

source: search for unseen messages failed
sk: vyhµadávanie nepreèítaných správ zlyhalo

source: %u is unseen
sk: %u je nepreèítaných

source: Unable to open kvm interface. Make sure fetchmail is SGID kmem.
sk: Nemô¾em otvori» rozhranie kvm, uistite sa ¾e fetchmail má nastavené SGID kmem

source: Unable to parse interface name from %s
sk: Nemô¾em analyzova» názov rozhrania z %s

source: get_ifinfo: sysctl (iflist estimate) failed
sk: get_ifinfo: sysctl (iflist odhad) zlyhal

source: get_ifinfo: malloc failed
sk: get_ifinfo: malloc zlyhal

source: get_ifinfo: sysctl (iflist) failed
sk: get_ifinfo: sysctl (iflist) zlyhal

source: Routing message version %d not understood.
sk: Verzia smerovania správy %d nerozpoznaná.

source: No interface found with name %s
sk: Nebolo nájdené ¾iadne rozhranie s názvom %s

source: No IP address found for %s
sk: Nebola nájdená ¾iadna IP adresa pre %s

source: missing IP interface address
sk: chýbajúca IP adresa rozhrania

source: invalid IP interface address
sk: neplatná IP adresa rozhrania

source: invalid IP interface mask
sk: neplatná IP maska rozhrania

source: activity on %s -noted- as %d
sk: aktivita na %s -zaznamenaná- ako %d

source: skipping poll of %s, %s down
sk: s»ahovanie z %s vynechané, %s je nedostupný

source: skipping poll of %s, %s IP address excluded
sk: s»ahovanie z %s vynechané, IP adresa %s je vylúèená

source: activity on %s checked as %d
sk: aktivita na %s skontrolovaná ako %d

source: skipping poll of %s, %s inactive
sk: s»ahovanie z %s vynechané, %s neaktívny

source: could not decode initial BASE64 challenge
sk: nemô¾em dekódova» poèiatoènú BASE64 výzvu

source: non-null instance (%s) might cause strange behavior
sk: nenulová in¹tancia (%s) mô¾e spôsobi» zvlá¹tne správanie

source: could not decode BASE64 ready response
sk: nemô¾em dekódova» BASE64 odpoveï o pripravenosti

source: fetchmail: removing stale lockfile
sk: fetchmail: odstraòujem starý zamykací súbor

source: fetchmail: lock creation failed.
sk: fetchmail: vytvorenie zámky zlyhalo.

source: warning: found "%s" before any host names
sk: varovanie: nájdené "%s" pred niektorými názvami hostiteµa

source: %s:%d: warning: found "%s" before any host names
sk: %s:%d: varovanie: nájdené "%s" pred niektorými názvami hostiteµa

source: %s:%d: warning: unknown token "%s"
sk: %s:%d: varovanie: neznámy symbol "%s"

source: %s's SMTP listener does not support ATRN
sk: SMTP prijímaè %s nepodporuje ATRN

source: ATRN request refused.
sk: ATRN ¾iados» zamietnutá.

source: Unable to process ATRN request now
sk: Nie je mo¾né teraz spracova» ATRN ¾iados»

source: You have no mail.
sk: Nemáte po¹tu.

source: Command not implemented
sk: Príkaz nie je implementovaný

source: Authentication required.
sk: Autentifikácia po¾adovaná.

source: Unknown ODMR error %d
sk: Neznáma ODMR chyba %d

source: Option --keep is not supported with ODMR
sk: Voµba --keep nie je podporovaná s ODMR

source: Option --flush is not supported with ODMR
sk: Voµba --flush nie je podporovaná s ODMR

source: Option --remote is not supported with ODMR
sk: Voµba --remote nie je podporovaná s ODMR

source: Option --check is not supported with ODMR
sk: Voµba --check nie je podporovaná s ODMR

source: Could not decode OTP challenge
sk: Nie je mo¾né dekódova» OTP výzvu

source: String '%s' is not a valid number string.
sk: Re»azec '%s' nie je platný èíselny re»azec.

source: Value of string '%s' is %s than %d.
sk: Hodnota re»azca '%s' je %s ako %d.

source: smaller
sk: men¹ia

source: larger
sk: väè¹ia

source: Invalid protocol `%s' specified.
sk: ©pecifikovaný neplatný protokol `%s'.

source: Invalid authentication `%s' specified.
sk: ©pecifikovaná neplatná autentifikácia `%s'.

source: fetchmail: network security support is disabled
sk: fetchmail: podpora sie»ovej bezpeènosti je zakázaná

source: usage: fetchmail [options] [server ...]
sk: pou¾itie: fetchmail [prepínaèe] [server ...]

source: Options are as follows:
sk: Prepínaèe sú nasledovné:

source: -?, --help display this option help
sk: -?, --help zobraz tohto pomocníka

source: -V, --version display version info
sk: -V, --version zobraz informáciu o verzii

source: -c, --check check for messages without fetching
sk: -c, --check skontroluj správy bez stiahnutia

source: -s, --silent work silently
sk: -s, --silent pracuj potichu

source: -v, --verbose work noisily (diagnostic output)
sk: -v, --verbose pracuj hluène (diagnostický výstup)

source: -d, --daemon run as a daemon once per n seconds
sk: -d, --daemon spusti ako démon raz za n sekúnd

source: -N, --nodetach don't detach daemon process
sk: -N, --nodetach neodpájaj proces démona

source: -q, --quit kill daemon process
sk: -q, --quit zabi proces démona

source: -L, --logfile specify logfile name
sk: -L, --logfile ¹pecifikuj názov log-súboru

source: --syslog use syslog(3) for most messages when running as a daemon
sk: --syslog pou¾i syslog(3) pre väè¹inu správ keï be¾í ako démon

source: -f, --fetchmailrc specify alternate run control file
sk: -f, --fetchmailrc ¹pecifikuj náhradný spú¹»ací riadiaci súbor

source: -i, --idfile specify alternate UIDs file
sk: -i, --idfile ¹pecifikuj náhradný súbor UID-ov

source: analyzing Received line: %s
sk: analýza riadku Received: %s

source: line accepted, %s is an alias of the mailserver
sk: riadok akceptovaný, %s je alias po¹tového servra

source: line rejected, %s is not an alias of the mailserver
sk: riadok zamietnutý, %s nie je alias po¹tového servra

source: no Received address found
sk: nenájdená adresa Received

source: found Received address `%s'
sk: nájdená adresa Received `%s'

source: message delimiter found while scanning headers
sk: oddeµovaè správy nájdený pri prezeraní záhlaví

source: incorrect header line found while scanning headers
sk: nesprávny riadok záhlavia nájdený pri prezeraní záhlaví

source: no local matches, forwarding to %s
sk: ¾iadne lokálne zhody, posielam na %s

source: forwarding and deletion suppressed due to DNS errors
sk: odoslanie a zmazanie odlo¾ené kvôli DNS chybám

source: no recipient addresses matched declared local names
sk: ¾iadna adresa príjemcu nezodpovedá zadaným lokálnym menám

source: recipient address %s didn't match any local name
sk: adresa príjemcu %s nezodpovedá ¾iadnemu lokálnemu menu

source: message has embedded NULs
sk: správa obsahuje NUL-y

source: SMTP listener rejected local recipient addresses:
sk: SMTP prijímaè zamietol lokálne adresy príjemcu:

source: writing message text
sk: zápis textu správy

source: Old UID list from %s:
sk: Starý zoznam UID z %s:

source: <empty>
sk: <prázdny>

source: Scratch list of UIDs:
sk: Doèasný zoznam UID-ov:

source: New UID list from %s:
sk: Nový zoznam UID z %s:

source: swapping UID lists
sk: vymieòam zoznamy UID

source: not swapping UID lists, no UIDs seen this query
sk: nevymieòam zoznamy UID, ¾iadne UID-y nevideli túto po¾iadavku

source: Deleting fetchids file.
sk: Ma¾em súbor fetchids.

source: Writing fetchids file.
sk: Zapisujem súbor fetchids.

source: malloc failed
sk: malloc zlyhal

source: realloc failed
sk: realloc zlyhal
