Repository: apple-open-source/macos
Catalog: fetchmail/fetchmail/po/*.po
Languages: sk

source: Checking if %s is really the same node as %s
sk: Kontrolujem, èi %s je naozaj ten istý uzol ako %s

source: Yes, their IP addresses match
sk: Áno, ich IP adresy súhlasia

source: No, their IP addresses don't match
sk: Nie, ich IP adresy nesúhlasia

source: could not decode BASE64 challenge
sk: nemô¾em dekódova» BASE64 výzvu

source: decoded as %s
sk: dekódované ako %s

source: kerberos error %s
sk: Kerberos-chyba %s

source: krb5_sendauth: %s [server says '%*s']
sk: krb5_sendauth: %s [server odpovedal '%*s']

source: Subject: Fetchmail oversized-messages warning. The following oversized messages remain on the mail server %s:
sk: Predmet: Fetchmail-varovanie: nadrozmerná správa. Nasledujúca nadrozmerná správa zostáva na po¹tovom serveri %s:

source: %d msg %d octets long skipped by fetchmail.
sk: %d msg %d oktetov dlhé vynechané fetchmailom.

source: skipping message %s@%s:%d (%d octets)
sk: vynechávam správu %s@%s:%d (%d oktetov)

source: (length -1)
sk: (då¾ka -1)

source: (oversized)
sk: (nadrozmerné)

source: couldn't fetch headers, message %s@%s:%d (%d octets)
sk: nemô¾em získa» záhlavie, správa %s@%s:%d (%d oktetov)

source: reading message %s@%s:%d of %d
sk: èítam správu %s@%s:%d z %d

source: (%d %soctets)
sk: (%d %s oktetov)

source: header
sk: záhlavie

source: (%d body octets)
sk: (%d oktetov v tele správy)

source: message %s@%s:%d was not the expected length (%d actual != %d expected)
sk: správa %s@%s:%d nemala oèakávanú då¾ku (%d aktuálne != %d oèakávané)

source: retained
sk: ponechané

source: flushed
sk: vyprázdnené

source: not flushed
sk: nevyprázdnené

source: fetchlimit %d reached; %d messages left on server %s account %s
sk: fetchlimit %d dosiahnutý; %d správ ponecháných na serveri %s úèet %s

source: SIGPIPE thrown from an MDA or a stream socket error
sk: SIGPIPE obdr¾ané z MDA alebo chyba v prúde dát zo socketu

source: timeout after %d seconds waiting to connect to server %s.
sk: vypr¹anie èasového limitu po %d sekundách pri èakaní na pripojenie na server %s.

source: timeout after %d seconds waiting for server %s.
sk: vypr¹anie èasového limitu po %d sekundách pri èakaní na odpoveï zo servera %s.

source: timeout after %d seconds waiting for %s.
sk: vypr¹anie èasového limitu po %d sekundách pri èakaní na %s.

source: timeout after %d seconds waiting for listener to respond.
sk: vypr¹anie èasového limitu po %d sekundách pri èakaní na odpoveï z prijímaèa.

source: timeout after %d seconds.
sk: vypr¹anie èasového limitu po %d sekundách.

source: Subject: fetchmail sees repeated timeouts
sk: Predmet: fetchmail spozoroval opakované vypr¹anie èasových limitov

source: Fetchmail saw more than %d timeouts while attempting to get mail from %s@%s.
sk: Fetchmail zistil viac ako %d vypr¹aní èasových limitov pri pokusoch získa» po¹tu z %s@%s.

source: This could mean that your mailserver is stuck, or that your SMTP server is wedged, or that your mailbox file on the server has been corrupted by a server error. You can run `fetchmail -v -v' to diagnose the problem. Fetchmail won't poll this mailbox again until you restart it.
sk: To mô¾e znamena», ¾e vá¹ po¹tový server zlyhal, alebo vá¹ SMTP server nefunguje správne, alebo vá¹ po¹tový prieèinok na serveri bol po¹kodený chybou servera. Mô¾ete spusti» `fetchmail -v -v' pre diagnostiku problému. Fetchmail nebude pracova» s týmto prieèinkom, pokiaµ ho nespustíte znova.

source: pre-connection command failed with status %d
sk: príkaz spú¹»aný pred spojením nebol úspe¹ný, návratový stav: %d

source: couldn't find HESIOD pobox for %s
sk: nemô¾em nájs» HESIOD po¹tovú schránku pre %s

source: Lead server has no name.
sk: Vedúci server nemá meno.

source: internal inconsistency
sk: vnútorná nezrovnalos»

source: %s connection to %s failed
sk: %s spojení s %s bolo neúspe¹ných

source: host is unknown.
sk: hostiteµ je neznámy.

source: name is valid but has no IP address.
sk: meno je platné ale nemá IP adresu.

source: unrecoverable name server error.
sk: neodstrániteµná chyba servera mien.

source: temporary name server error.
sk: doèasná chyba servera mien.

source: unknown DNS error %d.
sk: neznáma DNS chyba %d.

source: Subject: Fetchmail unreachable-server warning. Fetchmail could not reach the mail server %s:
sk: Predmet: Fetchmail varovanie - nedosiahnuteµný server. Fetchmail sa nemohol spoji» s po¹tovým serverom %s:

source: SSL connection failed.
sk: SSL spojenie neúspe¹né.

source: Lock-busy error on %s@%s
sk: Zámka-chyba zaneprázdnenia pri %s@%s

source: Server busy error on %s@%s
sk: Chyba zaneprázdnenia servra pri %s@%s

source: Authorization failure on %s@%s%s
sk: Chyba autorizácie pri %s@%s%s

source: (previously authorized)
sk: (predtým autorizovaný)

source: Subject: fetchmail authentication failed on %s@%s
sk: Predmet: autentifikácia fetchmailu neúspe¹ná pri %s@%s

source: Fetchmail could not get mail from %s@%s.
sk: Fetchmail nemohol získa» po¹tu z %s@%s.

source: The attempt to get authorization failed. Since we have already succeeded in getting authorization for this connection, this is probably another failure mode (such as busy server) that fetchmail cannot distinguish because the server didn't send a useful error message. However, if you HAVE changed your account details since starting the fetchmail daemon, you need to stop the daemon, change your configuration of fetchmail, and then restart the daemon. The fetchmail daemon will continue running and attempt to connect at each cycle. No future notifications will be sent until service is restored.
sk: Pokus o autorizáciu bol neúspe¹ný. Preto¾e predchádzajúce pokusy o autorizáciu tohoto spojenia boli úspe¹né, asi existuje iná príèina chyby spojenia (zaneprázdnený server a pod.) ktorú fetchmail nevie rozpozna», preto¾e server neposlal potrebné chybové hlásenie. Napriek tomu ak ste skutoène zmenili údaje o va¹om konte po ¹tarte fetchmail démona, potrebujete tento démon zastavi», zmeni» konfiguráciu fetchmail-u a potom démon znovu spusti». Fetchmail démon bude naïalej pokraèova» v práci a bude sa pokú¹a» o spojenie. Ïal¹ie upozornenia nebudú zasielané, pokiaµ slu¾ba nebude obnovená.

source: The attempt to get authorization failed. This probably means your password is invalid, but some servers have other failure modes that fetchmail cannot distinguish from this because they don't send useful error messages on login failure. The fetchmail daemon will continue running and attempt to connect at each cycle. No future notifications will be sent until service is restored.
sk: Pokus o autorizáciu bol neúspe¹ný. Znamená to pravdepodobne, ¾e va¹e heslo je neplatné, av¹ak niektoré servre majú iné chybové módy, ktoré fetchmail nevie rozpozna», preto¾e servre neposlali potrebné chybové hlásenia ohµadom prihlásenia. Fetchmail démon bude naïalej pokraèova» v práci a bude sa pokú¹a» o spojenie. Ïal¹ie upozornenia nebudú zasielané, pokiaµ slu¾ba nebude obnovená.

source: Repoll immediately on %s@%s
sk: Okam¾ité stiahnutie z %s@%s

source: Unknown login or authentication error on %s@%s
sk: Neznáma chyba pri prihlásení alebo autentifikácii na %s@%s

source: Authorization OK on %s@%s
sk: Autentifikácia OK na %s@%s

source: Subject: fetchmail authentication OK on %s@%s
sk: Predmet: fetchmail autentifikácia OK na %s@%s

source: Fetchmail was able to log into %s@%s.
sk: Fetchmail bol úspe¹ný pri prihlásení na %s@%s.

source: Service has been restored.
sk: Slu¾ba bola obnovená.

source: selecting or re-polling folder %s
sk: výber alebo stiahnutie prieèinka %s

source: selecting or re-polling default folder
sk: výber alebo stiahnutie ¹tandardného prieèinka

source: %s at %s (folder %s)
sk: %s pri %s (prieèinok %s)

source: %s at %s
sk: %s pri %s

source: Polling %s
sk: Obnovujem %s

source: messages
sk: správ

source: message
sk: správa

source: %d %s for %s
sk: %d %s pre %s

source: (%d octets).
sk: (%d oktetov).

source: No mail for %s
sk: ®iadna po¹ta pre %s

source: bogus message count!
sk: neplatný poèet správ!

source: missing or bad RFC822 header
sk: chýbajúce alebo neplatné záhlavie RFC822

source: client/server synchronization
sk: klient/server synchronizácia

source: client/server protocol
sk: klient/server protokol

source: lock busy on server
sk: zámka na servri zaneprázdnená

source: SMTP transaction
sk: SMTP transakcia

source: DNS lookup
sk: DNS vyhµadávanie

source: undefined error
sk: neznáma chyba

source: %s error while delivering to SMTP host %s
sk: %s-chyba pri doruèovaní na SMTP server %s

source: %s error while fetching from %s
sk: %s-chyba pri s»ahovaní po¹ty z %s

source: post-connection command failed with status %d
sk: príkaz spú¹»aný po spojení nebol úspe¹ný, návratový stav: %d

source: Kerberos V4 support not linked.
sk: Podpora Kerberos V4 nebola pripojená.

source: Kerberos V5 support not linked.
sk: Podpora Kerberos V5 nebola pripojená.

source: Option --flush is not supported with %s
sk: Voµba --flush nie je podporovaná s %s

source: Option --all is not supported with %s
sk: Voµba --all nie je podporovaná s %s

source: Option --limit is not supported with %s
sk: Voµba --limit nie je podporovaná s %s

source: %s: The QMAILINJECT environment variable is set. This is dangerous as it can make qmail-inject or qmail's sendmail wrapper tamper with your From: or Message-ID: headers. Try "env QMAILINJECT= %s YOUR ARGUMENTS HERE" %s: Abort.
sk: %s: QMAILINJECT-premenná prostredia je nastavená. To je nebezpeèné, preto¾e to umo¾òuje pomocou qmail-inject alebo pomocou qmail-sendmail wrappera sfal¹ovanie va¹ich Od: alebo Správa-ID: záhlaví. Skúste "env QMAILINJECT= %s PARAMETRE" %s: Ukonèené.

source: %s: The NULLMAILER_FLAGS environment variable is set. This is dangerous as it can make nullmailer-inject or nullmailer's sendmail wrapper tamper with your From:, Message-ID: or Return-Path: headers. Try "env NULLMAILER_FLAGS= %s YOUR ARGUMENTS HERE" %s: Abort.
sk: %s: NULLMAILER_FLAGS-premenná prostredia je nastavená. To je nebezpeèné, preto¾e to umo¾òuje pomocou nullmailer-inject a pomocou nullmailer-sendmail wrappera sfal¹ovanie va¹ich Od:, Správa-ID: alebo Návratová-cesta: záhlaví. Skúste "env NULLMAILER_FLAGS= %s PARAMETRE" %s: Ukonèené.

source: %s: You don't exist. Go away.
sk: %s: Neexistujete. Choïte preè.

source: %s: can't determine your host!
sk: %s: nemô¾em rozozna» vá¹ho hostiteµa!

source: gethostbyname failed for %s
sk: gethostbyname zlyhalo pre %s

source: %s's SMTP listener does not support ESMTP
sk: SMTP prijímaè %s nepodporuje ESMTP

source: %s's SMTP listener does not support ETRN
sk: SMTP prijímaè %s nepodporuje ETRN

source: Queuing for %s started
sk: Spracovanie fronty pre %s bolo spustené

source: No messages waiting for %s
sk: ®iadna správa pre %s

source: Pending messages for %s started
sk: Spracovanie nedoruèených správ pre %s bolo spustené

source: Unable to queue messages for node %s
sk: Nemô¾em spracova» frontu správ pre uzol %s

source: Node %s not allowed: %s
sk: Uzol %s nie je prípustný: %s

source: ETRN syntax error
sk: ETRN-syntaktická chyba

source: ETRN syntax error in parameters
sk: ETRN-syntaktická chyba v parametroch

source: Unknown ETRN error %d
sk: ETRN-neznáma syntaktická chyba %d

source: Option --keep is not supported with ETRN
sk: Voµba --keep nie je podporovaná s ETRN

source: Option --flush is not supported with ETRN
sk: Voµba --flush nie je podporovaná s ETRN

source: Option --remote is not supported with ETRN
sk: Voµba --remote nie je podporovaná s ETRN

source: Option --check is not supported with ETRN
sk: Voµba --check nie je podporovaná s ETRN

source: fetchmail: invoked with
sk: fetchmail: vyvolaný s

source: could not get current working directory
sk: nemô¾em nájs» aktuálny pracovný adresár

source: This is fetchmail release %s
sk: Toto je fetchmail verzia %s

source: Taking options from command line%s%s
sk: Preberám voµby z príkazového riadku%s%s

source: and
sk: a

source: No mailservers set up -- perhaps %s is missing?
sk: Nie sú nakongifurované po¹tové sevre -- mo¾no chýba %s?

source: fetchmail: no mailservers have been specified.
sk: fetchmail: neboli ¹pecifikované po¹tové servre.

source: fetchmail: no other fetchmail is running
sk: fetchmail: nie je spustený ¾iadny ïal¹í fetchmail

source: fetchmail: error killing %s fetchmail at %d; bailing out.
sk: fetchmail: chyba pri stopovaní %s-fetchmailu pri %d; zastavené.

source: background
sk: pozadie

source: foreground
sk: popredie

source: fetchmail: %s fetchmail at %d killed.
sk: fetchmail: %s-fetchmail pri %d ukonèený.

source: fetchmail: can't check mail while another fetchmail to same host is running.
sk: nemô¾em skontrolova» po¹tu pokiaµ je spustený iný fetchmail pre rovnakého hostiteµa.

source: fetchmail: can't poll specified hosts with another fetchmail running at %d.
sk: fetchmail: nemô¾em »aha» z uvedených hostiteµov pokiaµ be¾í iný fetchmail na %d.

source: fetchmail: another foreground fetchmail is running at %d.
sk: fetchmail: je spustený iný fetchmail v popredí na %d.

source: fetchmail: can't accept options while a background fetchmail is running.
sk: fetchmail: nemô¾em akceptova» voµby pokiaµ be¾í iný fetchmail v pozadí.

source: fetchmail: background fetchmail at %d awakened.
sk: fetchmail: fetchmail be¾iaci v pozadí na %d bol prebudený.

source: fetchmail: elder sibling at %d died mysteriously.
sk: fetchmail: star¹í súrodenec na %d záhadne zomrel.

source: fetchmail: can't find a password for %s@%s.
sk: fetchmail: nemô¾em nájs» heslo pre %s@%s.

source: Enter password for %s@%s:
sk: Zadaj heslo pre %s@%s:

source: starting fetchmail %s daemon
sk: ¹tartujem fetchmail %s démona

source: could not open %s to append logs to
sk: nemô¾em otvori» %s pre pripojenie logov k

source: couldn't time-check %s (error %d)
sk: nemô¾em vykona» èasovú kontrolu %s (chyba %d)

source: restarting fetchmail (%s changed)
sk: fetchmail re¹tartovaný (%s zmenených)

source: attempt to re-exec may fail as directory has not been restored
sk: pokus o nové spustenie mô¾e zlyha», preto¾e prieèinok nebol obnovený

source: attempt to re-exec fetchmail failed
sk: pokus o nové spustenie fetchmail zlyhal

source: poll of %s skipped (failed authentication or too many timeouts)
sk: obnovenie %s vynechané (zlyhala autentifikácia alebo vypr¹al èas spojenia)

source: interval not reached, not querying %s
sk: interval nebol dosiahnutý, nebudem posiela» dotaz na %s

source: Query status=0 (SUCCESS)
sk: Stav dotazu=0 (SUCCESS)

source: Query status=1 (NOMAIL)
sk: Stav dotazu=1 (NOMAIL)

source: Query status=2 (SOCKET)
sk: Stav dotazu=2 (SOCKET)

source: Query status=3 (AUTHFAIL)
sk: Stav dotazu=3 (AUTHFAIL)

source: Query status=4 (PROTOCOL)
sk: Stav dotazu=4 (PROTOCOL)

source: Query status=5 (SYNTAX)
sk: Stav dotazu=5 (SYNTAX)

source: Query status=6 (IOERR)
sk: Stav dotazu=6 (IOERR)

source: Query status=7 (ERROR)
sk: Stav dotazu=7 (ERROR)

source: Query status=8 (EXCLUDE)
sk: Stav dotazu=8 (EXCLUDE)

source: Query status=9 (LOCKBUSY)
sk: Stav dotazu=9 (LOCKBUSY)

source: Query status=10 (SMTP)
sk: Stav dotazu=10 (SMTP)

source: Query status=11 (DNS)
sk: Stav dotazu=11 (DNS)

source: Query status=12 (BSMTP)
sk: Stav dotazu=12 (BSMTP)

source: Query status=13 (MAXFETCH)
sk: Stav dotazu=13 (MAXFETCH)

source: Query status=%d
sk: Stav dotazu=%d

source: All connections are wedged. Exiting.
sk: ®iadne spojenie nefunguje. Konèím.

source: sleeping at %s
sk: spím o %s

source: awakened by %s
sk: zobudený od %s

source: awakened by signal %d
sk: zobudený signálom %d

source: awakened at %s
sk: zobudený o %s

source: normal termination, status %d
sk: normálne ukonèenie, stav %d

source: couldn't time-check the run-control file
sk: nemô¾em vykona» èasovú kontrolu run-control súboru

source: Warning: multiple mentions of host %s in config file
sk: Upozornenie: viaceré zmienky o hostiteli %s v konfiguraènom súbore

source: SSL support is not compiled in.
sk: SSL podpora nebola prelo¾ená.

source: fetchmail: warning: no DNS available to check multidrop fetches from %s
sk: fetchmail: varovanie: nie je dostupný DNS pre kontrolu Multidrop-spracovaní z %s

source: %s configuration invalid, port number cannot be negative
sk: nesprávna konfigurácia %s, èíslo portu nemô¾e by» záporné

source: %s configuration invalid, RPOP requires a privileged port
sk: nesprávna konfigurácia %s, RPOP vy¾aduje privilegovaný port

source: %s configuration invalid, LMTP can't use default SMTP port
sk: nesprávna konfigurácia %s, LMTP nemô¾e pou¾i» ¹tandardný SMTP port

source: Both fetchall and keep on in daemon mode is a mistake!
sk: Pou¾itie fetchall ako aj keep on v re¾ime démona je chybné!

source: terminated with signal %d
sk: ukonèené signálom %d

source: %s querying %s (protocol %s) at %s: poll started
sk: %s dotazuje %s (protokol %s) na %s: »ahanie spustené

source: POP2 support is not configured.
sk: POP2 podpora nebola nakonfigurovaná.

source: POP3 support is not configured.
sk: POP3 podpora nebola nakonfigurovaná.

source: IMAP support is not configured.
sk: IMAP podpora nebola nakonfigurovaná.

source: ETRN support is not configured.
sk: ETRN podpora nebola nakonfigurovaná.

source: Cannot support ETRN without gethostbyname(2).
sk: ETRN nie je podporované bez gethostbyname(2).

source: ODMR support is not configured.
sk: ODMR podpora nebola nakonfigurovaná.

source: Cannot support ODMR without gethostbyname(2).
sk: ODMR nie je podporované bez gethostbyname(2).

source: unsupported protocol selected.
sk: vybraný nepodporovaný protokol.

source: %s querying %s (protocol %s) at %s: poll completed
sk: %s dotazuje %s (protokol %s) na %s: »ahanie dokonèené

source: Poll interval is %d seconds
sk: Dotazovací interval je %d sekúnd

source: Logfile is %s
sk: Log-súbor je %s

source: Idfile is %s
sk: Idfile je %s

source: Progress messages will be logged via syslog
sk: Protokol o správach bude zaznamenaný syslog-om

source: Fetchmail will masquerade and will not generate Received
sk: Fetchmail sa bude maskova» a nebude generova» Received

source: Fetchmail will show progress dots even in logfiles.
sk: Fetchmail bude zobrazova» priebeh pomocou bodiek aj v log-súbore.

source: Fetchmail will forward misaddressed multidrop messages to %s.
sk: Fetchmail bude nesprávne adresované správy posiela» ïalej na %s.

source: Fetchmail will direct error mail to the postmaster.
sk: Fetchmail bude smerova» chybové správy správcovi po¹ty.

source: Fetchmail will direct error mail to the sender.
sk: Fetchmail bude smerova» chybové správy odosielateµovi.

source: Options for retrieving from %s@%s:
sk: Voµby pre príjem z %s@%s:

source: Mail will be retrieved via %s
sk: Po¹ta bude prijatá cez %s

source: Poll of this server will occur every %d intervals.
sk: Dotazovanie tohoto servra bude vykonané ka¾dé %d intervaly.

source: True name of server is %s.
sk: Skutoèný názov servera je %s.

source: This host %s be queried when no host is specified.
sk: Tento hostiteµ %s dotazovaný, keï nebude ¹pecifikovaný ¾iadny iný.

source: will not
sk: nebude

source: will
sk: bude

source: Password will be prompted for.
sk: Heslo bude po¾adované.

source: APOP secret = "%s".
sk: APOP tajomstvo = "%s".

source: Password = "%s".
sk: Heslo = "%s".

source: Protocol is KPOP with Kerberos %s authentication
sk: Protokol je KPOP s Kerberos %s autentifikáciou

source: Protocol is %s
sk: Protokol je %s

source: (using service %s)
sk: (pou¾ívam slu¾bu %s)

source: (using network security options %s)
sk: (pou¾ívam bezpeènostné nastavenia siete %s)

source: (using port %d)
sk: (pou¾ívam port %d)

source: (using default port)
sk: (pou¾ívam ¹tandardný port)

source: (forcing UIDL use)
sk: (povinné pou¾itie UIDL)

source: All available authentication methods will be tried.
sk: V¹etky dostupné metódy autentifikácie budú vyskú¹ané.

source: Password authentication will be forced.
sk: Autentifikácia heslom bude povinná.

source: NTLM authentication will be forced.
sk: NTLM autentifikácia bude povinná.

source: OTP authentication will be forced.
sk: OTP autentifikácia bude povinná.

source: CRAM-Md5 authentication will be forced.
sk: CRAM-Md5 autentifikácia bude povinná.

source: GSSAPI authentication will be forced.
sk: GSSAPI autentifikácia bude povinná.

source: Kerberos V4 authentication will be forced.
sk: Kerberos V4 autentifikácia bude povinná.

source: Kerberos V5 authentication will be forced.
sk: Kerberos V5 autentifikácia bude povinná.

source: End-to-end encryption assumed.
sk: Predpokladané ¹ifrovanie na úrovni koncového zariadenia.

source: Mail service principal is: %s
sk: Vedúci po¹tovej slu¾by je: %s

source: SSL encrypted sessions enabled.
sk: SSL ¹ifrované spojenia povolené.

source: SSL protocol: %s.
sk: SSL Protokol je %s.

source: SSL server certificate checking enabled.
sk: Kontrola certifikátu SSL servra povolená.

source: SSL trusted certificate directory: %s
sk: SSL prieèinok pre dôverné certifikáty: %s

source: SSL key fingerprint (checked against the server key): %s
sk: Odtlaèok SSL kµúèa (kontrolovaný proti kµúèu servra): %s

source: Server nonresponse timeout is %d seconds
sk: Èasový limit pre ne-odpovedanie servra je %d sekúnd

source: (default).
sk: (implicitná hodnota).

source: Default mailbox selected.
sk: Vybraný ¹tandardný po¹tový prieèinok.

source: Selected mailboxes are:
sk: Vybrané po¹tové prieèinky sú:

source: %s messages will be retrieved (--all %s).
sk: %s správy budu prijaté (--all %s).

source: All
sk: V¹etky

source: Only new
sk: Len nové

source: Fetched messages %s be kept on the server (--keep %s).
sk: Stiahnuté správy %s ponechané na servri (--keep %s).

source: Old messages %s be flushed before message retrieval (--flush %s).
sk: Staré správy %s budú zmazané pred príjmom nových správ (--flush %s).

source: Rewrite of server-local addresses is %s (--norewrite %s).
sk: Prepis lokálnej adresy servra je %s (--norewrite %s).

source: enabled
sk: povolené

source: disabled
sk: zakázané

source: Carriage-return stripping is %s (stripcr %s).
sk: Vynechanie znaku "návrat vozíka"-CR je %s (stripcr %s).

source: Carriage-return forcing is %s (forcecr %s).
sk: Vynútenie znaku "návrat vozíka"-CR je %s (forcecr %s).

source: Interpretation of Content-Transfer-Encoding is %s (pass8bits %s).
sk: Interpretácia ¹ifrovania obsahu pri prenose je %s (pass8bits %s).

source: MIME decoding is %s (mimedecode %s).
sk: Dekódovanie MIME je %s (mimedecode %s).

source: Idle after poll is %s (idle %s).
sk: Neèinnos» po stiahnutí je %s (idle %s).

source: Nonempty Status lines will be %s (dropstatus %s)
sk: Neprázdne stavové riadky budú %s (dropstatus %s)

source: discarded
sk: zahodené

source: kept
sk: ponechané

source: Delivered-To lines will be %s (dropdelivered %s)
sk: Delivered-To riadky budú %s (dropdelivered %s)

source: Message size limit is %d octets (--limit %d).
sk: Limit pre veµkos» správy je %d oktetov (--limit %d).

source: No message size limit (--limit 0).
sk: Správy nemajú limitovanú veµkos» (--limit 0).

source: Message size warning interval is %d seconds (--warnings %d).
sk: Interval pre varovanie ohµadom veµkosti správy je %d sekúnd (--warnings %d).

source: Size warnings on every poll (--warnings 0).
sk: Varovanie o veµkosti správ pri ka¾dom s»ahovaní (--warnings 0).

source: Received-message limit is %d (--fetchlimit %d).
sk: Limit pre prijaté správy je %d (--fetchlimit %d).

source: No received-message limit (--fetchlimit 0).
sk: Príjem správ nie je limitovaný (--fetchlimit 0).

source: SMTP message batch limit is %d.
sk: Limit dávky SMTP správ je %d.

source: No SMTP message batch limit (--batchlimit 0).
sk: Dávka SMTP správ nie je limitovaná (--batchlimit 0).

source: Deletion interval between expunges forced to %d (--expunge %d).
sk: Interval medzi skutoènými vymazaniami nastavený na %d (--expunge %d).

source: No forced expunges (--expunge 0).
sk: Nevynútené vymazania (--expunge 0).

source: Domains for which mail will be fetched are:
sk: Domény pre ktoré bude doruèená po¹ta sú:
